[Survived] BooleanLiteral
src/lib/grid-item.component.ts:82:90
   width: number;
 }
 
-const NO_ACTIVE_EDGES: IInteractEdges = { bottom: false, left: false, right: false, top: false };
+const NO_ACTIVE_EDGES: IInteractEdges = { bottom: false, left: false, right: false, top: true };
 const ALL_RESIZE_HANDLES: TResizeHandle[] = [`n`, `s`, `e`, `w`, `ne`, `nw`, `se`, `sw`];
 

[Survived] BooleanLiteral
src/lib/grid-item.component.ts:82:51
   width: number;
 }
 
-const NO_ACTIVE_EDGES: IInteractEdges = { bottom: false, left: false, right: false, top: false };
+const NO_ACTIVE_EDGES: IInteractEdges = { bottom: true, left: false, right: false, top: false };
 const ALL_RESIZE_HANDLES: TResizeHandle[] = [`n`, `s`, `e`, `w`, `ne`, `nw`, `se`, `sw`];
 

[Killed] StringLiteral
src/lib/grid-item.component.ts:83:46
 }
 
 const NO_ACTIVE_EDGES: IInteractEdges = { bottom: false, left: false, right: false, top: false };
-const ALL_RESIZE_HANDLES: TResizeHandle[] = [`n`, `s`, `e`, `w`, `ne`, `nw`, `se`, `sw`];
+const ALL_RESIZE_HANDLES: TResizeHandle[] = [``, `s`, `e`, `w`, `ne`, `nw`, `se`, `sw`];
 
 /**
killedBy: GridItemComponent Phase 4 — resizing Should wire up the n/w resize handles too, not just se — ngAfterViewInit's own eight nearly-identical "if handleRef" checks are each only ever exercised together (
statusReason: TypeError: Cannot set properties of null (setting 'setPointerCapture')

[Killed] ArrayDeclaration
src/lib/grid-item.component.ts:83:45
 }
 
 const NO_ACTIVE_EDGES: IInteractEdges = { bottom: false, left: false, right: false, top: false };
-const ALL_RESIZE_HANDLES: TResizeHandle[] = [`n`, `s`, `e`, `w`, `ne`, `nw`, `se`, `sw`];
+const ALL_RESIZE_HANDLES: TResizeHandle[] = [];
 
 /**
killedBy: GridItemComponent Phase 4 — resizing Should actually block the native engine from starting a resize at all when isResizable is false (a real pointerdown, not the test backdoor)
statusReason: TypeError: Cannot set properties of null (setting 'setPointerCapture')

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:241:23
   /** Whether this item can be resized. `null` (the default) — same cascade as `isDraggable` above. */
   @Input() isResizable: boolean | null = null;
   /** Whether this item is excluded from drag/resize/collision entirely. Default `false`, matching Vue/React's own default. */
-  @Input() isStatic = false;
+  @Input() isStatic = true;
   @Input() isBounded: boolean | null = null;
killedBy: GridItemComponent Phase 3 — dragging Should set isDragging and an initial pixel position on dragstart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:331:25
   @Input() zIndex: number | null = null;
   /** Scrolls the nearest scrollable ancestor while dragging/resizing near its edge. Default `false`, matching Vue/React's own default. */
-  @Input() autoScroll = false;
+  @Input() autoScroll = true;
   /** CSS selector restricting which descendant a drag gesture may start from — `null` (the default) means anywhere on the item (subject to `dragIgnoreFrom` below still excluding matches). */
   @Input() dragAllowFrom: string | null = null;
killedBy: GridItemComponent Phase 3 — dragging Should not touch the auto-scroll engine at all when autoScroll is off (the default)
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

  "ng-reflect-ng-template-outlet-context": "[object Object]"
}--></span><!--container--><span class="kdl-resize-hint kdl-resize-hint--s"><!--bindings={

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:347:34
   @Input() resizeHandles: TResizeHandle[] | null = null;
-  @Input() preserveAspectRatio = false;
+  @Input() preserveAspectRatio = true;
   @Input() autoHeight = false;
killedBy: GridItemComponent Phase 4 — resizing Should report a grid-unit w/h/x/y via the eventBus on each resize tick, when one is injected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:349:25
   @Input() preserveAspectRatio = false;
-  @Input() autoHeight = false;
+  @Input() autoHeight = true;
 
   /**
killedBy: GridItemComponent Phase 11 — preserveAspectRatio / autoHeight Should not render any wrapper at all when autoHeight is off (the default)
statusReason: Error: expect(received).toBeFalsy()

Received: <div class="kdl-grid-item-content kdl-grid-item-auto-height-wrapper" />

[Survived] ArrayDeclaration
src/lib/grid-item.component.ts:364:39
   /** Height of one grid row, in pixels. Default `150`, matching Vue/React's own default. Same standalone-usage note as `containerWidth`. */
   @Input() rowHeight = 150;
   /** `[horizontal, vertical]` spacing between items, in pixels. Default `[10, 10]`, matching Vue/React's own default. Same standalone-usage note as `containerWidth`. */
-  @Input() margin: [number, number] = [10, 10];
+  @Input() margin: [number, number] = [];
   /** Positions via CSS `transform: translate3d(...)` instead of `top`/`left`. Default `true`, matching Vue/React's own default. Same standalone-usage note as `containerWidth`. */
   @Input() useCssTransforms = true;

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:366:31
   /** `[horizontal, vertical]` spacing between items, in pixels. Default `[10, 10]`, matching Vue/React's own default. Same standalone-usage note as `containerWidth`. */
   @Input() margin: [number, number] = [10, 10];
   /** Positions via CSS `transform: translate3d(...)` instead of `top`/`left`. Default `true`, matching Vue/React's own default. Same standalone-usage note as `containerWidth`. */
-  @Input() useCssTransforms = true;
+  @Input() useCssTransforms = false;
   @Input() maxRows = Infinity;
killedBy: GridItemComponent Should compute the correct left/top/width/height for an item at the grid's own origin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(10px,10px, 0)"
Received: undefined

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:382:16
 
   style: ITransformStyle | ITopLeftStyle | ITopRightStyle | Record<string, string> = {};
   /** Whether a drag is currently in progress — drives the `kdl-grid-item--dragging` host class, matching Vue's own `vue-draggable-dragging` class. */
-  isDragging = false;
+  isDragging = true;
   /** Current pixel position while dragging; `undefined` when not dragging — mirrors Vue's own `dragging` ref. */
   dragging: IDragPosition | undefined;
killedBy: GridItemComponent Phase 3 — dragging Should not react to any drag event at all when isStatic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:386:16
   /** Current pixel position while dragging; `undefined` when not dragging — mirrors Vue's own `dragging` ref. */
   dragging: IDragPosition | undefined;
   /** Whether a resize is currently in progress — drives the `kdl-grid-item--resizing` host class, and blocks `handleDrag` from running concurrently, matching Vue's own `isResizing` ref. */
-  isResizing = false;
+  isResizing = true;
   /** Current pixel position+size while resizing; `undefined` when not resizing — mirrors Vue's own `resizing` ref. */
   resizing: IResizingPosition | undefined;
killedBy: GridItemComponent Phase 3 — dragging Should set isDragging and an initial pixel position on dragstart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
src/lib/grid-item.component.ts:392:16
   /** `resizeHandles` (this item's own, when set) or all 8, matching Vue's own per-item-override-else-default resolution — read by the template to decide which handle spans actually render. */
   resolvedResizeHandles: TResizeHandle[] = ALL_RESIZE_HANDLES;
-  isSelected = false;
+  isSelected = true;
   /**
    * `isDraggable`/`isResizable`/`isBounded`/`isMirrored` resolved

[Survived] BooleanLiteral
src/lib/grid-item.component.ts:409:23
    * reads it directly — Angular's own template compiler can't reach a
    * `private` field.
    */
-  resolvedIsBounded = false;
+  resolvedIsBounded = true;
   resolvedIsDraggable = true;
   resolvedIsMirrored = false;

[Survived] BooleanLiteral
src/lib/grid-item.component.ts:410:25
    * `private` field.
    */
   resolvedIsBounded = false;
-  resolvedIsDraggable = true;
+  resolvedIsDraggable = false;
   resolvedIsMirrored = false;
   resolvedIsResizable = true;

[Survived] BooleanLiteral
src/lib/grid-item.component.ts:411:24
    */
   resolvedIsBounded = false;
   resolvedIsDraggable = true;
-  resolvedIsMirrored = false;
+  resolvedIsMirrored = true;
   resolvedIsResizable = true;
   resolvedMaxRows = Infinity;

[Survived] BooleanLiteral
src/lib/grid-item.component.ts:412:25
   resolvedIsBounded = false;
   resolvedIsDraggable = true;
   resolvedIsMirrored = false;
-  resolvedIsResizable = true;
+  resolvedIsResizable = false;
   resolvedMaxRows = Infinity;
   resolvedUseBorderRadius = false;

[Survived] BooleanLiteral
src/lib/grid-item.component.ts:414:29
   resolvedIsMirrored = false;
   resolvedIsResizable = true;
   resolvedMaxRows = Infinity;
-  resolvedUseBorderRadius = false;
+  resolvedUseBorderRadius = true;
   resolvedBorderRadiusPx = 10;
   resolvedShowCloseButton = false;

[Survived] BooleanLiteral
src/lib/grid-item.component.ts:416:29
   resolvedMaxRows = Infinity;
   resolvedUseBorderRadius = false;
   resolvedBorderRadiusPx = 10;
-  resolvedShowCloseButton = false;
+  resolvedShowCloseButton = true;
   /**
    * `enableEditMode` resolved against the grid-wide cascade, same

[Survived] BooleanLiteral
src/lib/grid-item.component.ts:426:28
    * on `enableEditMode` for the full list of what this does and
    * doesn't affect.
    */
-  resolvedEnableEditMode = true;
+  resolvedEnableEditMode = false;
   /**
    * Whether header content was actually projected (Phase 22) — set

[Survived] BooleanLiteral
src/lib/grid-item.component.ts:437:22
    * component class itself, hence `GridItemHeaderDirective`'s own
    * existence purely as a queryable marker.
    */
-  hasHeaderContent = false;
+  hasHeaderContent = true;
   @ContentChild(GridItemHeaderDirective) private readonly headerContentQuery: GridItemHeaderDirective | undefined;
   /**

[Killed] BlockStatement
src/lib/grid-item.component.ts:477:30
     private readonly changeDetectorRef: ChangeDetectorRef,
   ) {}
 
-  ngAfterContentInit(): void {
-    this.hasHeaderContent = !!this.headerContentQuery;
-  }
+  ngAfterContentInit(): void {}
 
   ngOnInit(): void {
killedBy: GridItemComponent Phase 22 — header content slot Should render the header region, wrap the default content in a body wrapper, and add the host class when header content is projected
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:478:29
   ) {}
 
   ngAfterContentInit(): void {
-    this.hasHeaderContent = !!this.headerContentQuery;
+    this.hasHeaderContent = !this.headerContentQuery;
   }
 
killedBy: GridItemComponent Phase 22 — header content slot Should not render any header region, body wrapper, or host class at all when no header content is projected
statusReason: Error: expect(received).toBeFalsy()

Received: <div class="kdl-grid-item-header" />

[Killed] LogicalOperator
src/lib/grid-item.component.ts:482:34
   }
 
   ngOnInit(): void {
-    this.resolvedResizeHandles = this.resizeHandles ?? ALL_RESIZE_HANDLES;
+    this.resolvedResizeHandles = this.resizeHandles && ALL_RESIZE_HANDLES;
     this.resolveGridDefaults();
 
killedBy: GridItemComponent Should render nothing meaningful (an empty style object) before containerWidth is measured
statusReason: TypeError: Cannot read properties of null (reading 'includes')

[Killed] ArrowFunction
src/lib/grid-item.component.ts:487:7
 
     this.nativeDraggable = createNativeDraggable(
       this.elementRef.nativeElement,
-      () => ({
-        activationDistance: this.dragActivationDistance,
-        allowFrom: this.dragAllowFrom,
-        enabled: this.resolvedIsDraggable && !this.isStatic,
-        ignoreFrom: this.dragIgnoreFrom,
-      }),
+      () => undefined,
       event => this.handleDrag(event),
     );
killedBy: GridItemComponent Phase 3 — dragging Should let the native engine actually start a drag via a real pointerdown when isDraggable is left at its own default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:490:18
       () => ({
         activationDistance: this.dragActivationDistance,
         allowFrom: this.dragAllowFrom,
-        enabled: this.resolvedIsDraggable && !this.isStatic,
+        enabled: false,
         ignoreFrom: this.dragIgnoreFrom,
       }),
killedBy: GridItemComponent Phase 3 — dragging Should let the native engine actually start a drag via a real pointerdown when isDraggable is left at its own default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:490:46
       () => ({
         activationDistance: this.dragActivationDistance,
         allowFrom: this.dragAllowFrom,
-        enabled: this.resolvedIsDraggable && !this.isStatic,
+        enabled: this.resolvedIsDraggable && this.isStatic,
         ignoreFrom: this.dragIgnoreFrom,
       }),
killedBy: GridItemComponent Phase 3 — dragging Should let the native engine actually start a drag via a real pointerdown when isDraggable is left at its own default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/lib/grid-item.component.ts:493:7
         enabled: this.resolvedIsDraggable && !this.isStatic,
         ignoreFrom: this.dragIgnoreFrom,
       }),
-      event => this.handleDrag(event),
+      () => undefined,
     );
 
killedBy: GridItemComponent Phase 3 — dragging Should set isDragging and an initial pixel position on dragstart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:496:8
       event => this.handleDrag(event),
     );
 
-    if(!this.eventBus) {
+    if(this.eventBus) {
       return;
     }
killedBy: GridItemComponent Should render nothing meaningful (an empty style object) before containerWidth is measured
statusReason: TypeError: Cannot read properties of null (reading 'containerWidth$')

[Killed] BlockStatement
src/lib/grid-item.component.ts:496:24
       event => this.handleDrag(event),
     );
 
-    if(!this.eventBus) {
-      return;
-    }
+    if(!this.eventBus) {}
     combineLatest([
       this.eventBus.containerWidth$,
killedBy: GridItemComponent Should render nothing meaningful (an empty style object) before containerWidth is measured
statusReason: TypeError: Cannot read properties of null (reading 'containerWidth$')

[Killed] ArrayDeclaration
src/lib/grid-item.component.ts:499:19
     if(!this.eventBus) {
       return;
     }
-    combineLatest([
-      this.eventBus.containerWidth$,
-      this.eventBus.colNum$,
-      this.eventBus.rowHeight$,
-      this.eventBus.margin$,
-      this.eventBus.useCssTransforms$,
-      this.eventBus.transformScale$,
-    ]).pipe(takeUntilDestroyed(this.destroyRef)).subscribe(([containerWidth, colNum, rowHeight, margin, useCssTransforms, transformScale]) => {
+    combineLatest([]).pipe(takeUntilDestroyed(this.destroyRef)).subscribe(([containerWidth, colNum, rowHeight, margin, useCssTransforms, transformScale]) => {
       this.containerWidth = containerWidth;
       this.colNum = colNum;
killedBy: GridItemComponent Phase 3 — dragging Should report a grid-unit x/y via the eventBus on each drag tick, when one is injected
statusReason: Error: Invalid parameter containerWidth passed

[Killed] BlockStatement
src/lib/grid-item.component.ts:506:143
       this.eventBus.margin$,
       this.eventBus.useCssTransforms$,
       this.eventBus.transformScale$,
-    ]).pipe(takeUntilDestroyed(this.destroyRef)).subscribe(([containerWidth, colNum, rowHeight, margin, useCssTransforms, transformScale]) => {
-      this.containerWidth = containerWidth;
-      this.colNum = colNum;
-      this.rowHeight = rowHeight;
-      this.margin = margin;
-      this.useCssTransforms = useCssTransforms;
-      this.transformScale = transformScale;
-      this.style = this.computeStyle();
-      this.changeDetectorRef.markForCheck();
-    });
+    ]).pipe(takeUntilDestroyed(this.destroyRef)).subscribe(([containerWidth, colNum, rowHeight, margin, useCssTransforms, transformScale]) => {});
 
     this.eventBus.selectedItemIds$.pipe(takeUntilDestroyed(this.destroyRef)).subscribe(selectedIds => {
killedBy: GridItemComponent Phase 3 — dragging Should report a grid-unit x/y via the eventBus on each drag tick, when one is injected
statusReason: Error: Invalid parameter containerWidth passed

[Killed] BlockStatement
src/lib/grid-item.component.ts:517:103
       this.changeDetectorRef.markForCheck();
     });
 
-    this.eventBus.selectedItemIds$.pipe(takeUntilDestroyed(this.destroyRef)).subscribe(selectedIds => {
-      this.isSelected = selectedIds.has(this.i);
-      this.changeDetectorRef.markForCheck();
-    });
+    this.eventBus.selectedItemIds$.pipe(takeUntilDestroyed(this.destroyRef)).subscribe(selectedIds => {});
 
     this.eventBus.gridDefaults$.pipe(takeUntilDestroyed(this.destroyRef)).subscribe(defaults => {
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should reflect isSelected via the eventBus's own selectedItemIds$, and drive the kdl-grid-item--selecte
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/grid-item.component.ts:522:97
       this.changeDetectorRef.markForCheck();
     });
 
-    this.eventBus.gridDefaults$.pipe(takeUntilDestroyed(this.destroyRef)).subscribe(defaults => {
-      this.latestGridDefaults = defaults;
-      this.resolveGridDefaults();
-      this.style = this.computeStyle();
-      // Required, not optional — this component is OnPush, and a
-      // subscription-driven value change (as opposed to a bound
-      // @Input() changing) does not itself mark the view dirty for
-      // re-render. This exact class of bug bit this file twice already
-      // (the autoHeight toggle test, the resizeHandles toggle test),
-      // both traced to a missing markForCheck() call — see those two
-      // tests' own history in grid-item.component.spec.ts before ever
-      // considering this line removable.
-      this.changeDetectorRef.markForCheck();
-    });
+    this.eventBus.gridDefaults$.pipe(takeUntilDestroyed(this.destroyRef)).subscribe(defaults => {});
   }
 
killedBy: GridItemComponent Phase 14 — grid-wide cascade (IGridDefaults) Should inherit isDraggable from the grid-wide default when this item's own isDraggable is null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/lib/grid-item.component.ts:540:25
 
   ngAfterViewInit(): void {
     const handles: Partial<Record<`e` | `n` | `ne` | `nw` | `s` | `se` | `sw` | `w`, HTMLElement>> = {};
-    if(this.nHandleRef) {
-      handles.n = this.nHandleRef.nativeElement;
-    }
+    if(this.nHandleRef) {}
     if(this.sHandleRef) {
       handles.s = this.sHandleRef.nativeElement;
killedBy: GridItemComponent Phase 4 — resizing Should wire up the n/w resize handles too, not just se — ngAfterViewInit's own eight nearly-identical "if handleRef" checks are each only ever exercised together (
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:540:8
 
   ngAfterViewInit(): void {
     const handles: Partial<Record<`e` | `n` | `ne` | `nw` | `s` | `se` | `sw` | `w`, HTMLElement>> = {};
-    if(this.nHandleRef) {
+    if(true) {
       handles.n = this.nHandleRef.nativeElement;
     }
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should render only the resizeHandles subset specified per-item, not all 8
statusReason: TypeError: Cannot read properties of undefined (reading 'nativeElement')

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:543:8
     if(this.nHandleRef) {
       handles.n = this.nHandleRef.nativeElement;
     }
-    if(this.sHandleRef) {
+    if(false) {
       handles.s = this.sHandleRef.nativeElement;
     }
killedBy: GridItemComponent Phase 4 — resizing Should wire up the s resize handle too, completing all eight
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/grid-item.component.ts:543:25
     if(this.nHandleRef) {
       handles.n = this.nHandleRef.nativeElement;
     }
-    if(this.sHandleRef) {
-      handles.s = this.sHandleRef.nativeElement;
-    }
+    if(this.sHandleRef) {}
     if(this.eHandleRef) {
       handles.e = this.eHandleRef.nativeElement;
killedBy: GridItemComponent Phase 4 — resizing Should wire up the s resize handle too, completing all eight
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:546:8
     if(this.sHandleRef) {
       handles.s = this.sHandleRef.nativeElement;
     }
-    if(this.eHandleRef) {
+    if(false) {
       handles.e = this.eHandleRef.nativeElement;
     }
killedBy: GridItemComponent Phase 4 — resizing Should wire up the e resize handle too, completing all eight
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:546:8
     if(this.sHandleRef) {
       handles.s = this.sHandleRef.nativeElement;
     }
-    if(this.eHandleRef) {
+    if(true) {
       handles.e = this.eHandleRef.nativeElement;
     }
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should render only the resizeHandles subset specified per-item, not all 8
statusReason: TypeError: Cannot read properties of undefined (reading 'nativeElement')

[Killed] BlockStatement
src/lib/grid-item.component.ts:549:25
     if(this.eHandleRef) {
       handles.e = this.eHandleRef.nativeElement;
     }
-    if(this.wHandleRef) {
-      handles.w = this.wHandleRef.nativeElement;
-    }
+    if(this.wHandleRef) {}
     if(this.neHandleRef) {
       handles.ne = this.neHandleRef.nativeElement;
killedBy: GridItemComponent Phase 4 — resizing Should wire up the w resize handle too
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:549:8
     if(this.eHandleRef) {
       handles.e = this.eHandleRef.nativeElement;
     }
-    if(this.wHandleRef) {
+    if(true) {
       handles.w = this.wHandleRef.nativeElement;
     }
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should render only the resizeHandles subset specified per-item, not all 8
statusReason: TypeError: Cannot read properties of undefined (reading 'nativeElement')

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:552:8
     if(this.wHandleRef) {
       handles.w = this.wHandleRef.nativeElement;
     }
-    if(this.neHandleRef) {
+    if(false) {
       handles.ne = this.neHandleRef.nativeElement;
     }
killedBy: GridItemComponent Phase 4 — resizing Should wire up the ne resize handle too, completing all eight
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/grid-item.component.ts:552:26
     if(this.wHandleRef) {
       handles.w = this.wHandleRef.nativeElement;
     }
-    if(this.neHandleRef) {
-      handles.ne = this.neHandleRef.nativeElement;
-    }
+    if(this.neHandleRef) {}
     if(this.nwHandleRef) {
       handles.nw = this.nwHandleRef.nativeElement;
killedBy: GridItemComponent Phase 4 — resizing Should wire up the ne resize handle too, completing all eight
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/grid-item.component.ts:555:26
     if(this.neHandleRef) {
       handles.ne = this.neHandleRef.nativeElement;
     }
-    if(this.nwHandleRef) {
-      handles.nw = this.nwHandleRef.nativeElement;
-    }
+    if(this.nwHandleRef) {}
     if(this.seHandleRef) {
       handles.se = this.seHandleRef.nativeElement;
killedBy: GridItemComponent Phase 4 — resizing Should wire up the nw resize handle too, completing all eight
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:555:8
     if(this.neHandleRef) {
       handles.ne = this.neHandleRef.nativeElement;
     }
-    if(this.nwHandleRef) {
+    if(false) {
       handles.nw = this.nwHandleRef.nativeElement;
     }
killedBy: GridItemComponent Phase 4 — resizing Should wire up the nw resize handle too, completing all eight
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:558:8
     if(this.nwHandleRef) {
       handles.nw = this.nwHandleRef.nativeElement;
     }
-    if(this.seHandleRef) {
+    if(false) {
       handles.se = this.seHandleRef.nativeElement;
     }
killedBy: GridItemComponent Phase 4 — resizing Should let the native engine actually start a resize via a real pointerdown when isResizable is left at its own default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/grid-item.component.ts:558:26
     if(this.nwHandleRef) {
       handles.nw = this.nwHandleRef.nativeElement;
     }
-    if(this.seHandleRef) {
-      handles.se = this.seHandleRef.nativeElement;
-    }
+    if(this.seHandleRef) {}
     if(this.swHandleRef) {
       handles.sw = this.swHandleRef.nativeElement;
killedBy: GridItemComponent Phase 4 — resizing Should let the native engine actually start a resize via a real pointerdown when isResizable is left at its own default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:561:8
     if(this.seHandleRef) {
       handles.se = this.seHandleRef.nativeElement;
     }
-    if(this.swHandleRef) {
+    if(true) {
       handles.sw = this.swHandleRef.nativeElement;
     }
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should re-resolve the rendered resize-handle subset when resizeHandles changes after the initial render
statusReason: TypeError: Cannot read properties of undefined (reading 'nativeElement')

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:561:8
     if(this.seHandleRef) {
       handles.se = this.seHandleRef.nativeElement;
     }
-    if(this.swHandleRef) {
+    if(false) {
       handles.sw = this.swHandleRef.nativeElement;
     }
killedBy: GridItemComponent Phase 4 — resizing Should wire up the sw resize handle too, completing all eight
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/lib/grid-item.component.ts:568:7
     this.nativeResizable = createNativeResizable(
       this.elementRef.nativeElement,
       handles,
-      () => ({
-        enabled: this.resolvedIsResizable && !this.isStatic,
-        ignoreFrom: this.resizeIgnoreFrom,
-      }),
+      () => undefined,
       event => this.handleResize(event),
     );
killedBy: GridItemComponent Phase 4 — resizing Should let the native engine actually start a resize via a real pointerdown when isResizable is left at its own default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/lib/grid-item.component.ts:568:14
     this.nativeResizable = createNativeResizable(
       this.elementRef.nativeElement,
       handles,
-      () => ({
-        enabled: this.resolvedIsResizable && !this.isStatic,
-        ignoreFrom: this.resizeIgnoreFrom,
-      }),
+      () => ({}),
       event => this.handleResize(event),
     );
killedBy: GridItemComponent Phase 4 — resizing Should let the native engine actually start a resize via a real pointerdown when isResizable is left at its own default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:569:18
       this.elementRef.nativeElement,
       handles,
       () => ({
-        enabled: this.resolvedIsResizable && !this.isStatic,
+        enabled: true,
         ignoreFrom: this.resizeIgnoreFrom,
       }),
killedBy: GridItemComponent Phase 4 — resizing Should actually block the native engine from starting a resize at all when isResizable is false (a real pointerdown, not the test backdoor)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
