[Killed] BooleanLiteral
src/lib/grid-item.component.ts:569:46
       this.elementRef.nativeElement,
       handles,
       () => ({
-        enabled: this.resolvedIsResizable && !this.isStatic,
+        enabled: this.resolvedIsResizable && this.isStatic,
         ignoreFrom: this.resizeIgnoreFrom,
       }),
killedBy: GridItemComponent Phase 4 — resizing Should let the native engine actually start a resize via a real pointerdown when isResizable is left at its own default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/lib/grid-item.component.ts:572:7
         enabled: this.resolvedIsResizable && !this.isStatic,
         ignoreFrom: this.resizeIgnoreFrom,
       }),
-      event => this.handleResize(event),
+      () => undefined,
     );
 
killedBy: GridItemComponent Phase 4 — resizing Should set isResizing and seed resizing from the item's own current grid position/size on resizestart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/grid-item.component.ts:579:34
   }
 
   ngOnChanges(changes: SimpleChanges): void {
-    if(changes[`resizeHandles`]) {
-      this.resolvedResizeHandles = this.resizeHandles ?? ALL_RESIZE_HANDLES;
-    }
+    if(changes[`resizeHandles`]) {}
     // Unconditional, not gated on changes['isDraggable']/etc. being
     // truthy — a real, confirmed bug found via two separate failing
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should re-resolve the rendered resize-handle subset when resizeHandles changes after the initial render
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:579:8
   }
 
   ngOnChanges(changes: SimpleChanges): void {
-    if(changes[`resizeHandles`]) {
+    if(false) {
       this.resolvedResizeHandles = this.resizeHandles ?? ALL_RESIZE_HANDLES;
     }
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should re-resolve the rendered resize-handle subset when resizeHandles changes after the initial render
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] LogicalOperator
src/lib/grid-item.component.ts:580:36
 
   ngOnChanges(changes: SimpleChanges): void {
     if(changes[`resizeHandles`]) {
-      this.resolvedResizeHandles = this.resizeHandles ?? ALL_RESIZE_HANDLES;
+      this.resolvedResizeHandles = this.resizeHandles && ALL_RESIZE_HANDLES;
     }
     // Unconditional, not gated on changes['isDraggable']/etc. being
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should re-resolve the rendered resize-handle subset when resizeHandles changes after the initial render
statusReason: Error: expect(received).toBeFalsy()

Received: <span class="kdl-resize-hint kdl-resize-hint--se"><!--bindings={
  "ng-reflect-ng-template-outlet-context": "[object Object]"
}--></span>

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:599:8
     // call below, which recomputes unconditionally for the identical
     // reason.
     this.resolveGridDefaults();
-    if(changes[`autoHeight`] && !changes[`autoHeight`].firstChange) {
+    if(false) {
       this.teardownAutoHeight();
       // Deferred to the next microtask, not called synchronously here:
killedBy: GridItemComponent Phase 11 — preserveAspectRatio / autoHeight Should actually invoke setupAutoHeight() on the next microtask, not just avoid throwing — confirmed via a spy
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] LogicalOperator
src/lib/grid-item.component.ts:599:8
     // call below, which recomputes unconditionally for the identical
     // reason.
     this.resolveGridDefaults();
-    if(changes[`autoHeight`] && !changes[`autoHeight`].firstChange) {
+    if(changes[`autoHeight`] || !changes[`autoHeight`].firstChange) {
       this.teardownAutoHeight();
       // Deferred to the next microtask, not called synchronously here:
killedBy: GridLayoutComponent GridEventBusService DI cascade into a real, nested GridItemComponent Should have the nested GridItemComponent's own style reflect the parent's colNum/rowHeight/margin, with no dire
statusReason: TypeError: Cannot read properties of undefined (reading 'firstChange')

[Killed] ArrowFunction
src/lib/grid-item.component.ts:609:30
       // `autoHeight` has just flipped `false` -> `true`. By the next
       // microtask, Angular's own change detection for this pass has
       // already completed and the wrapper (if now present) is queryable.
-      Promise.resolve().then(() => this.setupAutoHeight());
+      Promise.resolve().then(() => undefined);
     }
     // Always recomputes, regardless of whether a GridEventBusService
killedBy: GridItemComponent Phase 11 — preserveAspectRatio / autoHeight Should actually invoke setupAutoHeight() on the next microtask, not just avoid throwing — confirmed via a spy
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BlockStatement
src/lib/grid-item.component.ts:623:23
     this.style = this.computeStyle();
   }
 
-  ngOnDestroy(): void {
-    this.nativeDraggable?.destroy();
-    this.nativeResizable?.destroy();
-    this.autoScrollEngine.stop();
-    this.teardownAutoHeight();
-  }
+  ngOnDestroy(): void {}
 
   /**

[Killed] OptionalChaining
src/lib/grid-item.component.ts:624:5
   }
 
   ngOnDestroy(): void {
-    this.nativeDraggable?.destroy();
+    this.nativeDraggable.destroy();
     this.nativeResizable?.destroy();
     this.autoScrollEngine.stop();
killedBy: GridItemComponent Should project its content via ng-content
statusReason: Error: 1 component threw errors during cleanup

[Killed] OptionalChaining
src/lib/grid-item.component.ts:625:5
 
   ngOnDestroy(): void {
     this.nativeDraggable?.destroy();
-    this.nativeResizable?.destroy();
+    this.nativeResizable.destroy();
     this.autoScrollEngine.stop();
     this.teardownAutoHeight();
killedBy: GridItemComponent Should project its content via ng-content
statusReason: Error: 1 component threw errors during cleanup

[Killed] BlockStatement
src/lib/grid-item.component.ts:642:39
    * *both* sides, so either one changing needs a re-resolve, not just
    * the grid's own emissions.
    */
-  private resolveGridDefaults(): void {
-    this.resolvedIsDraggable = this.isDraggable ?? this.latestGridDefaults.isDraggable;
-    this.resolvedIsResizable = this.isResizable ?? this.latestGridDefaults.isResizable;
-    this.resolvedIsBounded = this.isBounded ?? this.latestGridDefaults.isBounded;
-    this.resolvedIsMirrored = this.isMirrored ?? this.latestGridDefaults.isMirrored;
-    this.resolvedUseBorderRadius = this.useBorderRadius ?? this.latestGridDefaults.useBorderRadius;
-    this.resolvedBorderRadiusPx = this.borderRadiusPx ?? this.latestGridDefaults.borderRadiusPx;
-    this.resolvedShowCloseButton = this.showCloseButton ?? this.latestGridDefaults.showCloseButton;
-    this.resolvedEnableEditMode = this.enableEditMode ?? this.latestGridDefaults.enableEditMode;
-    // Grid-only, no per-item override — see IGridDefaults's own doc
-    // comment on why this one field resolves differently from the
-    // other four above (confirmed via a direct read of Vue's own
-    // GridItem.vue, not assumed symmetric with the others).
-    this.resolvedMaxRows = this.eventBus ? this.latestGridDefaults.maxRows : this.maxRows;
-  }
+  private resolveGridDefaults(): void {}
 
killedBy: GridItemComponent Phase 3 — dragging Should track position via right (not left) when isMirrored is true, throughout a full drag gesture
statusReason: Error: expect(received).toBeUndefined()

Received: 1018

[Killed] LogicalOperator
src/lib/grid-item.component.ts:643:32
    * the grid's own emissions.
    */
   private resolveGridDefaults(): void {
-    this.resolvedIsDraggable = this.isDraggable ?? this.latestGridDefaults.isDraggable;
+    this.resolvedIsDraggable = this.isDraggable && this.latestGridDefaults.isDraggable;
     this.resolvedIsResizable = this.isResizable ?? this.latestGridDefaults.isResizable;
     this.resolvedIsBounded = this.isBounded ?? this.latestGridDefaults.isBounded;
killedBy: GridItemComponent Phase 3 — dragging Should let the native engine actually start a drag via a real pointerdown when isDraggable is left at its own default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/lib/grid-item.component.ts:644:32
    */
   private resolveGridDefaults(): void {
     this.resolvedIsDraggable = this.isDraggable ?? this.latestGridDefaults.isDraggable;
-    this.resolvedIsResizable = this.isResizable ?? this.latestGridDefaults.isResizable;
+    this.resolvedIsResizable = this.isResizable && this.latestGridDefaults.isResizable;
     this.resolvedIsBounded = this.isBounded ?? this.latestGridDefaults.isBounded;
     this.resolvedIsMirrored = this.isMirrored ?? this.latestGridDefaults.isMirrored;
killedBy: GridItemComponent Phase 4 — resizing Should let the native engine actually start a resize via a real pointerdown when isResizable is left at its own default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/lib/grid-item.component.ts:645:30
   private resolveGridDefaults(): void {
     this.resolvedIsDraggable = this.isDraggable ?? this.latestGridDefaults.isDraggable;
     this.resolvedIsResizable = this.isResizable ?? this.latestGridDefaults.isResizable;
-    this.resolvedIsBounded = this.isBounded ?? this.latestGridDefaults.isBounded;
+    this.resolvedIsBounded = this.isBounded && this.latestGridDefaults.isBounded;
     this.resolvedIsMirrored = this.isMirrored ?? this.latestGridDefaults.isMirrored;
     this.resolvedUseBorderRadius = this.useBorderRadius ?? this.latestGridDefaults.useBorderRadius;
killedBy: GridItemComponent Phase 3 — dragging Phase 6 — isBounded Should clamp the drag position to the container's own bounds when isBounded is true
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 117
Received:    5010

[Killed] LogicalOperator
src/lib/grid-item.component.ts:646:31
     this.resolvedIsDraggable = this.isDraggable ?? this.latestGridDefaults.isDraggable;
     this.resolvedIsResizable = this.isResizable ?? this.latestGridDefaults.isResizable;
     this.resolvedIsBounded = this.isBounded ?? this.latestGridDefaults.isBounded;
-    this.resolvedIsMirrored = this.isMirrored ?? this.latestGridDefaults.isMirrored;
+    this.resolvedIsMirrored = this.isMirrored && this.latestGridDefaults.isMirrored;
     this.resolvedUseBorderRadius = this.useBorderRadius ?? this.latestGridDefaults.useBorderRadius;
     this.resolvedBorderRadiusPx = this.borderRadiusPx ?? this.latestGridDefaults.borderRadiusPx;
killedBy: GridItemComponent Phase 3 — dragging Should track position via right (not left) when isMirrored is true, throughout a full drag gesture
statusReason: Error: expect(received).toBeUndefined()

Received: 1018

[Killed] LogicalOperator
src/lib/grid-item.component.ts:647:36
     this.resolvedIsResizable = this.isResizable ?? this.latestGridDefaults.isResizable;
     this.resolvedIsBounded = this.isBounded ?? this.latestGridDefaults.isBounded;
     this.resolvedIsMirrored = this.isMirrored ?? this.latestGridDefaults.isMirrored;
-    this.resolvedUseBorderRadius = this.useBorderRadius ?? this.latestGridDefaults.useBorderRadius;
+    this.resolvedUseBorderRadius = this.useBorderRadius && this.latestGridDefaults.useBorderRadius;
     this.resolvedBorderRadiusPx = this.borderRadiusPx ?? this.latestGridDefaults.borderRadiusPx;
     this.resolvedShowCloseButton = this.showCloseButton ?? this.latestGridDefaults.showCloseButton;
killedBy: GridItemComponent Phase 19 — border radius (useBorderRadius / borderRadiusPx) Should apply border-radius and grow --kdl-close-button-inset with the radius when useBorderRadius is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "10px"
Received: ""

[Killed] LogicalOperator
src/lib/grid-item.component.ts:648:35
     this.resolvedIsBounded = this.isBounded ?? this.latestGridDefaults.isBounded;
     this.resolvedIsMirrored = this.isMirrored ?? this.latestGridDefaults.isMirrored;
     this.resolvedUseBorderRadius = this.useBorderRadius ?? this.latestGridDefaults.useBorderRadius;
-    this.resolvedBorderRadiusPx = this.borderRadiusPx ?? this.latestGridDefaults.borderRadiusPx;
+    this.resolvedBorderRadiusPx = this.borderRadiusPx && this.latestGridDefaults.borderRadiusPx;
     this.resolvedShowCloseButton = this.showCloseButton ?? this.latestGridDefaults.showCloseButton;
     this.resolvedEnableEditMode = this.enableEditMode ?? this.latestGridDefaults.enableEditMode;
killedBy: GridItemComponent Phase 19 — border radius (useBorderRadius / borderRadiusPx) Should compute the inset formula correctly at a larger radius, below the cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "19px"
Received: "7px"

[Killed] LogicalOperator
src/lib/grid-item.component.ts:649:36
     this.resolvedIsMirrored = this.isMirrored ?? this.latestGridDefaults.isMirrored;
     this.resolvedUseBorderRadius = this.useBorderRadius ?? this.latestGridDefaults.useBorderRadius;
     this.resolvedBorderRadiusPx = this.borderRadiusPx ?? this.latestGridDefaults.borderRadiusPx;
-    this.resolvedShowCloseButton = this.showCloseButton ?? this.latestGridDefaults.showCloseButton;
+    this.resolvedShowCloseButton = this.showCloseButton && this.latestGridDefaults.showCloseButton;
     this.resolvedEnableEditMode = this.enableEditMode ?? this.latestGridDefaults.enableEditMode;
     // Grid-only, no per-item override — see IGridDefaults's own doc
killedBy: GridItemComponent Phase 15 — close button Should render the close button when showCloseButton is true and the item is not static
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] LogicalOperator
src/lib/grid-item.component.ts:650:35
     this.resolvedUseBorderRadius = this.useBorderRadius ?? this.latestGridDefaults.useBorderRadius;
     this.resolvedBorderRadiusPx = this.borderRadiusPx ?? this.latestGridDefaults.borderRadiusPx;
     this.resolvedShowCloseButton = this.showCloseButton ?? this.latestGridDefaults.showCloseButton;
-    this.resolvedEnableEditMode = this.enableEditMode ?? this.latestGridDefaults.enableEditMode;
+    this.resolvedEnableEditMode = this.enableEditMode && this.latestGridDefaults.enableEditMode;
     // Grid-only, no per-item override — see IGridDefaults's own doc
     // comment on why this one field resolves differently from the
killedBy: GridItemComponent Phase 16 — keyboard-driven move/resize Should have tabindex 0 when draggable and not static
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: null

[Killed] BlockStatement
src/lib/grid-item.component.ts:659:40
   }
 
-  handleClick(event: MouseEvent): void {
-    event.stopPropagation();
-    this.eventBus?.emitItemClicked({
-      ctrlKey: event.ctrlKey,
-      i: this.i,
-      metaKey: event.metaKey,
-      shiftKey: event.shiftKey,
-    });
-  }
+  handleClick(event: MouseEvent): void {}
 
   /**
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should stop the click from propagating (so a background click doesn't immediately clear the selection i
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] OptionalChaining
src/lib/grid-item.component.ts:661:5
   handleClick(event: MouseEvent): void {
     event.stopPropagation();
-    this.eventBus?.emitItemClicked({
+    this.eventBus.emitItemClicked({
       ctrlKey: event.ctrlKey,
       i: this.i,
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should stop the click from propagating (so a background click doesn't immediately clear the selection i
statusReason: TypeError: Cannot read properties of null (reading 'emitItemClicked')

[Killed] ObjectLiteral
src/lib/grid-item.component.ts:661:36
   handleClick(event: MouseEvent): void {
     event.stopPropagation();
-    this.eventBus?.emitItemClicked({
-      ctrlKey: event.ctrlKey,
-      i: this.i,
-      metaKey: event.metaKey,
-      shiftKey: event.shiftKey,
-    });
+    this.eventBus?.emitItemClicked({});
   }
 
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should report a click via the eventBus's own itemClicked$, when one is injected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "i": "my-item",

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:690:8
     // other call path to double-check that against directly (matching
     // Vue's own reasoning for keeping its own identical check).
-    if(!this.resolvedEnableEditMode) {
+    if(this.resolvedEnableEditMode) {
       return;
     }
killedBy: GridItemComponent Phase 15 — close button Should emit removeItem with this item's own id when the close button is clicked
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "my-item",
- ]

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:690:8
     // other call path to double-check that against directly (matching
     // Vue's own reasoning for keeping its own identical check).
-    if(!this.resolvedEnableEditMode) {
+    if(true) {
       return;
     }
killedBy: GridItemComponent Phase 15 — close button Should emit removeItem with this item's own id when the close button is clicked
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "my-item",
- ]

[Killed] BlockStatement
src/lib/grid-item.component.ts:719:38
    * browser this whole time, whatever jsdom's own tests happened to
    * tolerate.
    */
-  get tabindexValue(): number | null {
-    return (this.resolvedIsDraggable || this.resolvedIsResizable) && !this.isStatic && this.resolvedEnableEditMode ? 0 : null;
-  }
+  get tabindexValue(): number | null {}
 
killedBy: GridItemComponent Phase 16 — keyboard-driven move/resize Should have tabindex 0 when draggable and not static
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: null

[Killed] LogicalOperator
src/lib/grid-item.component.ts:720:12
    * tolerate.
    */
   get tabindexValue(): number | null {
-    return (this.resolvedIsDraggable || this.resolvedIsResizable) && !this.isStatic && this.resolvedEnableEditMode ? 0 : null;
+    return this.resolvedIsDraggable || this.resolvedIsResizable || !this.isStatic && this.resolvedEnableEditMode ? 0 : null;
   }
 
killedBy: GridItemComponent Phase 16 — keyboard-driven move/resize Should have no tabindex attribute at all when neither draggable nor resizable
statusReason: Error: expect(received).toBeNull()

Received: "0"

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:720:12
    * tolerate.
    */
   get tabindexValue(): number | null {
-    return (this.resolvedIsDraggable || this.resolvedIsResizable) && !this.isStatic && this.resolvedEnableEditMode ? 0 : null;
+    return false ? 0 : null;
   }
 
killedBy: GridItemComponent Phase 16 — keyboard-driven move/resize Should have tabindex 0 when draggable and not static
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: null

[Killed] BlockStatement
src/lib/grid-item.component.ts:724:53
   }
 
-  get isDraggableOrResizableAndNotStatic(): boolean {
-    return (this.resolvedIsDraggable || this.resolvedIsResizable) && !this.isStatic && this.resolvedEnableEditMode;
-  }
+  get isDraggableOrResizableAndNotStatic(): boolean {}
 
killedBy: GridItemComponent Phase 18 — ariaLabels Should set role/aria-roledescription/aria-describedby on the host when draggable or resizable and not static
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "group"
Received: null

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:725:13
 
   get isDraggableOrResizableAndNotStatic(): boolean {
-    return (this.resolvedIsDraggable || this.resolvedIsResizable) && !this.isStatic && this.resolvedEnableEditMode;
+    return (true) && !this.isStatic && this.resolvedEnableEditMode;
   }
 
killedBy: GridItemComponent Phase 18 — ariaLabels Should not set role/aria-roledescription/aria-describedby at all when neither draggable nor resizable
statusReason: Error: expect(received).toBeNull()

Received: "group"

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:725:12
 
   get isDraggableOrResizableAndNotStatic(): boolean {
-    return (this.resolvedIsDraggable || this.resolvedIsResizable) && !this.isStatic && this.resolvedEnableEditMode;
+    return true;
   }
 
killedBy: GridItemComponent Phase 18 — ariaLabels Should not set role/aria-roledescription/aria-describedby at all when neither draggable nor resizable
statusReason: Error: expect(received).toBeNull()

Received: "group"

[Killed] BlockStatement
src/lib/grid-item.component.ts:729:42
   }
 
-  get isDraggableAndNotStatic(): boolean {
-    return this.resolvedIsDraggable && !this.isStatic && this.resolvedEnableEditMode;
-  }
+  get isDraggableAndNotStatic(): boolean {}
 
killedBy: GridItemComponent Phase 18 — ariaLabels Should render the keyboard-instructions span with only the move instruction when draggable but not resizable
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Press arrow keys to move."
Received string:    "   "

[Killed] LogicalOperator
src/lib/grid-item.component.ts:730:12
 
   get isDraggableAndNotStatic(): boolean {
-    return this.resolvedIsDraggable && !this.isStatic && this.resolvedEnableEditMode;
+    return this.resolvedIsDraggable || !this.isStatic && this.resolvedEnableEditMode;
   }
 
killedBy: GridItemComponent Phase 18 — ariaLabels Should render the keyboard-instructions span with only the resize instruction when resizable but not draggable
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "Press arrow keys to move."
Received string:        " Press arrow keys to move. Press shift plus arrow keys to resize. "

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:730:12
 
   get isDraggableAndNotStatic(): boolean {
-    return this.resolvedIsDraggable && !this.isStatic && this.resolvedEnableEditMode;
+    return true;
   }
 
killedBy: GridItemComponent Phase 18 — ariaLabels Should render the keyboard-instructions span with only the resize instruction when resizable but not draggable
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "Press arrow keys to move."
Received string:        " Press arrow keys to move. Press shift plus arrow keys to resize. "

[Killed] BlockStatement
src/lib/grid-item.component.ts:734:42
   }
 
-  get isResizableAndNotStatic(): boolean {
-    return this.resolvedIsResizable && !this.isStatic && this.resolvedEnableEditMode;
-  }
+  get isResizableAndNotStatic(): boolean {}
 
   /**
killedBy: GridItemComponent Phase 18 — ariaLabels Should render the keyboard-instructions span with only the resize instruction when resizable but not draggable
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Press shift plus arrow keys to resize."
Received string:    "   "

[Killed] LogicalOperator
src/lib/grid-item.component.ts:735:12
 
   get isResizableAndNotStatic(): boolean {
-    return this.resolvedIsResizable && !this.isStatic && this.resolvedEnableEditMode;
+    return this.resolvedIsResizable || !this.isStatic && this.resolvedEnableEditMode;
   }
 
killedBy: GridItemComponent Phase 18 — ariaLabels Should render the keyboard-instructions span with only the move instruction when draggable but not resizable
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "Press shift plus arrow keys to resize."
Received string:        " Press arrow keys to move. Press shift plus arrow keys to resize. "

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:735:12
 
   get isResizableAndNotStatic(): boolean {
-    return this.resolvedIsResizable && !this.isStatic && this.resolvedEnableEditMode;
+    return true;
   }
 
killedBy: GridItemComponent Phase 18 — ariaLabels Should render the keyboard-instructions span with only the move instruction when draggable but not resizable
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "Press shift plus arrow keys to resize."
Received string:        " Press arrow keys to move. Press shift plus arrow keys to resize. "

[Killed] BlockStatement
src/lib/grid-item.component.ts:752:55
    * own doc comment on `ariaLabels` for why this one field doesn't need
    * the same eventBus-driven re-resolution the boolean/numeric ones do.
    */
-  get resolvedAriaLabels(): Required<IGridAriaLabels> {
-    return resolveAriaLabels(this.latestGridDefaults.ariaLabels, this.ariaLabels);
-  }
+  get resolvedAriaLabels(): Required<IGridAriaLabels> {}
 
   /**
killedBy: GridItemComponent Should render nothing meaningful (an empty style object) before containerWidth is measured
statusReason: TypeError: Cannot read properties of undefined (reading 'itemRoleDescription')

[Killed] BlockStatement
src/lib/grid-item.component.ts:764:32
    * separate generated-uid mechanism the way Vue's own `uid` (a Vue-
    * internal component instance id) provides for free there.
    */
-  get instructionsId(): string {
-    return `kdl-grid-item-${this.i}-instructions`;
-  }
+  get instructionsId(): string {}
 
   /**
killedBy: GridItemComponent Phase 18 — ariaLabels Should set role/aria-roledescription/aria-describedby on the host when draggable or resizable and not static
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "kdl-grid-item-0-instructions"
Received: null

[Killed] StringLiteral
src/lib/grid-item.component.ts:765:12
    * internal component instance id) provides for free there.
    */
   get instructionsId(): string {
-    return `kdl-grid-item-${this.i}-instructions`;
+    return ``;
   }
 
killedBy: GridItemComponent Phase 18 — ariaLabels Should set role/aria-roledescription/aria-describedby on the host when draggable or resizable and not static
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "kdl-grid-item-0-instructions"
Received: ""

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:789:8
    * elsewhere in this file).
    */
   handleKeydown(event: KeyboardEvent): void {
-    if(this.isStatic) {
+    if(false) {
       return;
     }
killedBy: GridItemComponent Phase 16 — keyboard-driven move/resize Should do nothing at all when this item is static
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] BlockStatement
src/lib/grid-item.component.ts:789:23
    * elsewhere in this file).
    */
   handleKeydown(event: KeyboardEvent): void {
-    if(this.isStatic) {
-      return;
-    }
+    if(this.isStatic) {}
     if(event.ctrlKey || event.altKey || event.metaKey) {
       return;
killedBy: GridItemComponent Phase 16 — keyboard-driven move/resize Should do nothing at all when this item is static
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] LogicalOperator
src/lib/grid-item.component.ts:792:8
     if(this.isStatic) {
       return;
     }
-    if(event.ctrlKey || event.altKey || event.metaKey) {
+    if((event.ctrlKey || event.altKey) && event.metaKey) {
       return;
     }
killedBy: GridItemComponent Phase 16 — keyboard-driven move/resize Should ignore Ctrl/Alt/Meta+Arrow entirely, letting OS/AT shortcuts through untouched
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 6

[Killed] UnaryOperator
src/lib/grid-item.component.ts:798:19
 
     const deltas: Record<string, [number, number]> = {
       ArrowDown: [0, 1],
-      ArrowLeft: [-1, 0],
+      ArrowLeft: [+1, 0],
       ArrowRight: [1, 0],
       ArrowUp: [0, -1],
killedBy: GridItemComponent Phase 16 — keyboard-driven move/resize Should move the item in every arrow direction correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "eventType": "dragend",
-   "x": 3,

[Killed] ArrayDeclaration
src/lib/grid-item.component.ts:799:19
     const deltas: Record<string, [number, number]> = {
       ArrowDown: [0, 1],
       ArrowLeft: [-1, 0],
-      ArrowRight: [1, 0],
+      ArrowRight: [],
       ArrowUp: [0, -1],
     };
killedBy: GridItemComponent Phase 16 — keyboard-driven move/resize Should move the item right by one grid unit on ArrowRight, reporting a synthetic dragstart then dragend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -4,9 +4,9 @@
      "x": 4,
      "y": 4,
