[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1089:12
         newPosition.top = clientRect.top - parentRect.top;
         this.dragging = newPosition;
         this.isDragging = true;
-        if(this.autoScroll) {
+        if(true) {
           this.autoScrollEngine.start(target);
         }
killedBy: GridItemComponent Phase 3 — dragging Should not touch the auto-scroll engine at all when autoScroll is off (the default)
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

  "ng-reflect-ng-template-outlet-context": "[object Object]"
}--></span><!--container--><span class="kdl-resize-hint kdl-resize-hint--s"><!--bindings={

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1094:7
         }
         break;
       }
-      case `dragend`: {
-        if(!this.isDragging) {
-          return;
-        }
-        // Bug fix (ported from Vue's own useGridItemDrag.ts, docs/
-        // REFACTORING.md #41 there): reusing `dragging`'s own
-        // already-accumulated position here, rather than re-deriving
-        // it from a fresh getBoundingClientRect() read, avoids a race
-        // between however many dragmove ticks already ran
-        // synchronously and Angular's own (asynchronous) rendering of
-        // the resulting style.
-        if(this.resolvedIsMirrored) {
-          newPosition.right = Number(this.dragging?.right);
-        } else {
-          newPosition.left = Number(this.dragging?.left);
-        }
-        newPosition.top = Number(this.dragging?.top);
-        this.dragging = undefined;
-        this.isDragging = false;
-        this.autoScrollEngine.stop();
-        break;
-      }
+      case `dragend`:
       case `dragmove`: {
         const coreEvent = createCoreData(this.lastX, this.lastY, x, y);
killedBy: GridItemComponent Phase 3 — dragging Should clear isDragging and dragging on dragend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/lib/grid-item.component.ts:1094:23
         }
         break;
       }
-      case `dragend`: {
-        if(!this.isDragging) {
-          return;
-        }
-        // Bug fix (ported from Vue's own useGridItemDrag.ts, docs/
-        // REFACTORING.md #41 there): reusing `dragging`'s own
-        // already-accumulated position here, rather than re-deriving
-        // it from a fresh getBoundingClientRect() read, avoids a race
-        // between however many dragmove ticks already ran
-        // synchronously and Angular's own (asynchronous) rendering of
-        // the resulting style.
-        if(this.resolvedIsMirrored) {
-          newPosition.right = Number(this.dragging?.right);
-        } else {
-          newPosition.left = Number(this.dragging?.left);
-        }
-        newPosition.top = Number(this.dragging?.top);
-        this.dragging = undefined;
-        this.isDragging = false;
-        this.autoScrollEngine.stop();
-        break;
-      }
+      case `dragend`: {}
       case `dragmove`: {
         const coreEvent = createCoreData(this.lastX, this.lastY, x, y);
killedBy: GridItemComponent Phase 3 — dragging Should clear isDragging and dragging on dragend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:1095:12
         break;
       }
       case `dragend`: {
-        if(!this.isDragging) {
+        if(this.isDragging) {
           return;
         }
killedBy: GridItemComponent Phase 3 — dragging Should clear isDragging and dragging on dragend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1095:12
         break;
       }
       case `dragend`: {
-        if(!this.isDragging) {
+        if(true) {
           return;
         }
killedBy: GridItemComponent Phase 3 — dragging Should clear isDragging and dragging on dragend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1105:12
         // between however many dragmove ticks already ran
         // synchronously and Angular's own (asynchronous) rendering of
         // the resulting style.
-        if(this.resolvedIsMirrored) {
+        if(true) {
           newPosition.right = Number(this.dragging?.right);
         } else {
killedBy: GridItemComponent itemMoved / itemResized outputs Should emit itemMoved with this item's own final grid-unit x/y on dragend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
      "i": "0",

[Survived] ConditionalExpression
src/lib/grid-item.component.ts:1105:12
         // between however many dragmove ticks already ran
         // synchronously and Angular's own (asynchronous) rendering of
         // the resulting style.
-        if(this.resolvedIsMirrored) {
+        if(false) {
           newPosition.right = Number(this.dragging?.right);
         } else {

[Survived] OptionalChaining
src/lib/grid-item.component.ts:1106:38
         // synchronously and Angular's own (asynchronous) rendering of
         // the resulting style.
         if(this.resolvedIsMirrored) {
-          newPosition.right = Number(this.dragging?.right);
+          newPosition.right = Number(this.dragging.right);
         } else {
           newPosition.left = Number(this.dragging?.left);

[Killed] BlockStatement
src/lib/grid-item.component.ts:1107:16
         // the resulting style.
         if(this.resolvedIsMirrored) {
           newPosition.right = Number(this.dragging?.right);
-        } else {
-          newPosition.left = Number(this.dragging?.left);
-        }
+        } else {}
         newPosition.top = Number(this.dragging?.top);
         this.dragging = undefined;
killedBy: GridItemComponent itemMoved / itemResized outputs Should emit itemMoved with this item's own final grid-unit x/y on dragend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
      "i": "0",

[Survived] OptionalChaining
src/lib/grid-item.component.ts:1108:37
         if(this.resolvedIsMirrored) {
           newPosition.right = Number(this.dragging?.right);
         } else {
-          newPosition.left = Number(this.dragging?.left);
+          newPosition.left = Number(this.dragging.left);
         }
         newPosition.top = Number(this.dragging?.top);

[Survived] OptionalChaining
src/lib/grid-item.component.ts:1110:34
         } else {
           newPosition.left = Number(this.dragging?.left);
         }
-        newPosition.top = Number(this.dragging?.top);
+        newPosition.top = Number(this.dragging.top);
         this.dragging = undefined;
         this.isDragging = false;

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:1112:27
         }
         newPosition.top = Number(this.dragging?.top);
         this.dragging = undefined;
-        this.isDragging = false;
+        this.isDragging = true;
         this.autoScrollEngine.stop();
         break;
killedBy: GridItemComponent Phase 3 — dragging Should clear isDragging and dragging on dragend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ArithmeticOperator
src/lib/grid-item.component.ts:1118:30
       }
       case `dragmove`: {
         const coreEvent = createCoreData(this.lastX, this.lastY, x, y);
-        const scaledDeltaX = coreEvent.deltaX / this.transformScale;
+        const scaledDeltaX = coreEvent.deltaX * this.transformScale;
         const scaledDeltaY = coreEvent.deltaY / this.transformScale;
         if(this.resolvedIsMirrored) {

[Survived] ArithmeticOperator
src/lib/grid-item.component.ts:1119:30
       case `dragmove`: {
         const coreEvent = createCoreData(this.lastX, this.lastY, x, y);
         const scaledDeltaX = coreEvent.deltaX / this.transformScale;
-        const scaledDeltaY = coreEvent.deltaY / this.transformScale;
+        const scaledDeltaY = coreEvent.deltaY * this.transformScale;
         if(this.resolvedIsMirrored) {
           newPosition.right = Number(this.dragging?.right) - scaledDeltaX;

[Killed] BlockStatement
src/lib/grid-item.component.ts:1120:37
         const coreEvent = createCoreData(this.lastX, this.lastY, x, y);
         const scaledDeltaX = coreEvent.deltaX / this.transformScale;
         const scaledDeltaY = coreEvent.deltaY / this.transformScale;
-        if(this.resolvedIsMirrored) {
-          newPosition.right = Number(this.dragging?.right) - scaledDeltaX;
-        } else {
+        if(this.resolvedIsMirrored) {} else {
           newPosition.left = Number(this.dragging?.left) + scaledDeltaX;
         }
killedBy: GridItemComponent Phase 3 — dragging Should track position via right (not left) when isMirrored is true, throughout a full drag gesture
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -20
Received: undefined

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1120:12
         const coreEvent = createCoreData(this.lastX, this.lastY, x, y);
         const scaledDeltaX = coreEvent.deltaX / this.transformScale;
         const scaledDeltaY = coreEvent.deltaY / this.transformScale;
-        if(this.resolvedIsMirrored) {
+        if(false) {
           newPosition.right = Number(this.dragging?.right) - scaledDeltaX;
         } else {
killedBy: GridItemComponent Phase 3 — dragging Should track position via right (not left) when isMirrored is true, throughout a full drag gesture
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -20
Received: undefined

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1121:31
         const scaledDeltaX = coreEvent.deltaX / this.transformScale;
         const scaledDeltaY = coreEvent.deltaY / this.transformScale;
         if(this.resolvedIsMirrored) {
-          newPosition.right = Number(this.dragging?.right) - scaledDeltaX;
+          newPosition.right = Number(this.dragging?.right) + scaledDeltaX;
         } else {
           newPosition.left = Number(this.dragging?.left) + scaledDeltaX;
killedBy: GridItemComponent Phase 3 — dragging Should track position via right (not left) when isMirrored is true, throughout a full drag gesture
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -20
Received: 40

[Survived] OptionalChaining
src/lib/grid-item.component.ts:1121:38
         const scaledDeltaX = coreEvent.deltaX / this.transformScale;
         const scaledDeltaY = coreEvent.deltaY / this.transformScale;
         if(this.resolvedIsMirrored) {
-          newPosition.right = Number(this.dragging?.right) - scaledDeltaX;
+          newPosition.right = Number(this.dragging.right) - scaledDeltaX;
         } else {
           newPosition.left = Number(this.dragging?.left) + scaledDeltaX;

[Killed] BlockStatement
src/lib/grid-item.component.ts:1122:16
         const scaledDeltaY = coreEvent.deltaY / this.transformScale;
         if(this.resolvedIsMirrored) {
           newPosition.right = Number(this.dragging?.right) - scaledDeltaX;
-        } else {
-          newPosition.left = Number(this.dragging?.left) + scaledDeltaX;
-        }
+        } else {}
         newPosition.top = Number(this.dragging?.top) + scaledDeltaY;
         if(this.resolvedIsBounded) {
killedBy: GridItemComponent Phase 3 — dragging Should accumulate pixel deltas across dragmove ticks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 160
Received: undefined

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1123:30
         if(this.resolvedIsMirrored) {
           newPosition.right = Number(this.dragging?.right) - scaledDeltaX;
         } else {
-          newPosition.left = Number(this.dragging?.left) + scaledDeltaX;
+          newPosition.left = Number(this.dragging?.left) - scaledDeltaX;
         }
         newPosition.top = Number(this.dragging?.top) + scaledDeltaY;
killedBy: GridItemComponent Phase 3 — dragging Should accumulate pixel deltas across dragmove ticks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 160
Received: 40

[Survived] OptionalChaining
src/lib/grid-item.component.ts:1123:37
         if(this.resolvedIsMirrored) {
           newPosition.right = Number(this.dragging?.right) - scaledDeltaX;
         } else {
-          newPosition.left = Number(this.dragging?.left) + scaledDeltaX;
+          newPosition.left = Number(this.dragging.left) + scaledDeltaX;
         }
         newPosition.top = Number(this.dragging?.top) + scaledDeltaY;

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1125:27
         } else {
           newPosition.left = Number(this.dragging?.left) + scaledDeltaX;
         }
-        newPosition.top = Number(this.dragging?.top) + scaledDeltaY;
+        newPosition.top = Number(this.dragging?.top) - scaledDeltaY;
         if(this.resolvedIsBounded) {
           const target = event.target;
killedBy: GridItemComponent Phase 3 — dragging Phase 6 — isBounded Should not clamp the drag position at all when isBounded is false (the default)
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1000
Received:   -4900

[Survived] OptionalChaining
src/lib/grid-item.component.ts:1125:34
         } else {
           newPosition.left = Number(this.dragging?.left) + scaledDeltaX;
         }
-        newPosition.top = Number(this.dragging?.top) + scaledDeltaY;
+        newPosition.top = Number(this.dragging.top) + scaledDeltaY;
         if(this.resolvedIsBounded) {
           const target = event.target;

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1126:12
           newPosition.left = Number(this.dragging?.left) + scaledDeltaX;
         }
         newPosition.top = Number(this.dragging?.top) + scaledDeltaY;
-        if(this.resolvedIsBounded) {
+        if(true) {
           const target = event.target;
           const parentTarget = target.offsetParent as HTMLElement;
killedBy: GridItemComponent Phase 3 — dragging Should track position via right (not left) when isMirrored is true, throughout a full drag gesture
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -20
Received: 0

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1126:12
           newPosition.left = Number(this.dragging?.left) + scaledDeltaX;
         }
         newPosition.top = Number(this.dragging?.top) + scaledDeltaY;
-        if(this.resolvedIsBounded) {
+        if(false) {
           const target = event.target;
           const parentTarget = target.offsetParent as HTMLElement;
killedBy: GridItemComponent Phase 3 — dragging Phase 6 — isBounded Should clamp the drag position to the container's own bounds when isBounded is true
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 117
Received:    5010

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1129:34
         if(this.resolvedIsBounded) {
           const target = event.target;
           const parentTarget = target.offsetParent as HTMLElement;
-          const bottomBoundary = parentTarget.clientHeight - calcGridItemWH(this.h, this.rowHeight, this.margin[1]);
+          const bottomBoundary = parentTarget.clientHeight + calcGridItemWH(this.h, this.rowHeight, this.margin[1]);
           newPosition.top = clamp(newPosition.top, 0, bottomBoundary);
           const colWidth = calcColWidth(this.containerWidth, this.margin[0], this.colNum);
killedBy: GridItemComponent Phase 3 — dragging Phase 6 — isBounded Should clamp the drag position to the container's own bounds when isBounded is true
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 90
Received:    510

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1132:33
           const bottomBoundary = parentTarget.clientHeight - calcGridItemWH(this.h, this.rowHeight, this.margin[1]);
           newPosition.top = clamp(newPosition.top, 0, bottomBoundary);
           const colWidth = calcColWidth(this.containerWidth, this.margin[0], this.colNum);
-          const rightBoundary = this.containerWidth - calcGridItemWH(this.w, colWidth, this.margin[0]);
+          const rightBoundary = this.containerWidth + calcGridItemWH(this.w, colWidth, this.margin[0]);
           if(this.resolvedIsMirrored && newPosition.right !== undefined) {
             newPosition.right = clamp(newPosition.right, 0, rightBoundary);
killedBy: GridItemComponent Phase 3 — dragging Phase 6 — isBounded Should clamp the drag position to the container's own bounds when isBounded is true
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 117
Received:    483

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1133:14
           newPosition.top = clamp(newPosition.top, 0, bottomBoundary);
           const colWidth = calcColWidth(this.containerWidth, this.margin[0], this.colNum);
           const rightBoundary = this.containerWidth - calcGridItemWH(this.w, colWidth, this.margin[0]);
-          if(this.resolvedIsMirrored && newPosition.right !== undefined) {
+          if(true) {
             newPosition.right = clamp(newPosition.right, 0, rightBoundary);
           } else if(newPosition.left !== undefined) {
killedBy: GridItemComponent Phase 3 — dragging Phase 6 — isBounded Should clamp the drag position to the container's own bounds when isBounded is true
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 117
Received:    5010

[Killed] EqualityOperator
src/lib/grid-item.component.ts:1133:41
           newPosition.top = clamp(newPosition.top, 0, bottomBoundary);
           const colWidth = calcColWidth(this.containerWidth, this.margin[0], this.colNum);
           const rightBoundary = this.containerWidth - calcGridItemWH(this.w, colWidth, this.margin[0]);
-          if(this.resolvedIsMirrored && newPosition.right !== undefined) {
+          if(this.resolvedIsMirrored && newPosition.right === undefined) {
             newPosition.right = clamp(newPosition.right, 0, rightBoundary);
           } else if(newPosition.left !== undefined) {
killedBy: GridItemComponent Phase 3 — dragging Phase 6 — isBounded Should clamp the drag position via the right anchor, not left, when isBounded and isMirrored are both true
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 0
Received:    -4807

[Killed] BlockStatement
src/lib/grid-item.component.ts:1135:53
           const rightBoundary = this.containerWidth - calcGridItemWH(this.w, colWidth, this.margin[0]);
           if(this.resolvedIsMirrored && newPosition.right !== undefined) {
             newPosition.right = clamp(newPosition.right, 0, rightBoundary);
-          } else if(newPosition.left !== undefined) {
-            newPosition.left = clamp(newPosition.left, 0, rightBoundary);
-          }
+          } else if(newPosition.left !== undefined) {}
         }
         this.dragging = newPosition;
killedBy: GridItemComponent Phase 3 — dragging Phase 6 — isBounded Should clamp the drag position to the container's own bounds when isBounded is true
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 117
Received:    5010

[Killed] EqualityOperator
src/lib/grid-item.component.ts:1135:21
           const rightBoundary = this.containerWidth - calcGridItemWH(this.w, colWidth, this.margin[0]);
           if(this.resolvedIsMirrored && newPosition.right !== undefined) {
             newPosition.right = clamp(newPosition.right, 0, rightBoundary);
-          } else if(newPosition.left !== undefined) {
+          } else if(newPosition.left === undefined) {
             newPosition.left = clamp(newPosition.left, 0, rightBoundary);
           }
killedBy: GridItemComponent Phase 3 — dragging Phase 6 — isBounded Should clamp the drag position to the container's own bounds when isBounded is true
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 117
Received:    5010

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1140:12
           }
         }
         this.dragging = newPosition;
-        if(this.autoScroll) {
+        if(false) {
           this.autoScrollEngine.update(event.clientX, event.clientY);
         }
killedBy: GridItemComponent Phase 3 — dragging Should start/update/stop the auto-scroll engine across a full drag gesture when autoScroll is on
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 130, 50

Number of calls: 0

[Killed] BlockStatement
src/lib/grid-item.component.ts:1140:29
           }
         }
         this.dragging = newPosition;
-        if(this.autoScroll) {
-          this.autoScrollEngine.update(event.clientX, event.clientY);
-        }
+        if(this.autoScroll) {}
         break;
       }
killedBy: GridItemComponent Phase 3 — dragging Should start/update/stop the auto-scroll engine across a full drag gesture when autoScroll is on
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 130, 50

Number of calls: 0

[NoCoverage] ConditionalExpression
src/lib/grid-item.component.ts:1152:7
       // strings before calling this handler at all — there is no call
       // path that reaches this switch with any fourth value.
       /* istanbul ignore next -- see the comment above: unreachable since event.type can never be a fourth value the native handler would forward. */
-      default: {
-        return;
-      }
+      // Confirmed unreachable, not assumed: event.type's own type
+// (INativeDragEvent) is a closed union of exactly dragstart/
+// dragmove/dragend, and native-interaction.ts's own pointerdown
+// handler only ever constructs one of those three literal
+// strings before calling this handler at all — there is no call
+// path that reaches this switch with any fourth value.
+/* istanbul ignore next -- see the comment above: unreachable since event.type can never be a fourth value the native handler would forward. */
+default:
     }
 

[NoCoverage] BlockStatement
src/lib/grid-item.component.ts:1152:16
       // strings before calling this handler at all — there is no call
       // path that reaches this switch with any fourth value.
       /* istanbul ignore next -- see the comment above: unreachable since event.type can never be a fourth value the native handler would forward. */
-      default: {
-        return;
-      }
+      default: {}
     }
 

[Survived] ArithmeticOperator
src/lib/grid-item.component.ts:1163:9
     // Vue's own calcXY, which likewise always resolves to a plain left
     // distance internally regardless of render direction.
     const leftForCalc = this.resolvedIsMirrored
-      ? this.containerWidth - Number(newPosition.right) - calcGridItemWH(this.w, calcColWidth(this.containerWidth, this.margin[0], this.colNum), this.margin[0])
+      ? this.containerWidth - Number(newPosition.right) + calcGridItemWH(this.w, calcColWidth(this.containerWidth, this.margin[0], this.colNum), this.margin[0])
       : Number(newPosition.left);
     const pos = this.calcXY(newPosition.top, leftForCalc);

[Survived] ArithmeticOperator
src/lib/grid-item.component.ts:1163:9
     // Vue's own calcXY, which likewise always resolves to a plain left
     // distance internally regardless of render direction.
     const leftForCalc = this.resolvedIsMirrored
-      ? this.containerWidth - Number(newPosition.right) - calcGridItemWH(this.w, calcColWidth(this.containerWidth, this.margin[0], this.colNum), this.margin[0])
+      ? this.containerWidth + Number(newPosition.right) - calcGridItemWH(this.w, calcColWidth(this.containerWidth, this.margin[0], this.colNum), this.margin[0])
       : Number(newPosition.left);
     const pos = this.calcXY(newPosition.top, leftForCalc);

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1172:8
     this.style = this.computeStyle();
     this.changeDetectorRef.markForCheck();
 
-    if(event.type === `dragend`) {
+    if(true) {
       this.itemMoved.emit({ i: this.i, x: pos.x, y: pos.y });
     }
killedBy: GridItemComponent itemMoved / itemResized outputs Should emit itemMoved with this item's own final grid-unit x/y on dragend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 10

  Array [
    Object {
      "i": "0",

[Killed] BlockStatement
src/lib/grid-item.component.ts:1172:34
     this.style = this.computeStyle();
     this.changeDetectorRef.markForCheck();
 
-    if(event.type === `dragend`) {
-      this.itemMoved.emit({ i: this.i, x: pos.x, y: pos.y });
-    }
+    if(event.type === `dragend`) {}
 
     this.eventBus?.emitItemDrag({
killedBy: GridItemComponent itemMoved / itemResized outputs Should emit itemMoved with this item's own final grid-unit x/y on dragend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "i": "0",

[Killed] OptionalChaining
src/lib/grid-item.component.ts:1176:5
       this.itemMoved.emit({ i: this.i, x: pos.x, y: pos.y });
     }
 
-    this.eventBus?.emitItemDrag({
+    this.eventBus.emitItemDrag({
       clientX: event.clientX,
       clientY: event.clientY,
killedBy: GridItemComponent Phase 3 — dragging Should set isDragging and an initial pixel position on dragstart
statusReason: TypeError: Cannot read properties of null (reading 'emitItemDrag')

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1196:8
    * for the left/right anchor specifically.
    */
   private handleResize(event: INativeResizeEvent): void {
-    if(this.isStatic) {
+    if(false) {
       return;
     }
killedBy: GridItemComponent Phase 4 — resizing Should not react to any resize event at all when isStatic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1196:8
    * for the left/right anchor specifically.
    */
   private handleResize(event: INativeResizeEvent): void {
-    if(this.isStatic) {
+    if(true) {
       return;
     }
killedBy: GridItemComponent Phase 4 — resizing Should set isResizing and seed resizing from the item's own current grid position/size on resizestart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:1208:27
       case `resizestart`: {
         const pos = this.calcResizePosition(this.x, this.y, this.w, this.h);
         this.resizing = { ...pos };
-        this.isResizing = true;
+        this.isResizing = false;
         this.activeEdges = event.edges;
         // Confirmed unreachable, not assumed — discovered while trying to
killedBy: GridItemComponent Phase 4 — resizing Should set isResizing and seed resizing from the item's own current grid position/size on resizestart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/lib/grid-item.component.ts:1224:28
         // confirmed-unreachable case this file's own `autoSize()` already
         // documents for its own height-floor check.
-        this.aspectRatio = pos.height > 0 ? pos.width / pos.height : undefined;
+        this.aspectRatio = pos.height <= 0 ? pos.width / pos.height : undefined;
         this.lastW = x;
         this.lastH = y;
killedBy: GridItemComponent Phase 11 — preserveAspectRatio / autoHeight Should derive height from width via preserveAspectRatio when only a horizontal edge is being dragged
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 264.6875
Received: 210

Expected precision:    5
Expected difference: < 0.000005
Received difference:   54.6875

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1224:45
         // confirmed-unreachable case this file's own `autoSize()` already
         // documents for its own height-floor check.
-        this.aspectRatio = pos.height > 0 ? pos.width / pos.height : undefined;
+        this.aspectRatio = pos.height > 0 ? pos.width * pos.height : undefined;
         this.lastW = x;
         this.lastH = y;
killedBy: GridItemComponent Phase 11 — preserveAspectRatio / autoHeight Should derive height from width via preserveAspectRatio when only a horizontal edge is being dragged
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 264.6875
Received: 0.006001984126984127

Expected precision:    5
Expected difference: < 0.000005
Received difference:   264.681498015873

[Killed] OptionalChaining
src/lib/grid-item.component.ts:1229:9
         this.lastH = y;
         this.style = this.computeStyle();
         this.changeDetectorRef.markForCheck();
-        this.eventBus?.emitItemResize({ eventType: `resizestart`, h: this.h, i: this.i, w: this.w, x: this.x, y: this.y });
+        this.eventBus.emitItemResize({ eventType: `resizestart`, h: this.h, i: this.i, w: this.w, x: this.x, y: this.y });
         return;
       }
killedBy: GridItemComponent Phase 4 — resizing Should set isResizing and seed resizing from the item's own current grid position/size on resizestart
statusReason: TypeError: Cannot read properties of null (reading 'emitItemResize')
