[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1303:16
             newSize.width = newSize.height * this.aspectRatio;
           } else if(drivingWidth && drivingHeight) {
             const derivedHeight = newSize.width / this.aspectRatio;
-            if(this.activeEdges.top) {
+            if(false) {
               newSize.top = prevTop + (prevHeight - derivedHeight);
             }
killedBy: GridItemComponent Phase 11 — preserveAspectRatio / autoHeight Should derive height from width and adjust the top anchor via preserveAspectRatio during a corner (top+horizontal edge) resize
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: -44.6875
Received: 10

Expected precision:    5
Expected difference: < 0.000005
Received difference:   54.6875

[Killed] BlockStatement
src/lib/grid-item.component.ts:1303:38
             newSize.width = newSize.height * this.aspectRatio;
           } else if(drivingWidth && drivingHeight) {
             const derivedHeight = newSize.width / this.aspectRatio;
-            if(this.activeEdges.top) {
-              newSize.top = prevTop + (prevHeight - derivedHeight);
-            }
+            if(this.activeEdges.top) {}
             newSize.height = derivedHeight;
           }
killedBy: GridItemComponent Phase 11 — preserveAspectRatio / autoHeight Should derive height from width and adjust the top anchor via preserveAspectRatio during a corner (top+horizontal edge) resize
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: -44.6875
Received: 10

Expected precision:    5
Expected difference: < 0.000005
Received difference:   54.6875

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1304:29
           } else if(drivingWidth && drivingHeight) {
             const derivedHeight = newSize.width / this.aspectRatio;
             if(this.activeEdges.top) {
-              newSize.top = prevTop + (prevHeight - derivedHeight);
+              newSize.top = prevTop - (prevHeight - derivedHeight);
             }
             newSize.height = derivedHeight;
killedBy: GridItemComponent Phase 11 — preserveAspectRatio / autoHeight Should derive height from width and adjust the top anchor via preserveAspectRatio during a corner (top+horizontal edge) resize
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: -44.6875
Received: 64.6875

Expected precision:    5
Expected difference: < 0.000005
Received difference:   109.375

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1304:40
           } else if(drivingWidth && drivingHeight) {
             const derivedHeight = newSize.width / this.aspectRatio;
             if(this.activeEdges.top) {
-              newSize.top = prevTop + (prevHeight - derivedHeight);
+              newSize.top = prevTop + (prevHeight + derivedHeight);
             }
             newSize.height = derivedHeight;
killedBy: GridItemComponent Phase 11 — preserveAspectRatio / autoHeight Should derive height from width and adjust the top anchor via preserveAspectRatio during a corner (top+horizontal edge) resize
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: -44.6875
Received: 484.6875

Expected precision:    5
Expected difference: < 0.000005
Received difference:   529.375

[Killed] ObjectLiteral
src/lib/grid-item.component.ts:1311:13
         }
 
         this.resizing = this.resolvedIsMirrored
-          ? { height: newSize.height, right: Number(newSize.horizontal), top: Number(newSize.top), width: newSize.width }
+          ? {}
           : { height: newSize.height, left: Number(newSize.horizontal), top: Number(newSize.top), width: newSize.width };
         break;
killedBy: GridItemComponent Phase 4 — resizing Should grow width via the left edge without moving the (right-measured) anchor, when isMirrored is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 242
Received: undefined

[Killed] BlockStatement
src/lib/grid-item.component.ts:1315:25
           : { height: newSize.height, left: Number(newSize.horizontal), top: Number(newSize.top), width: newSize.width };
         break;
       }
-      case `resizeend`: {
-        if(!this.isResizing) {
-          return;
-        }
-        newSize.width = Number(this.resizing?.width);
-        newSize.height = Number(this.resizing?.height);
-        newSize.top = Number(this.resizing?.top);
-        newSize.horizontal = this.resolvedIsMirrored ? Number(this.resizing?.right) : Number(this.resizing?.left);
-        this.resizing = undefined;
-        this.isResizing = false;
-        this.aspectRatio = undefined;
-        break;
-      }
+      case `resizeend`: {}
       // Confirmed unreachable, not assumed: event.type's own type
       // (INativeResizeEvent) is a closed union of exactly resizestart/
killedBy: GridItemComponent Phase 4 — resizing Should clear isResizing and resizing on resizeend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1315:7
           : { height: newSize.height, left: Number(newSize.horizontal), top: Number(newSize.top), width: newSize.width };
         break;
       }
-      case `resizeend`: {
-        if(!this.isResizing) {
-          return;
-        }
-        newSize.width = Number(this.resizing?.width);
-        newSize.height = Number(this.resizing?.height);
-        newSize.top = Number(this.resizing?.top);
-        newSize.horizontal = this.resolvedIsMirrored ? Number(this.resizing?.right) : Number(this.resizing?.left);
-        this.resizing = undefined;
-        this.isResizing = false;
-        this.aspectRatio = undefined;
-        break;
-      }
+      case `resizeend`:
+// Confirmed unreachable, not assumed: event.type's own type
+// (INativeResizeEvent) is a closed union of exactly resizestart/
+// resizemove/resizeend, and native-interaction.ts's own
+// pointerdown handler only ever constructs one of those three
+// literal strings before calling this handler at all — there is
+// no call path that reaches this switch with any fourth value.
+/* istanbul ignore next -- see the comment above: unreachable since event.type can never be a fourth value the native handler would forward. */
       // Confirmed unreachable, not assumed: event.type's own type
       // (INativeResizeEvent) is a closed union of exactly resizestart/
killedBy: GridItemComponent Phase 4 — resizing Should clear isResizing and resizing on resizeend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1316:12
         break;
       }
       case `resizeend`: {
-        if(!this.isResizing) {
+        if(false) {
           return;
         }
killedBy: GridItemComponent itemMoved / itemResized outputs Should not emit itemResized at all when the resize never fires a preceding resizestart (resizeend as a no-op)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:1316:12
         break;
       }
       case `resizeend`: {
-        if(!this.isResizing) {
+        if(this.isResizing) {
           return;
         }
killedBy: GridItemComponent Phase 4 — resizing Should clear isResizing and resizing on resizeend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] OptionalChaining
src/lib/grid-item.component.ts:1319:32
         if(!this.isResizing) {
           return;
         }
-        newSize.width = Number(this.resizing?.width);
+        newSize.width = Number(this.resizing.width);
         newSize.height = Number(this.resizing?.height);
         newSize.top = Number(this.resizing?.top);

[Survived] OptionalChaining
src/lib/grid-item.component.ts:1320:33
           return;
         }
         newSize.width = Number(this.resizing?.width);
-        newSize.height = Number(this.resizing?.height);
+        newSize.height = Number(this.resizing.height);
         newSize.top = Number(this.resizing?.top);
         newSize.horizontal = this.resolvedIsMirrored ? Number(this.resizing?.right) : Number(this.resizing?.left);

[Survived] OptionalChaining
src/lib/grid-item.component.ts:1321:30
         }
         newSize.width = Number(this.resizing?.width);
         newSize.height = Number(this.resizing?.height);
-        newSize.top = Number(this.resizing?.top);
+        newSize.top = Number(this.resizing.top);
         newSize.horizontal = this.resolvedIsMirrored ? Number(this.resizing?.right) : Number(this.resizing?.left);
         this.resizing = undefined;

[Survived] OptionalChaining
src/lib/grid-item.component.ts:1322:94
         newSize.width = Number(this.resizing?.width);
         newSize.height = Number(this.resizing?.height);
         newSize.top = Number(this.resizing?.top);
-        newSize.horizontal = this.resolvedIsMirrored ? Number(this.resizing?.right) : Number(this.resizing?.left);
+        newSize.horizontal = this.resolvedIsMirrored ? Number(this.resizing?.right) : Number(this.resizing.left);
         this.resizing = undefined;
         this.isResizing = false;

[Survived] OptionalChaining
src/lib/grid-item.component.ts:1322:63
         newSize.width = Number(this.resizing?.width);
         newSize.height = Number(this.resizing?.height);
         newSize.top = Number(this.resizing?.top);
-        newSize.horizontal = this.resolvedIsMirrored ? Number(this.resizing?.right) : Number(this.resizing?.left);
+        newSize.horizontal = this.resolvedIsMirrored ? Number(this.resizing.right) : Number(this.resizing?.left);
         this.resizing = undefined;
         this.isResizing = false;

[Killed] BooleanLiteral
src/lib/grid-item.component.ts:1324:27
         newSize.top = Number(this.resizing?.top);
         newSize.horizontal = this.resolvedIsMirrored ? Number(this.resizing?.right) : Number(this.resizing?.left);
         this.resizing = undefined;
-        this.isResizing = false;
+        this.isResizing = true;
         this.aspectRatio = undefined;
         break;
killedBy: GridItemComponent Phase 4 — resizing Should clear isResizing and resizing on resizeend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[NoCoverage] ConditionalExpression
src/lib/grid-item.component.ts:1335:7
       // literal strings before calling this handler at all — there is
       // no call path that reaches this switch with any fourth value.
       /* istanbul ignore next -- see the comment above: unreachable since event.type can never be a fourth value the native handler would forward. */
-      default: {
-        return;
-      }
+      // Confirmed unreachable, not assumed: event.type's own type
+// (INativeResizeEvent) is a closed union of exactly resizestart/
+// resizemove/resizeend, and native-interaction.ts's own
+// pointerdown handler only ever constructs one of those three
+// literal strings before calling this handler at all — there is
+// no call path that reaches this switch with any fourth value.
+/* istanbul ignore next -- see the comment above: unreachable since event.type can never be a fourth value the native handler would forward. */
+default:
     }
 

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1341:8
     }
 
     const pos = this.calcWH(newSize.height, newSize.width);
-    if(pos.w < this.minW) {
+    if(true) {
       pos.w = this.minW;
     }
killedBy: GridItemComponent Phase 4 — resizing Should clamp width up to maxW when growing past it
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/grid-item.component.ts:1341:27
     }
 
     const pos = this.calcWH(newSize.height, newSize.width);
-    if(pos.w < this.minW) {
-      pos.w = this.minW;
-    }
+    if(pos.w < this.minW) {}
     if(pos.w > this.maxW) {
       pos.w = this.maxW;
killedBy: GridItemComponent Phase 4 — resizing Should clamp width up to minW when shrinking below it, verified via the reported eventBus payload (not just the raw, unclamped resizing state)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/grid-item.component.ts:1344:27
     if(pos.w < this.minW) {
       pos.w = this.minW;
     }
-    if(pos.w > this.maxW) {
-      pos.w = this.maxW;
-    }
+    if(pos.w > this.maxW) {}
     if(pos.h < this.minH) {
       pos.h = this.minH;
killedBy: GridItemComponent Phase 4 — resizing Should clamp width up to maxW when growing past it
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1353:8
     if(pos.h > this.maxH) {
       pos.h = this.maxH;
     }
-    if(pos.h < 1) {
+    if(false) {
       pos.h = 1;
     }
killedBy: GridItemComponent Phase 4 — resizing Should floor width/height at 1 grid unit even when minW/minH are explicitly set to 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/grid-item.component.ts:1353:19
     if(pos.h > this.maxH) {
       pos.h = this.maxH;
     }
-    if(pos.h < 1) {
-      pos.h = 1;
-    }
+    if(pos.h < 1) {}
     if(pos.w < 1) {
       pos.w = 1;
killedBy: GridItemComponent Phase 4 — resizing Should floor width/height at 1 grid unit even when minW/minH are explicitly set to 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] LogicalOperator
src/lib/grid-item.component.ts:1363:8
     let newX = this.x;
     let newY = this.y;
     const anchorEdgeActive = this.resolvedIsMirrored ? this.activeEdges.right : this.activeEdges.left;
-    if(anchorEdgeActive && newSize.horizontal !== undefined) {
+    if(anchorEdgeActive || newSize.horizontal !== undefined) {
       const anchorGridX = this.pixelsToGridX(newSize.horizontal, pos.w);
       newX = this.resolvedIsMirrored ? this.colNum - anchorGridX - pos.w : anchorGridX;

[Survived] EqualityOperator
src/lib/grid-item.component.ts:1363:28
     let newX = this.x;
     let newY = this.y;
     const anchorEdgeActive = this.resolvedIsMirrored ? this.activeEdges.right : this.activeEdges.left;
-    if(anchorEdgeActive && newSize.horizontal !== undefined) {
+    if(anchorEdgeActive && newSize.horizontal === undefined) {
       const anchorGridX = this.pixelsToGridX(newSize.horizontal, pos.w);
       newX = this.resolvedIsMirrored ? this.colNum - anchorGridX - pos.w : anchorGridX;

[Survived] ArithmeticOperator
src/lib/grid-item.component.ts:1365:40
     const anchorEdgeActive = this.resolvedIsMirrored ? this.activeEdges.right : this.activeEdges.left;
     if(anchorEdgeActive && newSize.horizontal !== undefined) {
       const anchorGridX = this.pixelsToGridX(newSize.horizontal, pos.w);
-      newX = this.resolvedIsMirrored ? this.colNum - anchorGridX - pos.w : anchorGridX;
+      newX = this.resolvedIsMirrored ? this.colNum - anchorGridX + pos.w : anchorGridX;
     }
     if(this.activeEdges.top && newSize.top !== undefined) {

[Survived] ArithmeticOperator
src/lib/grid-item.component.ts:1365:40
     const anchorEdgeActive = this.resolvedIsMirrored ? this.activeEdges.right : this.activeEdges.left;
     if(anchorEdgeActive && newSize.horizontal !== undefined) {
       const anchorGridX = this.pixelsToGridX(newSize.horizontal, pos.w);
-      newX = this.resolvedIsMirrored ? this.colNum - anchorGridX - pos.w : anchorGridX;
+      newX = this.resolvedIsMirrored ? this.colNum + anchorGridX - pos.w : anchorGridX;
     }
     if(this.activeEdges.top && newSize.top !== undefined) {

[Killed] EqualityOperator
src/lib/grid-item.component.ts:1367:32
       const anchorGridX = this.pixelsToGridX(newSize.horizontal, pos.w);
       newX = this.resolvedIsMirrored ? this.colNum - anchorGridX - pos.w : anchorGridX;
     }
-    if(this.activeEdges.top && newSize.top !== undefined) {
+    if(this.activeEdges.top && newSize.top === undefined) {
       newY = this.pixelsToGridY(newSize.top, pos.h);
     }
killedBy: GridItemComponent Phase 4 — resizing Should commit a moved x/y for a top-edge resize, converted via pixelsToGridY
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/grid-item.component.ts:1367:59
       const anchorGridX = this.pixelsToGridX(newSize.horizontal, pos.w);
       newX = this.resolvedIsMirrored ? this.colNum - anchorGridX - pos.w : anchorGridX;
     }
-    if(this.activeEdges.top && newSize.top !== undefined) {
-      newY = this.pixelsToGridY(newSize.top, pos.h);
-    }
+    if(this.activeEdges.top && newSize.top !== undefined) {}
 
     this.lastW = x;
killedBy: GridItemComponent Phase 4 — resizing Should commit a moved x/y for a top-edge resize, converted via pixelsToGridY
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1377:8
     this.style = this.computeStyle();
     this.changeDetectorRef.markForCheck();
 
-    if(event.type === `resizeend`) {
+    if(true) {
       this.itemResized.emit({ h: pos.h, height: newSize.height, i: this.i, w: pos.w, width: newSize.width });
     }
killedBy: GridItemComponent itemMoved / itemResized outputs Should emit itemResized with this item's own final grid-unit h/w and pixel height/width on resizeend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 7

@@ -4,6 +4,13 @@
      "height": 210,
      "i": "0",

[Killed] BlockStatement
src/lib/grid-item.component.ts:1377:36
     this.style = this.computeStyle();
     this.changeDetectorRef.markForCheck();
 
-    if(event.type === `resizeend`) {
-      this.itemResized.emit({ h: pos.h, height: newSize.height, i: this.i, w: pos.w, width: newSize.width });
-    }
+    if(event.type === `resizeend`) {}
 
     this.eventBus?.emitItemResize({
killedBy: GridItemComponent itemMoved / itemResized outputs Should emit itemResized with this item's own final grid-unit h/w and pixel height/width on resizeend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- Array [
-   Object {
-     "h": 2,

[Killed] ObjectLiteral
src/lib/grid-item.component.ts:1378:29
     this.changeDetectorRef.markForCheck();
 
     if(event.type === `resizeend`) {
-      this.itemResized.emit({ h: pos.h, height: newSize.height, i: this.i, w: pos.w, width: newSize.width });
+      this.itemResized.emit({});
     }
 
killedBy: GridItemComponent itemMoved / itemResized outputs Should emit itemResized with this item's own final grid-unit h/w and pixel height/width on resizeend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

  Array [
-   Object {
-     "h": 2,

[Killed] OptionalChaining
src/lib/grid-item.component.ts:1381:5
       this.itemResized.emit({ h: pos.h, height: newSize.height, i: this.i, w: pos.w, width: newSize.width });
     }
 
-    this.eventBus?.emitItemResize({
+    this.eventBus.emitItemResize({
       eventType: event.type,
       h: pos.h,
killedBy: GridItemComponent Phase 4 — resizing Should grow width when dragging the right ("e") edge
statusReason: TypeError: Cannot read properties of null (reading 'emitItemResize')

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1396:8
     // — `calcColWidth` throws on an unmeasured/zero container width,
     // which every instance of this component starts out as before its
     // own first real measurement arrives.
-    if(!Number.isFinite(this.containerWidth) || this.containerWidth < 1) {
+    if(true) {
       return {};
     }
killedBy: GridLayoutComponent GridEventBusService DI cascade into a real, nested GridItemComponent Should have the nested GridItemComponent's own style reflect the parent's colNum/rowHeight/margin, with no dire
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(20px,20px, 0)"
Received: undefined

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1396:49
     // — `calcColWidth` throws on an unmeasured/zero container width,
     // which every instance of this component starts out as before its
     // own first real measurement arrives.
-    if(!Number.isFinite(this.containerWidth) || this.containerWidth < 1) {
+    if(!Number.isFinite(this.containerWidth) || false) {
       return {};
     }
killedBy: GridItemComponent Should render nothing meaningful (an empty style object) before containerWidth is measured
statusReason: Error: Invalid parameter containerWidth passed

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1406:8
     let width: number;
     let height: number;
 
-    if(this.isResizing && this.resizing) {
+    if(true) {
       // While actively resizing, `resizing`'s own accumulated pixel
       // position+size overrides the grid-unit-derived ones entirely —
killedBy: GridItemComponent Should compute the correct left/top/width/height for an item at the grid's own origin
statusReason: TypeError: Cannot destructure property 'left' of 'this.resizing' as it is undefined.

[Killed] BlockStatement
src/lib/grid-item.component.ts:1406:42
     let width: number;
     let height: number;
 
-    if(this.isResizing && this.resizing) {
-      // While actively resizing, `resizing`'s own accumulated pixel
-      // position+size overrides the grid-unit-derived ones entirely —
-      // the item tracks the pointer smoothly, rather than snapping to
-      // whichever grid cell boundary it's currently nearest, matching
-      // Vue's own `createStyle()`.
-      ({ left, right, top, width, height } = this.resizing);
-    } else {
+    if(this.isResizing && this.resizing) {} else {
       const [marginH, marginV] = this.margin;
       const colWidth = calcColWidth(this.containerWidth, marginH, this.colNum);
killedBy: GridItemComponent Phase 4 — resizing Should override the grid-unit-derived style with the live pixel position+size while resizing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "192px"
Received: "undefinedpx"

[Killed] BlockStatement
src/lib/grid-item.component.ts:1413:12
       // whichever grid cell boundary it's currently nearest, matching
       // Vue's own `createStyle()`.
       ({ left, right, top, width, height } = this.resizing);
-    } else {
-      const [marginH, marginV] = this.margin;
-      const colWidth = calcColWidth(this.containerWidth, marginH, this.colNum);
-      width = calcGridItemWH(this.w, colWidth, marginH);
-      height = calcGridItemWH(this.h, this.rowHeight, marginV);
-
-      if(this.isDragging && this.dragging) {
-        // isBounded's own clamping already happened inside handleDrag's
-        // own dragmove case, before dragging is ever assigned — the
-        // value read here is already clamped when isBounded is true, no
-        // further adjustment needed at render time.
-        left = this.dragging.left;
-        right = this.dragging.right;
-        top = this.dragging.top;
-      } else if(this.resolvedIsMirrored) {
-        right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) * marginH);
-        top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
-      } else {
-        left = Math.round(colWidth * this.x + (this.x + 1) * marginH);
-        top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
-      }
-    }
+    } else {}
 
     if(this.useCssTransforms) {
killedBy: GridLayoutComponent GridEventBusService DI cascade into a real, nested GridItemComponent Should have the nested GridItemComponent's own style reflect the parent's colNum/rowHeight/margin, with no dire
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(20px,20px, 0)"
Received: "translate3d(NaNpx,undefinedpx, 0)"

[Killed] BlockStatement
src/lib/grid-item.component.ts:1419:44
       width = calcGridItemWH(this.w, colWidth, marginH);
       height = calcGridItemWH(this.h, this.rowHeight, marginV);
 
-      if(this.isDragging && this.dragging) {
-        // isBounded's own clamping already happened inside handleDrag's
-        // own dragmove case, before dragging is ever assigned — the
-        // value read here is already clamped when isBounded is true, no
-        // further adjustment needed at render time.
-        left = this.dragging.left;
-        right = this.dragging.right;
-        top = this.dragging.top;
-      } else if(this.resolvedIsMirrored) {
+      if(this.isDragging && this.dragging) {} else if(this.resolvedIsMirrored) {
         right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) * marginH);
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
killedBy: GridItemComponent Phase 3 — dragging Should override the grid-unit-derived style with the live pixel position while dragging
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(100px,50px, 0)"
Received: "translate3d(NaNpx,undefinedpx, 0)"

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1419:10
       width = calcGridItemWH(this.w, colWidth, marginH);
       height = calcGridItemWH(this.h, this.rowHeight, marginV);
 
-      if(this.isDragging && this.dragging) {
+      if(true) {
         // isBounded's own clamping already happened inside handleDrag's
         // own dragmove case, before dragging is ever assigned — the
killedBy: GridLayoutComponent GridEventBusService DI cascade into a real, nested GridItemComponent Should have the nested GridItemComponent's own style reflect the parent's colNum/rowHeight/margin, with no dire
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(20px,20px, 0)"
Received: undefined

[Killed] BlockStatement
src/lib/grid-item.component.ts:1427:42
         left = this.dragging.left;
         right = this.dragging.right;
         top = this.dragging.top;
-      } else if(this.resolvedIsMirrored) {
-        right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) * marginH);
-        top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
-      } else {
+      } else if(this.resolvedIsMirrored) {} else {
         left = Math.round(colWidth * this.x + (this.x + 1) * marginH);
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should position via right (not left) when isMirrored is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(-1018px,10px, 0)"
Received: "translate3d(NaNpx,undefinedpx, 0)"

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1427:17
         left = this.dragging.left;
         right = this.dragging.right;
         top = this.dragging.top;
-      } else if(this.resolvedIsMirrored) {
+      } else if(true) {
         right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) * marginH);
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
killedBy: GridItemComponent Should compute the correct left/top/width/height for an item at the grid's own origin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(10px,10px, 0)"
Received: "translate3d(NaNpx,10px, 0)"

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1428:28
         right = this.dragging.right;
         top = this.dragging.top;
       } else if(this.resolvedIsMirrored) {
-        right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) * marginH);
+        right = Math.round(colWidth * (this.colNum - this.x - this.w) - (this.colNum - this.x - this.w + 1) * marginH);
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
       } else {
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should position via right (not left) when isMirrored is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(-1018px,10px, 0)"
Received: "translate3d(-798px,10px, 0)"

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1428:73
         right = this.dragging.right;
         top = this.dragging.top;
       } else if(this.resolvedIsMirrored) {
-        right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) * marginH);
+        right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) / marginH);
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
       } else {
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should position via right (not left) when isMirrored is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(-1018px,10px, 0)"
Received: "translate3d(-909px,10px, 0)"
