[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1429:26
         top = this.dragging.top;
       } else if(this.resolvedIsMirrored) {
         right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) * marginH);
-        top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
+        top = Math.round(this.rowHeight * this.y - (this.y + 1) * marginV);
       } else {
         left = Math.round(colWidth * this.x + (this.x + 1) * marginH);
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should position via right (not left) when isMirrored is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(-1018px,10px, 0)"
Received: "translate3d(-1018px,-10px, 0)"

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1429:52
         top = this.dragging.top;
       } else if(this.resolvedIsMirrored) {
         right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) * marginH);
-        top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
+        top = Math.round(this.rowHeight * this.y + (this.y + 1) / marginV);
       } else {
         left = Math.round(colWidth * this.x + (this.x + 1) * marginH);
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should position via right (not left) when isMirrored is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(-1018px,10px, 0)"
Received: "translate3d(-1018px,0px, 0)"

[Killed] BlockStatement
src/lib/grid-item.component.ts:1430:14
       } else if(this.resolvedIsMirrored) {
         right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) * marginH);
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
-      } else {
-        left = Math.round(colWidth * this.x + (this.x + 1) * marginH);
-        top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
-      }
+      } else {}
     }
 
killedBy: GridItemComponent Should compute the correct left/top/width/height for an item at the grid's own origin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(10px,10px, 0)"
Received: "translate3d(NaNpx,undefinedpx, 0)"

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1431:27
         right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) * marginH);
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
       } else {
-        left = Math.round(colWidth * this.x + (this.x + 1) * marginH);
+        left = Math.round(colWidth / this.x + (this.x + 1) * marginH);
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
       }
killedBy: GridItemComponent Should compute the correct left/top/width/height for an item at the grid's own origin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(10px,10px, 0)"
Received: "translate3d(Infinitypx,10px, 0)"

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1431:27
         right = Math.round(colWidth * (this.colNum - this.x - this.w) + (this.colNum - this.x - this.w + 1) * marginH);
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
       } else {
-        left = Math.round(colWidth * this.x + (this.x + 1) * marginH);
+        left = Math.round(colWidth * this.x - (this.x + 1) * marginH);
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
       }
killedBy: GridItemComponent Should compute the correct left/top/width/height for an item at the grid's own origin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(10px,10px, 0)"
Received: "translate3d(-10px,10px, 0)"

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1432:53
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
       } else {
         left = Math.round(colWidth * this.x + (this.x + 1) * marginH);
-        top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
+        top = Math.round(this.rowHeight * this.y + (this.y - 1) * marginV);
       }
     }
killedBy: GridLayoutComponent GridEventBusService DI cascade into a real, nested GridItemComponent Should have the nested GridItemComponent's own style reflect the parent's colNum/rowHeight/margin, with no dire
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(20px,20px, 0)"
Received: "translate3d(20px,-20px, 0)"

[Killed] ArithmeticOperator
src/lib/grid-item.component.ts:1432:52
         top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
       } else {
         left = Math.round(colWidth * this.x + (this.x + 1) * marginH);
-        top = Math.round(this.rowHeight * this.y + (this.y + 1) * marginV);
+        top = Math.round(this.rowHeight * this.y + (this.y + 1) / marginV);
       }
     }
killedBy: GridLayoutComponent GridEventBusService DI cascade into a real, nested GridItemComponent Should have the nested GridItemComponent's own style reflect the parent's colNum/rowHeight/margin, with no dire
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(20px,20px, 0)"
Received: "translate3d(20px,0px, 0)"

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1436:8
       }
     }
 
-    if(this.useCssTransforms) {
+    if(false) {
       return this.resolvedIsMirrored && right !== undefined
         ? setTransformRtl(top, right, width, height)
killedBy: GridLayoutComponent GridEventBusService DI cascade into a real, nested GridItemComponent Should have the nested GridItemComponent's own style reflect the parent's colNum/rowHeight/margin, with no dire
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(20px,20px, 0)"
Received: undefined

[Killed] BlockStatement
src/lib/grid-item.component.ts:1436:31
       }
     }
 
-    if(this.useCssTransforms) {
-      return this.resolvedIsMirrored && right !== undefined
-        ? setTransformRtl(top, right, width, height)
-        : setTransform(top, Number(left), width, height);
-    }
+    if(this.useCssTransforms) {}
     return this.resolvedIsMirrored && right !== undefined
       ? setTopRight(top, right, width, height)
killedBy: GridItemComponent Should compute the correct left/top/width/height for an item at the grid's own origin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(10px,10px, 0)"
Received: undefined

[Killed] EqualityOperator
src/lib/grid-item.component.ts:1437:41
     }
 
     if(this.useCssTransforms) {
-      return this.resolvedIsMirrored && right !== undefined
+      return this.resolvedIsMirrored && right === undefined
         ? setTransformRtl(top, right, width, height)
         : setTransform(top, Number(left), width, height);
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should position via right (not left) when isMirrored is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(-1018px,10px, 0)"
Received: "translate3d(NaNpx,10px, 0)"

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1437:14
     }
 
     if(this.useCssTransforms) {
-      return this.resolvedIsMirrored && right !== undefined
+      return false
         ? setTransformRtl(top, right, width, height)
         : setTransform(top, Number(left), width, height);
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should position via right (not left) when isMirrored is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "translate3d(-1018px,10px, 0)"
Received: "translate3d(NaNpx,10px, 0)"

[Killed] ConditionalExpression
src/lib/grid-item.component.ts:1441:12
         ? setTransformRtl(top, right, width, height)
         : setTransform(top, Number(left), width, height);
     }
-    return this.resolvedIsMirrored && right !== undefined
+    return false
       ? setTopRight(top, right, width, height)
       : setTopLeft(top, Number(left), width, height);
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should use the right CSS property (not a transform) when isMirrored is true and useCssTransforms is fal
statusReason: Error: expect(received).toBeUndefined()

Received: "NaNpx"

[Killed] EqualityOperator
src/lib/grid-item.component.ts:1441:39
         ? setTransformRtl(top, right, width, height)
         : setTransform(top, Number(left), width, height);
     }
-    return this.resolvedIsMirrored && right !== undefined
+    return this.resolvedIsMirrored && right === undefined
       ? setTopRight(top, right, width, height)
       : setTopLeft(top, Number(left), width, height);
killedBy: GridItemComponent Phase 7 — isMirrored / zIndex / per-item resize-handle overrides / multiSelect Should use the right CSS property (not a transform) when isMirrored is true and useCssTransforms is fal
statusReason: Error: expect(received).toBeUndefined()

Received: "NaNpx"
