[Killed] BlockStatement
src/lib/cross-grid-registry.ts:24:73
 const zones = new Set<ICrossGridZone>();
 
 /** Registers a zone; returns a function that deregisters it (call from `ngOnDestroy`/when `allowCrossGridDrag` toggles off). */
-export function registerCrossGridZone(zone: ICrossGridZone): () => void {
-  zones.add(zone);
-  return () => {
-    zones.delete(zone);
-  };
-}
+export function registerCrossGridZone(zone: ICrossGridZone): () => void {}
 
 /**
killedBy: GridLayoutComponent Phase 8 — allowCrossGridDrag Should remove the dragged item from the source grid and add it to the target grid's own layout, when dropped inside the target's own rect
statusReason: Error: expect(received).toBeUndefined()

Received: {"h": 2, "i": "a", "moved": false, "w": 2, "x": 2, "y": 0}

[Killed] ConditionalExpression
src/lib/cross-grid-registry.ts:41:8
  */
 export function findCrossGridZoneAt(x: number, y: number, excludeLayoutId: string): ICrossGridZone | undefined {
   for(const zone of zones) {
-    if(zone.layoutId === excludeLayoutId) {
+    if(true) {
       continue;
     }
killedBy: GridLayoutComponent Phase 8 — allowCrossGridDrag Should remove the dragged item from the source grid and add it to the target grid's own layout, when dropped inside the target's own rect
statusReason: Error: expect(received).toBeUndefined()

Received: {"h": 2, "i": "a", "moved": false, "w": 2, "x": 2, "y": 0}

[Killed] BlockStatement
src/lib/cross-grid-registry.ts:45:15
       continue;
     }
     const rect = zone.getRect();
-    if(!rect) {
-      continue;
-    }
+    if(!rect) {}
     if(x >= rect.left && x <= rect.right && y >= rect.top && y <= rect.bottom) {
       return zone;
killedBy: cross-grid-registry Should skip zones with no measurable rect (getRect returning null)
statusReason: TypeError: Cannot read properties of null (reading 'left')

[Killed] ConditionalExpression
src/lib/cross-grid-registry.ts:48:8
     if(!rect) {
       continue;
     }
-    if(x >= rect.left && x <= rect.right && y >= rect.top && y <= rect.bottom) {
+    if(true && y >= rect.top && y <= rect.bottom) {
       return zone;
     }
killedBy: cross-grid-registry Should find the correct zone among multiple registered zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "right"
Received: "left"
