[Killed] BlockStatement
src/lib/grid-item-close-button.component.ts:35:19
   @Output() readonly removeGridItem = new EventEmitter<string | number>();
 
-  onClick(): void {
-    this.removeGridItem.emit(this.i);
-  }
+  onClick(): void {}
 }
 
killedBy: GridItemCloseButtonComponent Should emit removeGridItem with the configured i when clicked
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "my-item",
- ]
