[Killed] BlockStatement
src/lib/grid-layout-presets.service.ts:40:83
 @Injectable({ providedIn: `root` })
 export class GridLayoutPresetsService {
   /** Serializes `layout` and saves it under `name`, overwriting any existing preset of the same name. A no-op if no `Storage` is available. */
-  savePreset(key: string, name: string, layout: TLayout, storage?: Storage): void {
-    if(!this.resolveStorage(storage)) {
-      return;
-    }
-    const presets = this.readAllPresets(key, storage);
-    presets[name] = serializeLayout(layout);
-    this.writeAllPresets(key, presets, storage);
-  }
+  savePreset(key: string, name: string, layout: TLayout, storage?: Storage): void {}
 
   /**
killedBy: GridLayoutPresetsService Should round-trip a preset through savePreset() then loadPreset()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: null

[Killed] BooleanLiteral
src/lib/grid-layout-presets.service.ts:41:8
 export class GridLayoutPresetsService {
   /** Serializes `layout` and saves it under `name`, overwriting any existing preset of the same name. A no-op if no `Storage` is available. */
   savePreset(key: string, name: string, layout: TLayout, storage?: Storage): void {
-    if(!this.resolveStorage(storage)) {
+    if(this.resolveStorage(storage)) {
       return;
     }
killedBy: GridLayoutPresetsService Should round-trip a preset through savePreset() then loadPreset()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: null

[Killed] ConditionalExpression
src/lib/grid-layout-presets.service.ts:41:8
 export class GridLayoutPresetsService {
   /** Serializes `layout` and saves it under `name`, overwriting any existing preset of the same name. A no-op if no `Storage` is available. */
   savePreset(key: string, name: string, layout: TLayout, storage?: Storage): void {
-    if(!this.resolveStorage(storage)) {
+    if(true) {
       return;
     }
killedBy: GridLayoutPresetsService Should round-trip a preset through savePreset() then loadPreset()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: null

[Killed] BlockStatement
src/lib/grid-layout-presets.service.ts:55:76
    * the same "nothing usable was there" convention `load()` on
    * `GridLayoutStorageService` uses, rather than throwing.
    */
-  loadPreset(key: string, name: string, storage?: Storage): TLayout | null {
-    const presets = this.readAllPresets(key, storage);
-    const raw = presets[name];
-    if(!raw) {
-      return null;
-    }
-    return deserializeLayout(raw);
-  }
+  loadPreset(key: string, name: string, storage?: Storage): TLayout | null {}
 
   /** Removes the preset saved under `name`. A no-op if it doesn't exist, or no `Storage` is available. */
killedBy: GridLayoutPresetsService Should round-trip a preset through savePreset() then loadPreset()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: undefined

[Killed] BlockStatement
src/lib/grid-layout-presets.service.ts:65:68
   }
 
   /** Removes the preset saved under `name`. A no-op if it doesn't exist, or no `Storage` is available. */
-  deletePreset(key: string, name: string, storage?: Storage): void {
-    if(!this.resolveStorage(storage)) {
-      return;
-    }
-    const presets = this.readAllPresets(key, storage);
-    delete presets[name];
-    this.writeAllPresets(key, presets, storage);
-  }
+  deletePreset(key: string, name: string, storage?: Storage): void {}
 
   /** Every currently-saved preset name under `key`, in the order they were first saved. */
killedBy: GridLayoutPresetsService Should remove just the named preset via deletePreset(), leaving others intact
statusReason: Error: expect(received).toBeNull()

Received: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]

[Killed] BooleanLiteral
src/lib/grid-layout-presets.service.ts:66:8
 
   /** Removes the preset saved under `name`. A no-op if it doesn't exist, or no `Storage` is available. */
   deletePreset(key: string, name: string, storage?: Storage): void {
-    if(!this.resolveStorage(storage)) {
+    if(this.resolveStorage(storage)) {
       return;
     }
killedBy: GridLayoutPresetsService Should remove just the named preset via deletePreset(), leaving others intact
statusReason: Error: expect(received).toBeNull()

Received: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]

[Killed] ConditionalExpression
src/lib/grid-layout-presets.service.ts:66:8
 
   /** Removes the preset saved under `name`. A no-op if it doesn't exist, or no `Storage` is available. */
   deletePreset(key: string, name: string, storage?: Storage): void {
-    if(!this.resolveStorage(storage)) {
+    if(true) {
       return;
     }
killedBy: GridLayoutPresetsService Should remove just the named preset via deletePreset(), leaving others intact
statusReason: Error: expect(received).toBeNull()

Received: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]

[Killed] BlockStatement
src/lib/grid-layout-presets.service.ts:75:57
   }
 
   /** Every currently-saved preset name under `key`, in the order they were first saved. */
-  listPresets(key: string, storage?: Storage): string[] {
-    return Object.keys(this.readAllPresets(key, storage));
-  }
+  listPresets(key: string, storage?: Storage): string[] {}
 
   /** Whether a preset exists under `name`. */
killedBy: GridLayoutPresetsService Should list every saved preset name via listPresets()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["compact", "detailed"]
Received: undefined

[Killed] BlockStatement
src/lib/grid-layout-presets.service.ts:80:68
   }
 
   /** Whether a preset exists under `name`. */
-  hasPreset(key: string, name: string, storage?: Storage): boolean {
-    return name in this.readAllPresets(key, storage);
-  }
+  hasPreset(key: string, name: string, storage?: Storage): boolean {}
 
   private resolveStorage(storage?: Storage): Storage | null {
killedBy: GridLayoutPresetsService Should report hasPreset() correctly before and after savePreset()
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/lib/grid-layout-presets.service.ts:84:61
     return name in this.readAllPresets(key, storage);
   }
 
-  private resolveStorage(storage?: Storage): Storage | null {
-    if(storage) {
-      return storage;
-    }
-    return hasWindow() ? window.localStorage : null;
-  }
+  private resolveStorage(storage?: Storage): Storage | null {}
 
   private readAllPresets(key: string, storage?: Storage): Record<string, string> {
killedBy: GridLayoutPresetsService Should round-trip a preset through savePreset() then loadPreset()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: null

[Killed] ConditionalExpression
src/lib/grid-layout-presets.service.ts:85:8
   }
 
   private resolveStorage(storage?: Storage): Storage | null {
-    if(storage) {
+    if(true) {
       return storage;
     }
killedBy: GridLayoutPresetsService Should fall back to the real window.localStorage when no explicit storage argument is given at all
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: null

[Killed] ConditionalExpression
src/lib/grid-layout-presets.service.ts:85:8
   }
 
   private resolveStorage(storage?: Storage): Storage | null {
-    if(storage) {
+    if(false) {
       return storage;
     }
killedBy: GridLayoutPresetsService Should list every saved preset name via listPresets()
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "compact",
    "detailed",

[Killed] BlockStatement
src/lib/grid-layout-presets.service.ts:91:82
     return hasWindow() ? window.localStorage : null;
   }
 
-  private readAllPresets(key: string, storage?: Storage): Record<string, string> {
-    const target = this.resolveStorage(storage);
-    if(!target) {
-      return {};
-    }
-    const raw = target.getItem(key);
-    if(!raw) {
-      return {};
-    }
-    try {
-      const parsed: unknown = JSON.parse(raw);
-      if(parsed && typeof parsed === `object` && !Array.isArray(parsed)) {
-        return parsed as Record<string, string>;
-      }
-      return {};
-    } catch{
-      return {};
-    }
-  }
+  private readAllPresets(key: string, storage?: Storage): Record<string, string> {}
 
   private writeAllPresets(key: string, presets: Record<string, string>, storage?: Storage): void {
killedBy: GridLayoutPresetsService Should round-trip a preset through savePreset() then loadPreset()
statusReason: TypeError: Cannot set properties of undefined (setting 'compact')

[Killed] BooleanLiteral
src/lib/grid-layout-presets.service.ts:93:8
 
   private readAllPresets(key: string, storage?: Storage): Record<string, string> {
     const target = this.resolveStorage(storage);
-    if(!target) {
+    if(target) {
       return {};
     }
killedBy: GridLayoutPresetsService Should round-trip a preset through savePreset() then loadPreset()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: null

[Killed] ConditionalExpression
src/lib/grid-layout-presets.service.ts:93:8
 
   private readAllPresets(key: string, storage?: Storage): Record<string, string> {
     const target = this.resolveStorage(storage);
-    if(!target) {
+    if(false) {
       return {};
     }
killedBy: GridLayoutPresetsService Should not throw when no storage is available at all (SSR) and should no-op gracefully
statusReason: TypeError: Cannot read properties of null (reading 'getItem')

[Killed] LogicalOperator
src/lib/grid-layout-presets.service.ts:102:10
     }
     try {
       const parsed: unknown = JSON.parse(raw);
-      if(parsed && typeof parsed === `object` && !Array.isArray(parsed)) {
+      if(parsed && typeof parsed === `object` || !Array.isArray(parsed)) {
         return parsed as Record<string, string>;
       }
killedBy: GridLayoutPresetsService Should treat stored data that parses to valid JSON but isn't a plain object (e.g. an array) as if nothing were stored at all
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 5

- Array []
+ Array [
+   "0",

[Killed] BooleanLiteral
src/lib/grid-layout-presets.service.ts:102:50
     }
     try {
       const parsed: unknown = JSON.parse(raw);
-      if(parsed && typeof parsed === `object` && !Array.isArray(parsed)) {
+      if(parsed && typeof parsed === `object` && Array.isArray(parsed)) {
         return parsed as Record<string, string>;
       }
killedBy: GridLayoutPresetsService Should round-trip a preset through savePreset() then loadPreset()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: null

[Killed] BlockStatement
src/lib/grid-layout-presets.service.ts:111:98
     }
   }
 
-  private writeAllPresets(key: string, presets: Record<string, string>, storage?: Storage): void {
-    this.resolveStorage(storage)?.setItem(key, JSON.stringify(presets));
-  }
+  private writeAllPresets(key: string, presets: Record<string, string>, storage?: Storage): void {}
 }
 
killedBy: GridLayoutPresetsService Should round-trip a preset through savePreset() then loadPreset()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: null

[Survived] OptionalChaining
src/lib/grid-layout-presets.service.ts:112:5
   }
 
   private writeAllPresets(key: string, presets: Record<string, string>, storage?: Storage): void {
-    this.resolveStorage(storage)?.setItem(key, JSON.stringify(presets));
+    this.resolveStorage(storage).setItem(key, JSON.stringify(presets));
   }
 }
