[Killed] ArrowFunction
src/lib/grid-layout-storage.service.ts:5:19
 import { deserializeLayout, serializeLayout } from '@keystone-dashboard-layout/core';
 import type { TLayout } from '@keystone-dashboard-layout/core';
 
-const hasWindow = (): boolean => typeof window !== `undefined`;
+const hasWindow = () => undefined;
 
 /**
killedBy: GridLayoutStorageService Should default to window.localStorage when no explicit storage is passed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: null

[Killed] BlockStatement
src/lib/grid-layout-storage.service.ts:49:63
 @Injectable({ providedIn: `root` })
 export class GridLayoutStorageService {
-  save(key: string, layout: TLayout, storage?: Storage): void {
-    const target = this.resolveStorage(storage);
-    if(!target) {
-      return;
-    }
-    target.setItem(key, serializeLayout(layout));
-  }
+  save(key: string, layout: TLayout, storage?: Storage): void {}
 
   /**
killedBy: GridLayoutStorageService Should round-trip a layout through save() then load()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: null

[Killed] ConditionalExpression
src/lib/grid-layout-storage.service.ts:51:8
   save(key: string, layout: TLayout, storage?: Storage): void {
     const target = this.resolveStorage(storage);
-    if(!target) {
+    if(true) {
       return;
     }
killedBy: GridLayoutStorageService Should round-trip a layout through save() then load()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: null

[Killed] BlockStatement
src/lib/grid-layout-storage.service.ts:65:56
    * convention `deserializeLayout` itself already establishes, not a
    * separately-maintained set of checks.
    */
-  load(key: string, storage?: Storage): TLayout | null {
-    const target = this.resolveStorage(storage);
-    if(!target) {
-      return null;
-    }
-    return deserializeLayout(target.getItem(key));
-  }
+  load(key: string, storage?: Storage): TLayout | null {}
 
   /** Removes `key` from storage entirely. A no-op if no `Storage` is available, or nothing was stored under `key` in the first place. */
killedBy: GridLayoutStorageService Should round-trip a layout through save() then load()
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]
Received: undefined

[Killed] BlockStatement
src/lib/grid-layout-storage.service.ts:74:47
   }
 
   /** Removes `key` from storage entirely. A no-op if no `Storage` is available, or nothing was stored under `key` in the first place. */
-  clear(key: string, storage?: Storage): void {
-    this.resolveStorage(storage)?.removeItem(key);
-  }
+  clear(key: string, storage?: Storage): void {}
 
   /** Whether storage currently holds *anything* under `key` — not whether it's valid; call `load()` and check for `null` to confirm that. */
killedBy: GridLayoutStorageService Should remove the stored value via clear()
statusReason: Error: expect(received).toBeNull()

Received: [{"h": 2, "i": "0", "w": 2, "x": 0, "y": 0}]

[Killed] OptionalChaining
src/lib/grid-layout-storage.service.ts:75:5
 
   /** Removes `key` from storage entirely. A no-op if no `Storage` is available, or nothing was stored under `key` in the first place. */
   clear(key: string, storage?: Storage): void {
-    this.resolveStorage(storage)?.removeItem(key);
+    this.resolveStorage(storage).removeItem(key);
   }
 
killedBy: GridLayoutStorageService Should not throw when no storage is available at all (SSR) and should no-op gracefully
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'removeItem')"

      148 |     } else {
      149 |       stryCov_9fa48("836");
    > 150 |       stryMutAct_9fa48("837") ? this.resolveStorage(storage).removeItem(key) : (stryCov_9fa48("837"), this.resolveStorage(storage)?.removeItem(key));

[Killed] BlockStatement
src/lib/grid-layout-storage.service.ts:79:53
   }
 
   /** Whether storage currently holds *anything* under `key` — not whether it's valid; call `load()` and check for `null` to confirm that. */
-  hasSaved(key: string, storage?: Storage): boolean {
-    const target = this.resolveStorage(storage);
-    return target !== null && target.getItem(key) !== null;
-  }
+  hasSaved(key: string, storage?: Storage): boolean {}
 
   private resolveStorage(storage?: Storage): Storage | null {
killedBy: GridLayoutStorageService Should report hasSaved() correctly before and after save()
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] EqualityOperator
src/lib/grid-layout-storage.service.ts:81:31
   /** Whether storage currently holds *anything* under `key` — not whether it's valid; call `load()` and check for `null` to confirm that. */
   hasSaved(key: string, storage?: Storage): boolean {
     const target = this.resolveStorage(storage);
-    return target !== null && target.getItem(key) !== null;
+    return target !== null && target.getItem(key) === null;
   }
 
killedBy: GridLayoutStorageService Should report hasSaved() correctly before and after save()
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lib/grid-layout-storage.service.ts:81:31
   /** Whether storage currently holds *anything* under `key` — not whether it's valid; call `load()` and check for `null` to confirm that. */
   hasSaved(key: string, storage?: Storage): boolean {
     const target = this.resolveStorage(storage);
-    return target !== null && target.getItem(key) !== null;
+    return target !== null && true;
   }
 
killedBy: GridLayoutStorageService Should report hasSaved() correctly before and after save()
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
