[Killed] StringLiteral
src/helpers/utils.ts:52:77
  * or contain, are never touched by this transformation regardless of
  * their value.
  */
-const INFINITY_SENTINEL_KEYS = new Set([`h`, `w`, `x`, `y`, `minH`, `minW`, `maxH`, `maxW`, `zIndex`, `borderRadiusPx`]);
+const INFINITY_SENTINEL_KEYS = new Set([`h`, `w`, `x`, `y`, `minH`, `minW`, ``, `maxW`, `zIndex`, `borderRadiusPx`]);
 const INFINITY_SENTINEL = `\uE000Infinity\uE000`;
 const NEGATIVE_INFINITY_SENTINEL = `\uE000-Infinity\uE000`;
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected null to be Infinity // Object.is equality

[Survived] StringLiteral
src/helpers/utils.ts:52:51
  * or contain, are never touched by this transformation regardless of
  * their value.
  */
-const INFINITY_SENTINEL_KEYS = new Set([`h`, `w`, `x`, `y`, `minH`, `minW`, `maxH`, `maxW`, `zIndex`, `borderRadiusPx`]);
+const INFINITY_SENTINEL_KEYS = new Set([`h`, `w`, ``, `y`, `minH`, `minW`, `maxH`, `maxW`, `zIndex`, `borderRadiusPx`]);
 const INFINITY_SENTINEL = `\uE000Infinity\uE000`;
 const NEGATIVE_INFINITY_SENTINEL = `\uE000-Infinity\uE000`;

[Killed] BlockStatement
src/helpers/utils.ts:57:68
 const NEGATIVE_INFINITY_SENTINEL = `\uE000-Infinity\uE000`;
 const NAN_SENTINEL = `\uE000NaN\uE000`;
 
-function cloneLayoutReplacer(key: string, value: unknown): unknown {
-  if(INFINITY_SENTINEL_KEYS.has(key) && typeof value === `number`) {
-    if(value === Infinity) {
-      return INFINITY_SENTINEL;
-    }
-    if(value === -Infinity) {
-      return NEGATIVE_INFINITY_SENTINEL;
-    }
-    if(Number.isNaN(value)) {
-      return NAN_SENTINEL;
-    }
-  }
-  return value;
-}
+function cloneLayoutReplacer(key: string, value: unknown): unknown {}
 
 function cloneLayoutReviver(key: string, value: unknown): unknown {
killedBy: findOrGenerateResponsiveLayout Should clone, bounds-correct and compact the original layout for the new breakpoint
statusReason: "undefined" is not valid JSON

[Killed] EqualityOperator
src/helpers/utils.ts:58:41
 const NAN_SENTINEL = `\uE000NaN\uE000`;
 
 function cloneLayoutReplacer(key: string, value: unknown): unknown {
-  if(INFINITY_SENTINEL_KEYS.has(key) && typeof value === `number`) {
+  if(INFINITY_SENTINEL_KEYS.has(key) && typeof value !== `number`) {
     if(value === Infinity) {
       return INFINITY_SENTINEL;
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected null to be Infinity // Object.is equality

[Killed] BlockStatement
src/helpers/utils.ts:58:68
 const NAN_SENTINEL = `\uE000NaN\uE000`;
 
 function cloneLayoutReplacer(key: string, value: unknown): unknown {
-  if(INFINITY_SENTINEL_KEYS.has(key) && typeof value === `number`) {
-    if(value === Infinity) {
-      return INFINITY_SENTINEL;
-    }
-    if(value === -Infinity) {
-      return NEGATIVE_INFINITY_SENTINEL;
-    }
-    if(Number.isNaN(value)) {
-      return NAN_SENTINEL;
-    }
-  }
+  if(INFINITY_SENTINEL_KEYS.has(key) && typeof value === `number`) {}
   return value;
 }
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected null to be Infinity // Object.is equality

[Killed] ConditionalExpression
src/helpers/utils.ts:59:8
 
 function cloneLayoutReplacer(key: string, value: unknown): unknown {
   if(INFINITY_SENTINEL_KEYS.has(key) && typeof value === `number`) {
-    if(value === Infinity) {
+    if(true) {
       return INFINITY_SENTINEL;
     }
killedBy: cloneLayoutItem Should return exact copy of layout item
statusReason: expected { Object (i, h, ...) } to strictly equal { i: 2, h: 1, w: 2, x: 1, y: +0 }

[Killed] BlockStatement
src/helpers/utils.ts:59:28
 
 function cloneLayoutReplacer(key: string, value: unknown): unknown {
   if(INFINITY_SENTINEL_KEYS.has(key) && typeof value === `number`) {
-    if(value === Infinity) {
-      return INFINITY_SENTINEL;
-    }
+    if(value === Infinity) {}
     if(value === -Infinity) {
       return NEGATIVE_INFINITY_SENTINEL;
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected null to be Infinity // Object.is equality

[Killed] BlockStatement
src/helpers/utils.ts:62:29
     if(value === Infinity) {
       return INFINITY_SENTINEL;
     }
-    if(value === -Infinity) {
-      return NEGATIVE_INFINITY_SENTINEL;
-    }
+    if(value === -Infinity) {}
     if(Number.isNaN(value)) {
       return NAN_SENTINEL;
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected null to be -Infinity // Object.is equality

[Killed] EqualityOperator
src/helpers/utils.ts:62:8
     if(value === Infinity) {
       return INFINITY_SENTINEL;
     }
-    if(value === -Infinity) {
+    if(value !== -Infinity) {
       return NEGATIVE_INFINITY_SENTINEL;
     }
killedBy: cloneLayoutItem Should return exact copy of layout item
statusReason: expected { i: 2, h: -Infinity, …(3) } to strictly equal { i: 2, h: 1, w: 2, x: 1, y: +0 }

[Killed] ConditionalExpression
src/helpers/utils.ts:65:8
     if(value === -Infinity) {
       return NEGATIVE_INFINITY_SENTINEL;
     }
-    if(Number.isNaN(value)) {
+    if(false) {
       return NAN_SENTINEL;
     }
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/helpers/utils.ts:65:8
     if(value === -Infinity) {
       return NEGATIVE_INFINITY_SENTINEL;
     }
-    if(Number.isNaN(value)) {
+    if(true) {
       return NAN_SENTINEL;
     }
killedBy: cloneLayoutItem Should return exact copy of layout item
statusReason: expected { Object (i, h, ...) } to strictly equal { i: 2, h: 1, w: 2, x: 1, y: +0 }

[Killed] BlockStatement
src/helpers/utils.ts:72:67
   return value;
 }
 
-function cloneLayoutReviver(key: string, value: unknown): unknown {
-  if(INFINITY_SENTINEL_KEYS.has(key)) {
-    if(value === INFINITY_SENTINEL) {
-      return Infinity;
-    }
-    if(value === NEGATIVE_INFINITY_SENTINEL) {
-      return -Infinity;
-    }
-    if(value === NAN_SENTINEL) {
-      return NaN;
-    }
-  }
-  return value;
-}
+function cloneLayoutReviver(key: string, value: unknown): unknown {}
 
 /**
killedBy: cloneLayoutItem Should return exact copy of layout item
statusReason: expected undefined to strictly equal { i: 2, h: 1, w: 2, x: 1, y: +0 }

[Killed] ConditionalExpression
src/helpers/utils.ts:73:6
 }
 
 function cloneLayoutReviver(key: string, value: unknown): unknown {
-  if(INFINITY_SENTINEL_KEYS.has(key)) {
+  if(false) {
     if(value === INFINITY_SENTINEL) {
       return Infinity;
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected 'Infinity' to be Infinity // Object.is equality

[Killed] BlockStatement
src/helpers/utils.ts:73:39
 }
 
 function cloneLayoutReviver(key: string, value: unknown): unknown {
-  if(INFINITY_SENTINEL_KEYS.has(key)) {
-    if(value === INFINITY_SENTINEL) {
-      return Infinity;
-    }
-    if(value === NEGATIVE_INFINITY_SENTINEL) {
-      return -Infinity;
-    }
-    if(value === NAN_SENTINEL) {
-      return NaN;
-    }
-  }
+  if(INFINITY_SENTINEL_KEYS.has(key)) {}
   return value;
 }
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected 'Infinity' to be Infinity // Object.is equality

[Killed] BlockStatement
src/helpers/utils.ts:74:37
 
 function cloneLayoutReviver(key: string, value: unknown): unknown {
   if(INFINITY_SENTINEL_KEYS.has(key)) {
-    if(value === INFINITY_SENTINEL) {
-      return Infinity;
-    }
+    if(value === INFINITY_SENTINEL) {}
     if(value === NEGATIVE_INFINITY_SENTINEL) {
       return -Infinity;
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected 'Infinity' to be Infinity // Object.is equality

[Killed] ConditionalExpression
src/helpers/utils.ts:74:8
 
 function cloneLayoutReviver(key: string, value: unknown): unknown {
   if(INFINITY_SENTINEL_KEYS.has(key)) {
-    if(value === INFINITY_SENTINEL) {
+    if(false) {
       return Infinity;
     }
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected 'Infinity' to be Infinity // Object.is equality

[Killed] EqualityOperator
src/helpers/utils.ts:77:8
     if(value === INFINITY_SENTINEL) {
       return Infinity;
     }
-    if(value === NEGATIVE_INFINITY_SENTINEL) {
+    if(value !== NEGATIVE_INFINITY_SENTINEL) {
       return -Infinity;
     }
killedBy: cloneLayoutItem Should return exact copy of layout item
statusReason: expected { i: 2, h: -Infinity, …(3) } to strictly equal { i: 2, h: 1, w: 2, x: 1, y: +0 }

[Killed] ConditionalExpression
src/helpers/utils.ts:77:8
     if(value === INFINITY_SENTINEL) {
       return Infinity;
     }
-    if(value === NEGATIVE_INFINITY_SENTINEL) {
+    if(false) {
       return -Infinity;
     }
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected '-Infinity' to be -Infinity // Object.is equality

[Killed] UnaryOperator
src/helpers/utils.ts:78:14
       return Infinity;
     }
     if(value === NEGATIVE_INFINITY_SENTINEL) {
-      return -Infinity;
+      return +Infinity;
     }
     if(value === NAN_SENTINEL) {
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected Infinity to be -Infinity // Object.is equality

[Killed] EqualityOperator
src/helpers/utils.ts:80:8
     if(value === NEGATIVE_INFINITY_SENTINEL) {
       return -Infinity;
     }
-    if(value === NAN_SENTINEL) {
+    if(value !== NAN_SENTINEL) {
       return NaN;
     }
killedBy: cloneLayoutItem Should return exact copy of layout item
statusReason: expected { Object (i, h, ...) } to strictly equal { i: 2, h: 1, w: 2, x: 1, y: +0 }

[Killed] ConditionalExpression
src/helpers/utils.ts:80:8
     if(value === NEGATIVE_INFINITY_SENTINEL) {
       return -Infinity;
     }
-    if(value === NAN_SENTINEL) {
+    if(false) {
       return NaN;
     }
killedBy: cloneLayoutItem Should preserve Infinity/-Infinity/NaN through the JSON round-trip, not silently corrupt them to null — regression test for a real, confirmed bug
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/helpers/utils.ts:94:71
  * specifically because there's nothing non-serializable (functions,
  * `Date`s, etc.) on an `ILayoutItem` to worry about losing.
  */
-export function cloneLayoutItem(layoutItem: ILayoutItem): ILayoutItem {
-  return JSON.parse(JSON.stringify(layoutItem, cloneLayoutReplacer), cloneLayoutReviver);
-}
+export function cloneLayoutItem(layoutItem: ILayoutItem): ILayoutItem {}
 
killedBy: cloneLayoutItem Should return exact copy of layout item
statusReason: expected undefined to strictly equal { i: 2, h: 1, w: 2, x: 1, y: +0 }

[Killed] BlockStatement
src/helpers/utils.ts:99:55
 }
 
-export function cloneLayout(layout: TLayout): TLayout {
-  const newLayout = Array(layout.length);
-  for(let i = 0, len = layout.length; i < len; i++) {
-    newLayout[i] = cloneLayoutItem(layout[i]);
-  }
-  return newLayout;
-}
+export function cloneLayout(layout: TLayout): TLayout {}
 
 /**
killedBy: cloneLayout Should return exact copy of layout
statusReason: expected undefined to strictly equal [ …(8) ]

[Killed] UpdateOperator
src/helpers/utils.ts:101:48
 export function cloneLayout(layout: TLayout): TLayout {
   const newLayout = Array(layout.length);
-  for(let i = 0, len = layout.length; i < len; i++) {
+  for(let i = 0, len = layout.length; i < len; i--) {
     newLayout[i] = cloneLayoutItem(layout[i]);
   }
killedBy: cloneLayout Should return exact copy of layout
statusReason: "undefined" is not valid JSON

[Killed] EqualityOperator
src/helpers/utils.ts:101:39
 export function cloneLayout(layout: TLayout): TLayout {
   const newLayout = Array(layout.length);
-  for(let i = 0, len = layout.length; i < len; i++) {
+  for(let i = 0, len = layout.length; i >= len; i++) {
     newLayout[i] = cloneLayoutItem(layout[i]);
   }
killedBy: cloneLayout Should return exact copy of layout
statusReason: expected [ undefined, undefined, …(6) ] to strictly equal [ …(8) ]

[Killed] BooleanLiteral
src/helpers/utils.ts:137:6
   // `y` was already equivalent to this clamped one as far as collision
   // detection is concerned (nothing occupies space below the last
   // item's own bottom edge either way).
-  if(!Number.isFinite(layoutItem.y)) {
+  if(Number.isFinite(layoutItem.y)) {
     layoutItem.y = compareWith.reduce((max, item) => Math.max(max, item.y + item.h), 0);
   }
killedBy: compactItem Should respect minPositions instead of moving to 0 when verticalCompact is false
statusReason: expected { i: 'a', x: +0, y: +0, w: 2, h: 1 } to strictly equal { i: 'a', x: +0, y: 3, w: 2, h: 1 }

[Killed] ConditionalExpression
src/helpers/utils.ts:137:6
   // `y` was already equivalent to this clamped one as far as collision
   // detection is concerned (nothing occupies space below the last
   // item's own bottom edge either way).
-  if(!Number.isFinite(layoutItem.y)) {
+  if(true) {
     layoutItem.y = compareWith.reduce((max, item) => Math.max(max, item.y + item.h), 0);
   }
killedBy: compactItem Should respect minPositions instead of moving to 0 when verticalCompact is false
statusReason: expected { i: 'a', x: +0, y: +0, w: 2, h: 1 } to strictly equal { i: 'a', x: +0, y: 3, w: 2, h: 1 }

[Survived] ArithmeticOperator
src/helpers/utils.ts:138:68
   // detection is concerned (nothing occupies space below the last
   // item's own bottom edge either way).
   if(!Number.isFinite(layoutItem.y)) {
-    layoutItem.y = compareWith.reduce((max, item) => Math.max(max, item.y + item.h), 0);
+    layoutItem.y = compareWith.reduce((max, item) => Math.max(max, item.y - item.h), 0);
   }
 

[Survived] ArrowFunction
src/helpers/utils.ts:138:39
   // detection is concerned (nothing occupies space below the last
   // item's own bottom edge either way).
   if(!Number.isFinite(layoutItem.y)) {
-    layoutItem.y = compareWith.reduce((max, item) => Math.max(max, item.y + item.h), 0);
+    layoutItem.y = compareWith.reduce(() => undefined, 0);
   }
 

[Killed] ConditionalExpression
src/helpers/utils.ts:141:6
     layoutItem.y = compareWith.reduce((max, item) => Math.max(max, item.y + item.h), 0);
   }
 
-  if(verticalCompact) {
+  if(false) {
     // Move the element up as far as it can go without colliding.
     // Bug fix: `minPositions` (the `restoreOnDrag` case) was
killedBy: compactItem Should move an item up as far as possible when verticalCompact is true and nothing blocks it
statusReason: expected { i: 'a', x: +0, y: 5, w: 2, h: 1 } to strictly equal { i: 'a', x: +0, y: +0, w: 2, h: 1 }

[Killed] ConditionalExpression
src/helpers/utils.ts:141:6
     layoutItem.y = compareWith.reduce((max, item) => Math.max(max, item.y + item.h), 0);
   }
 
-  if(verticalCompact) {
+  if(true) {
     // Move the element up as far as it can go without colliding.
     // Bug fix: `minPositions` (the `restoreOnDrag` case) was
killedBy: compactor.interface noCompactor Should produce identical results to compactLayout(layout, false) directly
statusReason: expected +0 to be 5 // Object.is equality

[Killed] OptionalChaining
src/helpers/utils.ts:152:18
     // documents `y` as applying to `VERTICAL` too. `?? 0` preserves the
     // exact prior behavior (rise all the way to `0`) whenever no
     // `minPositions` entry exists for this item.
-    const minY = minPositions?.[layoutItem.i]?.y ?? 0;
+    const minY = minPositions[layoutItem.i]?.y ?? 0;
     while (layoutItem.y > minY && !getFirstCollision(compareWith, layoutItem)) {
       layoutItem.y--;
killedBy: compactItem Should move an item up as far as possible when verticalCompact is true and nothing blocks it
statusReason: Cannot read properties of undefined (reading 'a')

[Killed] LogicalOperator
src/helpers/utils.ts:152:18
     // documents `y` as applying to `VERTICAL` too. `?? 0` preserves the
     // exact prior behavior (rise all the way to `0`) whenever no
     // `minPositions` entry exists for this item.
-    const minY = minPositions?.[layoutItem.i]?.y ?? 0;
+    const minY = minPositions?.[layoutItem.i]?.y && 0;
     while (layoutItem.y > minY && !getFirstCollision(compareWith, layoutItem)) {
       layoutItem.y--;
killedBy: compactItem Should move an item up as far as possible when verticalCompact is true and nothing blocks it
statusReason: expected { i: 'a', x: +0, y: 5, w: 2, h: 1 } to strictly equal { i: 'a', x: +0, y: +0, w: 2, h: 1 }

[Killed] BooleanLiteral
src/helpers/utils.ts:153:35
     // exact prior behavior (rise all the way to `0`) whenever no
     // `minPositions` entry exists for this item.
     const minY = minPositions?.[layoutItem.i]?.y ?? 0;
-    while (layoutItem.y > minY && !getFirstCollision(compareWith, layoutItem)) {
+    while (layoutItem.y > minY && getFirstCollision(compareWith, layoutItem)) {
       layoutItem.y--;
     }
killedBy: compactItem Should move an item up as far as possible when verticalCompact is true and nothing blocks it
statusReason: expected { i: 'a', x: +0, y: 5, w: 2, h: 1 } to strictly equal { i: 'a', x: +0, y: +0, w: 2, h: 1 }

[Killed] EqualityOperator
src/helpers/utils.ts:153:12
     // exact prior behavior (rise all the way to `0`) whenever no
     // `minPositions` entry exists for this item.
     const minY = minPositions?.[layoutItem.i]?.y ?? 0;
-    while (layoutItem.y > minY && !getFirstCollision(compareWith, layoutItem)) {
+    while (layoutItem.y <= minY && !getFirstCollision(compareWith, layoutItem)) {
       layoutItem.y--;
     }
killedBy: compactItem Should move an item up as far as possible when verticalCompact is true and nothing blocks it
statusReason: expected { i: 'a', x: +0, y: 5, w: 2, h: 1 } to strictly equal { i: 'a', x: +0, y: +0, w: 2, h: 1 }

[Timeout] UpdateOperator
src/helpers/utils.ts:154:7
     // `minPositions` entry exists for this item.
     const minY = minPositions?.[layoutItem.i]?.y ?? 0;
     while (layoutItem.y > minY && !getFirstCollision(compareWith, layoutItem)) {
-      layoutItem.y--;
+      layoutItem.y++;
     }
   } else if(minPositions) {

[Killed] BlockStatement
src/helpers/utils.ts:156:27
     while (layoutItem.y > minY && !getFirstCollision(compareWith, layoutItem)) {
       layoutItem.y--;
     }
-  } else if(minPositions) {
-    const minY = minPositions[layoutItem.i].y;
-    while (layoutItem.y > minY && !getFirstCollision(compareWith, layoutItem)) {
-      layoutItem.y--;
-    }
-  }
+  } else if(minPositions) {}
 
   // Move it down, and keep moving it down if it's colliding.
killedBy: compactor.interface noCompactor Should pass context.minPositions through to compactLayout, matching restoreOnDrag's own behavior
statusReason: expected 8 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/helpers/utils.ts:156:13
     while (layoutItem.y > minY && !getFirstCollision(compareWith, layoutItem)) {
       layoutItem.y--;
     }
-  } else if(minPositions) {
+  } else if(false) {
     const minY = minPositions[layoutItem.i].y;
     while (layoutItem.y > minY && !getFirstCollision(compareWith, layoutItem)) {
killedBy: compactItem Should respect minPositions instead of moving to 0 when verticalCompact is false
statusReason: expected { i: 'a', x: +0, y: 5, w: 2, h: 1 } to strictly equal { i: 'a', x: +0, y: 3, w: 2, h: 1 }

[Killed] BooleanLiteral
src/helpers/utils.ts:158:35
     }
   } else if(minPositions) {
     const minY = minPositions[layoutItem.i].y;
-    while (layoutItem.y > minY && !getFirstCollision(compareWith, layoutItem)) {
+    while (layoutItem.y > minY && getFirstCollision(compareWith, layoutItem)) {
       layoutItem.y--;
     }
killedBy: compactItem Should respect minPositions instead of moving to 0 when verticalCompact is false
statusReason: expected { i: 'a', x: +0, y: 5, w: 2, h: 1 } to strictly equal { i: 'a', x: +0, y: 3, w: 2, h: 1 }

[Killed] EqualityOperator
src/helpers/utils.ts:158:12
     }
   } else if(minPositions) {
     const minY = minPositions[layoutItem.i].y;
-    while (layoutItem.y > minY && !getFirstCollision(compareWith, layoutItem)) {
+    while (layoutItem.y <= minY && !getFirstCollision(compareWith, layoutItem)) {
       layoutItem.y--;
     }
killedBy: compactor.interface noCompactor Should pass context.minPositions through to compactLayout, matching restoreOnDrag's own behavior
statusReason: expected 8 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/helpers/utils.ts:166:11
   // Move it down, and keep moving it down if it's colliding.
   let collisions;
 
-  while ((collisions = getFirstCollision(compareWith, layoutItem))) {
+  while ((false)) {
     layoutItem.y = collisions.y + collisions.h;
   }
killedBy: compactor.interface noCompactor Should still resolve an actual collision by pushing down, not leave items overlapping
statusReason: expected 1 to be greater than or equal to 4

[Timeout] BlockStatement
src/helpers/utils.ts:166:69
   // Move it down, and keep moving it down if it's colliding.
   let collisions;
 
-  while ((collisions = getFirstCollision(compareWith, layoutItem))) {
-    layoutItem.y = collisions.y + collisions.h;
-  }
+  while ((collisions = getFirstCollision(compareWith, layoutItem))) {}
   return layoutItem;
 }

[Killed] ArithmeticOperator
src/helpers/utils.ts:167:20
   let collisions;
 
   while ((collisions = getFirstCollision(compareWith, layoutItem))) {
-    layoutItem.y = collisions.y + collisions.h;
+    layoutItem.y = collisions.y - collisions.h;
   }
   return layoutItem;
killedBy: compactItem Should stop moving up when it would collide with another item
statusReason: expected { i: 'a', x: +0, y: +0, w: 2, h: 1 } to strictly equal { i: 'a', x: +0, y: 2, w: 2, h: 1 }

[Killed] UpdateOperator
src/helpers/utils.ts:193:48
   // Holding for new items.
   const out: TLayout = Array(layout.length);
 
-  for(let i = 0, len = sorted.length; i < len; i++) {
+  for(let i = 0, len = sorted.length; i < len; i--) {
     let l = sorted[i];
 
killedBy: compactLayout Should compact all non-static items upward, leaving static items in place
statusReason: Cannot read properties of undefined (reading 'isStatic')

[Killed] EqualityOperator
src/helpers/utils.ts:193:39
   // Holding for new items.
   const out: TLayout = Array(layout.length);
 
-  for(let i = 0, len = sorted.length; i < len; i++) {
+  for(let i = 0, len = sorted.length; i >= len; i++) {
     let l = sorted[i];
 
killedBy: compactor.interface verticalCompactor Should produce identical results to compactLayout(layout, true) directly
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] BlockStatement
src/helpers/utils.ts:197:21
     let l = sorted[i];
 
     // Don't move static elements
-    if(!l.isStatic) {
-      l = compactItem(compareWith, l, verticalCompact, minPositions);
-
-      // Add to comparison array. We only collide with items before this one.
-      // Statics are already in this array.
-      compareWith.push(l);
-    }
+    if(!l.isStatic) {}
 
     // Add to output array to make sure they still come out in the right order.
killedBy: compactLayout Should compact all non-static items upward, leaving static items in place
statusReason: expected [ { i: 'static', x: +0, …(5) }, …(1) ] to strictly equal [ { i: 'static', x: +0, …(5) }, …(1) ]

[Killed] BooleanLiteral
src/helpers/utils.ts:197:8
     let l = sorted[i];
 
     // Don't move static elements
-    if(!l.isStatic) {
+    if(l.isStatic) {
       l = compactItem(compareWith, l, verticalCompact, minPositions);
 
killedBy: compactor.interface verticalCompactor Should produce identical results to compactLayout(layout, true) directly
statusReason: expected 5 to be less than 5

[Killed] BooleanLiteral
src/helpers/utils.ts:209:15
     out[layout.indexOf(l)] = l;
 
     // Clear moved flag, if it exists.
-    l.moved = false;
+    l.moved = true;
   }
   return out;
killedBy: compactLayout Should compact all non-static items upward, leaving static items in place
statusReason: expected [ { i: 'static', x: +0, …(5) }, …(1) ] to strictly equal [ { i: 'static', x: +0, …(5) }, …(1) ]

[Killed] ConditionalExpression
src/helpers/utils.ts:235:6
   // transposed to the x axis) would infinite-loop the decrement below
   // for the identical reason (`Infinity - 1 === Infinity`). Clamped the
   // same way: one column past everything already in `compareWith`.
-  if(!Number.isFinite(layoutItem.x)) {
+  if(true) {
     layoutItem.x = compareWith.reduce((max, item) => Math.max(max, item.x + item.w), 0);
   }
killedBy: compactItemHorizontal Should respect minPositions (minimum x) instead of moving to 0 when horizontalCompact is false
statusReason: expected { i: 'a', x: +0, y: +0, w: 1, h: 2 } to strictly equal { i: 'a', x: 3, y: +0, w: 1, h: 2 }

[Killed] BooleanLiteral
src/helpers/utils.ts:235:6
   // transposed to the x axis) would infinite-loop the decrement below
   // for the identical reason (`Infinity - 1 === Infinity`). Clamped the
   // same way: one column past everything already in `compareWith`.
-  if(!Number.isFinite(layoutItem.x)) {
+  if(Number.isFinite(layoutItem.x)) {
     layoutItem.x = compareWith.reduce((max, item) => Math.max(max, item.x + item.w), 0);
   }
killedBy: compactItemHorizontal Should respect minPositions (minimum x) instead of moving to 0 when horizontalCompact is false
statusReason: expected { i: 'a', x: +0, y: +0, w: 1, h: 2 } to strictly equal { i: 'a', x: 3, y: +0, w: 1, h: 2 }

[NoCoverage] MethodExpression
src/helpers/utils.ts:236:54
   // for the identical reason (`Infinity - 1 === Infinity`). Clamped the
   // same way: one column past everything already in `compareWith`.
   if(!Number.isFinite(layoutItem.x)) {
-    layoutItem.x = compareWith.reduce((max, item) => Math.max(max, item.x + item.w), 0);
+    layoutItem.x = compareWith.reduce((max, item) => Math.min(max, item.x + item.w), 0);
   }
 

[NoCoverage] ArithmeticOperator
src/helpers/utils.ts:236:68
   // for the identical reason (`Infinity - 1 === Infinity`). Clamped the
   // same way: one column past everything already in `compareWith`.
   if(!Number.isFinite(layoutItem.x)) {
-    layoutItem.x = compareWith.reduce((max, item) => Math.max(max, item.x + item.w), 0);
+    layoutItem.x = compareWith.reduce((max, item) => Math.max(max, item.x - item.w), 0);
   }
 

[Killed] ConditionalExpression
src/helpers/utils.ts:239:6
     layoutItem.x = compareWith.reduce((max, item) => Math.max(max, item.x + item.w), 0);
   }
 
-  if(horizontalCompact) {
+  if(true) {
     // Move the element left as far as it can go without colliding.
     // Bug fix: same class of bug as `compactItem`'s own fix above (see
killedBy: compactItemHorizontal Should not attempt any leftward movement at all when horizontalCompact is false and no minPositions is given
statusReason: expected { i: 'a', x: +0, y: +0, w: 1, h: 2 } to strictly equal { i: 'a', x: 5, y: +0, w: 1, h: 2 }

[Killed] ConditionalExpression
src/helpers/utils.ts:239:6
     layoutItem.x = compareWith.reduce((max, item) => Math.max(max, item.x + item.w), 0);
   }
 
-  if(horizontalCompact) {
+  if(false) {
     // Move the element left as far as it can go without colliding.
     // Bug fix: same class of bug as `compactItem`'s own fix above (see
killedBy: compactItemHorizontal Should move an item left as far as possible when horizontalCompact is true and nothing blocks it
statusReason: expected { i: 'a', x: 5, y: +0, w: 1, h: 2 } to strictly equal { i: 'a', x: +0, y: +0, w: 1, h: 2 }

[Killed] OptionalChaining
src/helpers/utils.ts:246:18
     // previously only consulted in the `else if` branch below, meaning
     // `restoreOnDrag` silently had no effect under `ECompactType.
     // HORIZONTAL` (`horizontalCompact: true`).
-    const minX = minPositions?.[layoutItem.i]?.x ?? 0;
+    const minX = minPositions[layoutItem.i]?.x ?? 0;
     while (layoutItem.x > minX && !getFirstCollision(compareWith, layoutItem)) {
       layoutItem.x--;
killedBy: compactor.interface horizontalCompactor Should produce identical results to compactLayoutHorizontal(layout, true) directly
statusReason: Cannot read properties of undefined (reading '0')
