[Killed] BlockStatement
src/common/helpers/grid-item-type-helpers.ts:9:71
  * @return {Array}        Array of static layout items — `[]` for an empty layout (see docs/REFACTORING.md #9/#33: an empty layout is a normal state, not an error).
  */
 
-export function getAllStaticGridItems(layout: TLayout): ILayoutItem[] {
-  return layout.filter(l => l.isStatic);
-}
+export function getAllStaticGridItems(layout: TLayout): ILayoutItem[] {}
 
 /**
killedBy: compactor.interface verticalCompactor Should produce identical results to compactLayout(layout, true) directly
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArrowFunction
src/common/helpers/grid-item-type-helpers.ts:10:24
  */
 
 export function getAllStaticGridItems(layout: TLayout): ILayoutItem[] {
-  return layout.filter(l => l.isStatic);
+  return layout.filter(() => undefined);
 }
 
killedBy: getAllStaticGridItems Should return one item from testLayout
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
src/common/helpers/grid-item-type-helpers.ts:10:10
  */
 
 export function getAllStaticGridItems(layout: TLayout): ILayoutItem[] {
-  return layout.filter(l => l.isStatic);
+  return layout;
 }
 
killedBy: compactor.interface noCompactor Should still resolve an actual collision by pushing down, not leave items overlapping
statusReason: expected 1 to be greater than or equal to 4

[Killed] BlockStatement
src/common/helpers/grid-item-type-helpers.ts:21:74
  * @return {Array}        Array of non-static layout items — `[]` for an empty layout.
  */
 
-export function getAllNonStaticGridItems(layout: TLayout): ILayoutItem[] {
-  return layout.filter(l => !l.isStatic);
-}
+export function getAllNonStaticGridItems(layout: TLayout): ILayoutItem[] {}
 
killedBy: getAllNonStaticGridItems Should return an empty array (not throw) when an empty layout is passed
statusReason: expected undefined to strictly equal []

[Killed] ArrowFunction
src/common/helpers/grid-item-type-helpers.ts:22:24
  */
 
 export function getAllNonStaticGridItems(layout: TLayout): ILayoutItem[] {
-  return layout.filter(l => !l.isStatic);
+  return layout.filter(() => undefined);
 }
 
killedBy: getAllNonStaticGridItems Should return one item from testLayout
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
src/common/helpers/grid-item-type-helpers.ts:22:10
  */
 
 export function getAllNonStaticGridItems(layout: TLayout): ILayoutItem[] {
-  return layout.filter(l => !l.isStatic);
+  return layout;
 }
 
killedBy: getAllNonStaticGridItems Should return one item from testLayout
statusReason: expected 2 to be 1 // Object.is equality
