[Killed] BlockStatement
src/griditem/helpers/grid-item-calculate-helper.ts:11:87
  * @param upperBound Maximum allowed value.
  * @return           `num`, or the nearest bound if it's outside the range.
  */
-export const clamp = (num: number, lowerBound: number, upperBound: number): number => {
-  const res = Math.max(Math.min(num, upperBound), lowerBound);
-  return res;
-};
+export const clamp = (num: number, lowerBound: number, upperBound: number): number => {};
 
 /**
killedBy: clamp Should return the number unchanged when within bounds
statusReason: expected undefined to be 10 // Object.is equality

[Killed] MethodExpression
src/griditem/helpers/grid-item-calculate-helper.ts:12:15
  * @return           `num`, or the nearest bound if it's outside the range.
  */
 export const clamp = (num: number, lowerBound: number, upperBound: number): number => {
-  const res = Math.max(Math.min(num, upperBound), lowerBound);
+  const res = Math.min(Math.min(num, upperBound), lowerBound);
   return res;
 };
killedBy: clamp Should return the number unchanged when within bounds
statusReason: expected +0 to be 10 // Object.is equality

[Killed] MethodExpression
src/griditem/helpers/grid-item-calculate-helper.ts:12:24
  * @return           `num`, or the nearest bound if it's outside the range.
  */
 export const clamp = (num: number, lowerBound: number, upperBound: number): number => {
-  const res = Math.max(Math.min(num, upperBound), lowerBound);
+  const res = Math.max(Math.max(num, upperBound), lowerBound);
   return res;
 };
killedBy: clamp Should return the number unchanged when within bounds
statusReason: expected 300 to be 10 // Object.is equality

[Killed] BlockStatement
src/griditem/helpers/grid-item-calculate-helper.ts:24:102
  * @return  {Number}    The result of the calculation. If gridUnits is not infinite, it returns the gridUnits.
  *                      Otherwise, the result is being calculated.
  */
-export const calcGridItemWH = (gridUnits: number, colOrRowSize: number, marginPx: number): number => {
-  if(gridUnits <= 0) {
-    throw new Error(EErrorMessage.INVALID_GRID_UNITS);
-  }
-
-  if(colOrRowSize <= 0) {
-    throw new Error(EErrorMessage.INVALID_COL_OR_ROW_SIZE);
-  }
-
-  if(marginPx < 0) {
-    throw new Error(EErrorMessage.INVALID_MARGIN);
-  }
-
-  if(!Number.isFinite(gridUnits)) {
-    return gridUnits;
-  }
-  return Math.round(colOrRowSize * gridUnits + Math.max(0, gridUnits - 1) * marginPx);
-};
+export const calcGridItemWH = (gridUnits: number, colOrRowSize: number, marginPx: number): number => {};
 
 /**
killedBy: calcGridItemWH tests Should allow gridUnits to be NaN
statusReason: expected undefined to be NaN // Object.is equality

[Killed] ConditionalExpression
src/griditem/helpers/grid-item-calculate-helper.ts:25:6
  *                      Otherwise, the result is being calculated.
  */
 export const calcGridItemWH = (gridUnits: number, colOrRowSize: number, marginPx: number): number => {
-  if(gridUnits <= 0) {
+  if(false) {
     throw new Error(EErrorMessage.INVALID_GRID_UNITS);
   }
killedBy: calcGridItemWH tests Should throw an error if gridUnits is Null
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/griditem/helpers/grid-item-calculate-helper.ts:25:6
  *                      Otherwise, the result is being calculated.
  */
 export const calcGridItemWH = (gridUnits: number, colOrRowSize: number, marginPx: number): number => {
-  if(gridUnits <= 0) {
+  if(gridUnits < 0) {
     throw new Error(EErrorMessage.INVALID_GRID_UNITS);
   }
killedBy: calcGridItemWH tests Should throw an error if gridUnits is Null
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/griditem/helpers/grid-item-calculate-helper.ts:29:25
     throw new Error(EErrorMessage.INVALID_GRID_UNITS);
   }
 
-  if(colOrRowSize <= 0) {
-    throw new Error(EErrorMessage.INVALID_COL_OR_ROW_SIZE);
-  }
+  if(colOrRowSize <= 0) {}
 
   if(marginPx < 0) {
killedBy: calcGridItemWH tests Should throw an error when colOrRowSize is 0 or negative
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/griditem/helpers/grid-item-calculate-helper.ts:29:6
     throw new Error(EErrorMessage.INVALID_GRID_UNITS);
   }
 
-  if(colOrRowSize <= 0) {
+  if(colOrRowSize < 0) {
     throw new Error(EErrorMessage.INVALID_COL_OR_ROW_SIZE);
   }
killedBy: calcGridItemWH tests Should throw an error when colOrRowSize is 0 or negative
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/griditem/helpers/grid-item-calculate-helper.ts:33:6
     throw new Error(EErrorMessage.INVALID_COL_OR_ROW_SIZE);
   }
 
-  if(marginPx < 0) {
+  if(marginPx <= 0) {
     throw new Error(EErrorMessage.INVALID_MARGIN);
   }
killedBy: exportLayoutAsSvg Should respect custom colNum/rowHeight/margin/containerWidth options
statusReason: Invalid marginPx parameter passed

[Killed] ConditionalExpression
src/griditem/helpers/grid-item-calculate-helper.ts:33:6
     throw new Error(EErrorMessage.INVALID_COL_OR_ROW_SIZE);
   }
 
-  if(marginPx < 0) {
+  if(true) {
     throw new Error(EErrorMessage.INVALID_MARGIN);
   }
killedBy: calcGridItemWH tests Should allow gridUnits to be NaN
statusReason: Invalid marginPx parameter passed

[Killed] ConditionalExpression
src/griditem/helpers/grid-item-calculate-helper.ts:37:6
     throw new Error(EErrorMessage.INVALID_MARGIN);
   }
 
-  if(!Number.isFinite(gridUnits)) {
+  if(true) {
     return gridUnits;
   }
killedBy: calcGridItemWH tests Should return the correct pixel size for finite grid units
statusReason: expected 3 to be 110 // Object.is equality

[Killed] BooleanLiteral
src/griditem/helpers/grid-item-calculate-helper.ts:37:6
     throw new Error(EErrorMessage.INVALID_MARGIN);
   }
 
-  if(!Number.isFinite(gridUnits)) {
+  if(Number.isFinite(gridUnits)) {
     return gridUnits;
   }
killedBy: calcGridItemWH tests Should return the correct pixel size for finite grid units
statusReason: expected 3 to be 110 // Object.is equality

[Killed] ArithmeticOperator
src/griditem/helpers/grid-item-calculate-helper.ts:40:48
   if(!Number.isFinite(gridUnits)) {
     return gridUnits;
   }
-  return Math.round(colOrRowSize * gridUnits + Math.max(0, gridUnits - 1) * marginPx);
+  return Math.round(colOrRowSize * gridUnits + Math.max(0, gridUnits - 1) / marginPx);
 };
 
killedBy: calcGridItemWH tests Should return the correct pixel size for finite grid units
statusReason: expected 90 to be 110 // Object.is equality

[Killed] ArithmeticOperator
src/griditem/helpers/grid-item-calculate-helper.ts:40:60
   if(!Number.isFinite(gridUnits)) {
     return gridUnits;
   }
-  return Math.round(colOrRowSize * gridUnits + Math.max(0, gridUnits - 1) * marginPx);
+  return Math.round(colOrRowSize * gridUnits + Math.max(0, gridUnits + 1) * marginPx);
 };
 
killedBy: calcGridItemWH tests Should return the correct pixel size for finite grid units
statusReason: expected 130 to be 110 // Object.is equality

[Killed] BlockStatement
src/griditem/helpers/grid-item-calculate-helper.ts:50:104
  * @param   {Number}    cols                Number of columns defined in the layout.
  * @return  {Number}                        The new column width.
  */
-export const calcColWidth = (containerWidth: number, marginLeftRight: number, cols: number): number => {
-  if(containerWidth < 1) {
-    throw new Error(EErrorMessage.INVALID_PARAM_CONTAINER_WIDTH);
-  }
-
-  if(marginLeftRight < 0) {
-    throw new Error(EErrorMessage.INVALID_MARGIN_LEFT_RIGHT);
-  }
-
-  if(cols < 1) {
-    throw new Error(EErrorMessage.INVALID_COLUMNS);
-  }
-
-  // if(marginLeftRight === 0){
-  //   return (containerWidth * (cols + 1)) / cols;
-  // }
-  return (containerWidth - marginLeftRight * (cols + 1)) / cols;
-};
+export const calcColWidth = (containerWidth: number, marginLeftRight: number, cols: number): number => {};
 
killedBy: calcColWidth Should throw an error when containerWidth is less than 1
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/griditem/helpers/grid-item-calculate-helper.ts:51:6
  * @return  {Number}                        The new column width.
  */
 export const calcColWidth = (containerWidth: number, marginLeftRight: number, cols: number): number => {
-  if(containerWidth < 1) {
+  if(false) {
     throw new Error(EErrorMessage.INVALID_PARAM_CONTAINER_WIDTH);
   }
killedBy: calcColWidth Should throw an error when containerWidth is less than 1
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/griditem/helpers/grid-item-calculate-helper.ts:51:6
  * @return  {Number}                        The new column width.
  */
 export const calcColWidth = (containerWidth: number, marginLeftRight: number, cols: number): number => {
-  if(containerWidth < 1) {
+  if(containerWidth >= 1) {
     throw new Error(EErrorMessage.INVALID_PARAM_CONTAINER_WIDTH);
   }
killedBy: calcColWidth Should throw an error when containerWidth is less than 1
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/griditem/helpers/grid-item-calculate-helper.ts:55:6
     throw new Error(EErrorMessage.INVALID_PARAM_CONTAINER_WIDTH);
   }
 
-  if(marginLeftRight < 0) {
+  if(marginLeftRight >= 0) {
     throw new Error(EErrorMessage.INVALID_MARGIN_LEFT_RIGHT);
   }
killedBy: calcColWidth Should throw an error when marginLeftRight is less than 0
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/griditem/helpers/grid-item-calculate-helper.ts:55:6
     throw new Error(EErrorMessage.INVALID_PARAM_CONTAINER_WIDTH);
   }
 
-  if(marginLeftRight < 0) {
+  if(true) {
     throw new Error(EErrorMessage.INVALID_MARGIN_LEFT_RIGHT);
   }
killedBy: calcXY Should compute x/y correctly with all-valid params, without throwing — confirmed gap via a fresh coverage report
statusReason: Invalid parameter marginLeftRight passed

[Killed] ConditionalExpression
src/griditem/helpers/grid-item-calculate-helper.ts:59:6
     throw new Error(EErrorMessage.INVALID_MARGIN_LEFT_RIGHT);
   }
 
-  if(cols < 1) {
+  if(false) {
     throw new Error(EErrorMessage.INVALID_COLUMNS);
   }
killedBy: calcColWidth Should throw an error when cols is less than 1
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/griditem/helpers/grid-item-calculate-helper.ts:59:6
     throw new Error(EErrorMessage.INVALID_MARGIN_LEFT_RIGHT);
   }
 
-  if(cols < 1) {
+  if(cols <= 1) {
     throw new Error(EErrorMessage.INVALID_COLUMNS);
   }
killedBy: calcXY Should NOT throw when cols is exactly 1
statusReason: expected [Function] to not throw an error but 'Error: Invalid parameter cols passed' was thrown

[Killed] ArithmeticOperator
src/griditem/helpers/grid-item-calculate-helper.ts:66:10
   // if(marginLeftRight === 0){
   //   return (containerWidth * (cols + 1)) / cols;
   // }
-  return (containerWidth - marginLeftRight * (cols + 1)) / cols;
+  return (containerWidth - marginLeftRight * (cols + 1)) * cols;
 };
 
killedBy: calcColWidth Should return the correct column width when parameters are valid
statusReason: expected -100 to be -1 // Object.is equality

[Killed] ArithmeticOperator
src/griditem/helpers/grid-item-calculate-helper.ts:66:28
   // if(marginLeftRight === 0){
   //   return (containerWidth * (cols + 1)) / cols;
   // }
-  return (containerWidth - marginLeftRight * (cols + 1)) / cols;
+  return (containerWidth - marginLeftRight / (cols + 1)) / cols;
 };
 
killedBy: calcColWidth Should return the correct column width when parameters are valid
statusReason: expected 9.90909090909091 to be -1 // Object.is equality
