[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:40:6
   edge: TAlignEdge,
 ): Map<string | number, { x?: number; y?: number }> {
   const result = new Map<string | number, { x?: number; y?: number }>();
-  if(itemIds.length < 2) {
+  if(true) {
     return result;
   }
killedBy: computeAlignAdjustments Should align non-anchor items' left edge to the anchor's left edge
statusReason: expected undefined to strictly equal { x: 5 }

[Killed] EqualityOperator
src/gridlayout/helpers/align-distribute-helper.ts:40:6
   edge: TAlignEdge,
 ): Map<string | number, { x?: number; y?: number }> {
   const result = new Map<string | number, { x?: number; y?: number }>();
-  if(itemIds.length < 2) {
+  if(itemIds.length >= 2) {
     return result;
   }
killedBy: computeAlignAdjustments Should align non-anchor items' left edge to the anchor's left edge
statusReason: expected undefined to strictly equal { x: 5 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:45:38
   }
 
   const [anchorId, ...restIds] = itemIds;
-  const anchor = layout.find(item => item.i === anchorId);
+  const anchor = layout.find(item => false);
   if(!anchor) {
     return result;
killedBy: computeAlignAdjustments Should align non-anchor items' left edge to the anchor's left edge
statusReason: expected undefined to strictly equal { x: 5 }

[Killed] EqualityOperator
src/gridlayout/helpers/align-distribute-helper.ts:45:38
   }
 
   const [anchorId, ...restIds] = itemIds;
-  const anchor = layout.find(item => item.i === anchorId);
+  const anchor = layout.find(item => item.i !== anchorId);
   if(!anchor) {
     return result;
killedBy: computeAlignAdjustments Should align non-anchor items' left edge to the anchor's left edge
statusReason: expected undefined to strictly equal { x: 5 }

[Killed] BooleanLiteral
src/gridlayout/helpers/align-distribute-helper.ts:46:6
 
   const [anchorId, ...restIds] = itemIds;
   const anchor = layout.find(item => item.i === anchorId);
-  if(!anchor) {
+  if(anchor) {
     return result;
   }
killedBy: computeAlignAdjustments Should align non-anchor items' left edge to the anchor's left edge
statusReason: expected undefined to strictly equal { x: 5 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:46:6
 
   const [anchorId, ...restIds] = itemIds;
   const anchor = layout.find(item => item.i === anchorId);
-  if(!anchor) {
+  if(false) {
     return result;
   }
killedBy: computeAlignAdjustments Should return an empty map when the anchor id doesn't match any real layout item
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] EqualityOperator
src/gridlayout/helpers/align-distribute-helper.ts:51:39
   }
 
   restIds.forEach(id => {
-    const item = layout.find(entry => entry.i === id);
+    const item = layout.find(entry => entry.i !== id);
     if(!item) {
       return;
killedBy: computeAlignAdjustments Should align non-anchor items' left edge to the anchor's left edge
statusReason: expected undefined to strictly equal { x: 5 }

[Killed] ArrowFunction
src/gridlayout/helpers/align-distribute-helper.ts:51:30
   }
 
   restIds.forEach(id => {
-    const item = layout.find(entry => entry.i === id);
+    const item = layout.find(() => undefined);
     if(!item) {
       return;
killedBy: computeAlignAdjustments Should align non-anchor items' left edge to the anchor's left edge
statusReason: expected undefined to strictly equal { x: 5 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:52:8
 
   restIds.forEach(id => {
     const item = layout.find(entry => entry.i === id);
-    if(!item) {
+    if(false) {
       return;
     }
killedBy: computeAlignAdjustments Should skip a non-anchor id that doesn't match any real layout item, without throwing
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BooleanLiteral
src/gridlayout/helpers/align-distribute-helper.ts:52:8
 
   restIds.forEach(id => {
     const item = layout.find(entry => entry.i === id);
-    if(!item) {
+    if(item) {
       return;
     }
killedBy: computeAlignAdjustments Should align non-anchor items' left edge to the anchor's left edge
statusReason: expected undefined to strictly equal { x: 5 }

[Survived] BlockStatement
src/gridlayout/helpers/align-distribute-helper.ts:57:20
     }
 
     switch(edge) {
-      case `left`: {
-        if(item.x !== anchor.x) {
-          result.set(id, { x: anchor.x });
-        }
-        break;
-      }
+      case `left`: {}
       case `right`: {
         const targetX = anchor.x + anchor.w - item.w;

[Survived] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:57:7
     }
 
     switch(edge) {
-      case `left`: {
-        if(item.x !== anchor.x) {
-          result.set(id, { x: anchor.x });
-        }
-        break;
-      }
+      case `left`:
       case `right`: {
         const targetX = anchor.x + anchor.w - item.w;

[Killed] BlockStatement
src/gridlayout/helpers/align-distribute-helper.ts:58:33
 
     switch(edge) {
       case `left`: {
-        if(item.x !== anchor.x) {
-          result.set(id, { x: anchor.x });
-        }
+        if(item.x !== anchor.x) {}
         break;
       }
killedBy: computeAlignAdjustments Should align non-anchor items' left edge to the anchor's left edge
statusReason: expected undefined to strictly equal { x: 5 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:58:12
 
     switch(edge) {
       case `left`: {
-        if(item.x !== anchor.x) {
+        if(true) {
           result.set(id, { x: anchor.x });
         }
killedBy: computeAlignAdjustments Should not include an item already exactly aligned
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/gridlayout/helpers/align-distribute-helper.ts:63:21
         }
         break;
       }
-      case `right`: {
-        const targetX = anchor.x + anchor.w - item.w;
-        if(item.x !== targetX) {
-          result.set(id, { x: targetX });
-        }
-        break;
-      }
+      case `right`: {}
       case `top`: {
         if(item.y !== anchor.y) {
killedBy: computeAlignAdjustments Should align non-anchor items' right edge to the anchor's right edge, adjusting for each item's own width
statusReason: expected { y: +0 } to strictly equal { x: 7 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:63:7
         }
         break;
       }
-      case `right`: {
-        const targetX = anchor.x + anchor.w - item.w;
-        if(item.x !== targetX) {
-          result.set(id, { x: targetX });
-        }
-        break;
-      }
+      case `right`:
       case `top`: {
         if(item.y !== anchor.y) {
killedBy: computeAlignAdjustments Should align non-anchor items' right edge to the anchor's right edge, adjusting for each item's own width
statusReason: expected { y: +0 } to strictly equal { x: 7 }

[Killed] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:64:25
         break;
       }
       case `right`: {
-        const targetX = anchor.x + anchor.w - item.w;
+        const targetX = anchor.x + anchor.w + item.w;
         if(item.x !== targetX) {
           result.set(id, { x: targetX });
killedBy: computeAlignAdjustments Should align non-anchor items' right edge to the anchor's right edge, adjusting for each item's own width
statusReason: expected { x: 11 } to strictly equal { x: 7 }

[Killed] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:64:25
         break;
       }
       case `right`: {
-        const targetX = anchor.x + anchor.w - item.w;
+        const targetX = anchor.x - anchor.w - item.w;
         if(item.x !== targetX) {
           result.set(id, { x: targetX });
killedBy: computeAlignAdjustments Should align non-anchor items' right edge to the anchor's right edge, adjusting for each item's own width
statusReason: expected { x: -1 } to strictly equal { x: 7 }

[Killed] EqualityOperator
src/gridlayout/helpers/align-distribute-helper.ts:65:12
       }
       case `right`: {
         const targetX = anchor.x + anchor.w - item.w;
-        if(item.x !== targetX) {
+        if(item.x === targetX) {
           result.set(id, { x: targetX });
         }
killedBy: computeAlignAdjustments Should align non-anchor items' right edge to the anchor's right edge, adjusting for each item's own width
statusReason: expected undefined to strictly equal { x: 7 }

[Killed] BlockStatement
src/gridlayout/helpers/align-distribute-helper.ts:65:32
       }
       case `right`: {
         const targetX = anchor.x + anchor.w - item.w;
-        if(item.x !== targetX) {
-          result.set(id, { x: targetX });
-        }
+        if(item.x !== targetX) {}
         break;
       }
killedBy: computeAlignAdjustments Should align non-anchor items' right edge to the anchor's right edge, adjusting for each item's own width
statusReason: expected undefined to strictly equal { x: 7 }

[Killed] ObjectLiteral
src/gridlayout/helpers/align-distribute-helper.ts:66:26
       case `right`: {
         const targetX = anchor.x + anchor.w - item.w;
         if(item.x !== targetX) {
-          result.set(id, { x: targetX });
+          result.set(id, {});
         }
         break;
killedBy: computeAlignAdjustments Should align non-anchor items' right edge to the anchor's right edge, adjusting for each item's own width
statusReason: expected {} to strictly equal { x: 7 }

[Survived] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:70:7
         }
         break;
       }
-      case `top`: {
-        if(item.y !== anchor.y) {
-          result.set(id, { y: anchor.y });
-        }
-        break;
-      }
+      case `top`:
       case `bottom`: {
         const targetY = anchor.y + anchor.h - item.h;

[Survived] BlockStatement
src/gridlayout/helpers/align-distribute-helper.ts:70:19
         }
         break;
       }
-      case `top`: {
-        if(item.y !== anchor.y) {
-          result.set(id, { y: anchor.y });
-        }
-        break;
-      }
+      case `top`: {}
       case `bottom`: {
         const targetY = anchor.y + anchor.h - item.h;

[Killed] BlockStatement
src/gridlayout/helpers/align-distribute-helper.ts:71:33
         break;
       }
       case `top`: {
-        if(item.y !== anchor.y) {
-          result.set(id, { y: anchor.y });
-        }
+        if(item.y !== anchor.y) {}
         break;
       }
killedBy: computeAlignAdjustments Should align non-anchor items' top edge to the anchor's top edge
statusReason: expected undefined to strictly equal { y: 5 }

[Killed] EqualityOperator
src/gridlayout/helpers/align-distribute-helper.ts:71:12
         break;
       }
       case `top`: {
-        if(item.y !== anchor.y) {
+        if(item.y === anchor.y) {
           result.set(id, { y: anchor.y });
         }
killedBy: computeAlignAdjustments Should align non-anchor items' top edge to the anchor's top edge
statusReason: expected undefined to strictly equal { y: 5 }

[Killed] ObjectLiteral
src/gridlayout/helpers/align-distribute-helper.ts:72:26
       }
       case `top`: {
         if(item.y !== anchor.y) {
-          result.set(id, { y: anchor.y });
+          result.set(id, {});
         }
         break;
killedBy: computeAlignAdjustments Should align non-anchor items' top edge to the anchor's top edge
statusReason: expected {} to strictly equal { y: 5 }

[Killed] BlockStatement
src/gridlayout/helpers/align-distribute-helper.ts:76:22
         }
         break;
       }
-      case `bottom`: {
-        const targetY = anchor.y + anchor.h - item.h;
-        if(item.y !== targetY) {
-          result.set(id, { y: targetY });
-        }
-        break;
-      }
+      case `bottom`: {}
       case `center-x`: {
         const targetX = Math.round(anchor.x + anchor.w / 2 - item.w / 2);
killedBy: computeAlignAdjustments Should align non-anchor items' bottom edge to the anchor's bottom edge, adjusting for each item's own height
statusReason: expected { x: +0 } to strictly equal { y: 7 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:76:7
         }
         break;
       }
-      case `bottom`: {
-        const targetY = anchor.y + anchor.h - item.h;
-        if(item.y !== targetY) {
-          result.set(id, { y: targetY });
-        }
-        break;
-      }
+      case `bottom`:
       case `center-x`: {
         const targetX = Math.round(anchor.x + anchor.w / 2 - item.w / 2);
killedBy: computeAlignAdjustments Should align non-anchor items' bottom edge to the anchor's bottom edge, adjusting for each item's own height
statusReason: expected { x: +0 } to strictly equal { y: 7 }

[Killed] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:77:25
         break;
       }
       case `bottom`: {
-        const targetY = anchor.y + anchor.h - item.h;
+        const targetY = anchor.y - anchor.h - item.h;
         if(item.y !== targetY) {
           result.set(id, { y: targetY });
killedBy: computeAlignAdjustments Should align non-anchor items' bottom edge to the anchor's bottom edge, adjusting for each item's own height
statusReason: expected { y: -1 } to strictly equal { y: 7 }

[Killed] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:77:25
         break;
       }
       case `bottom`: {
-        const targetY = anchor.y + anchor.h - item.h;
+        const targetY = anchor.y + anchor.h + item.h;
         if(item.y !== targetY) {
           result.set(id, { y: targetY });
killedBy: computeAlignAdjustments Should align non-anchor items' bottom edge to the anchor's bottom edge, adjusting for each item's own height
statusReason: expected { y: 11 } to strictly equal { y: 7 }

[Killed] EqualityOperator
src/gridlayout/helpers/align-distribute-helper.ts:78:12
       }
       case `bottom`: {
         const targetY = anchor.y + anchor.h - item.h;
-        if(item.y !== targetY) {
+        if(item.y === targetY) {
           result.set(id, { y: targetY });
         }
killedBy: computeAlignAdjustments Should align non-anchor items' bottom edge to the anchor's bottom edge, adjusting for each item's own height
statusReason: expected undefined to strictly equal { y: 7 }

[Killed] BlockStatement
src/gridlayout/helpers/align-distribute-helper.ts:78:32
       }
       case `bottom`: {
         const targetY = anchor.y + anchor.h - item.h;
-        if(item.y !== targetY) {
-          result.set(id, { y: targetY });
-        }
+        if(item.y !== targetY) {}
         break;
       }
killedBy: computeAlignAdjustments Should align non-anchor items' bottom edge to the anchor's bottom edge, adjusting for each item's own height
statusReason: expected undefined to strictly equal { y: 7 }

[Killed] ObjectLiteral
src/gridlayout/helpers/align-distribute-helper.ts:79:26
       case `bottom`: {
         const targetY = anchor.y + anchor.h - item.h;
         if(item.y !== targetY) {
-          result.set(id, { y: targetY });
+          result.set(id, {});
         }
         break;
killedBy: computeAlignAdjustments Should align non-anchor items' bottom edge to the anchor's bottom edge, adjusting for each item's own height
statusReason: expected {} to strictly equal { y: 7 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:83:7
         }
         break;
       }
-      case `center-x`: {
-        const targetX = Math.round(anchor.x + anchor.w / 2 - item.w / 2);
-        if(item.x !== targetX) {
-          result.set(id, { x: targetX });
-        }
-        break;
-      }
+      case `center-x`:
       case `center-y`: {
         const targetY = Math.round(anchor.y + anchor.h / 2 - item.h / 2);
killedBy: computeAlignAdjustments Should center-align on the x axis, rounding to the nearest whole grid unit
statusReason: expected { y: +0 } to strictly equal { x: 1 }

[Killed] BlockStatement
src/gridlayout/helpers/align-distribute-helper.ts:83:24
         }
         break;
       }
-      case `center-x`: {
-        const targetX = Math.round(anchor.x + anchor.w / 2 - item.w / 2);
-        if(item.x !== targetX) {
-          result.set(id, { x: targetX });
-        }
-        break;
-      }
+      case `center-x`: {}
       case `center-y`: {
         const targetY = Math.round(anchor.y + anchor.h / 2 - item.h / 2);
killedBy: computeAlignAdjustments Should center-align on the x axis, rounding to the nearest whole grid unit
statusReason: expected { y: +0 } to strictly equal { x: 1 }

[Killed] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:84:36
         break;
       }
       case `center-x`: {
-        const targetX = Math.round(anchor.x + anchor.w / 2 - item.w / 2);
+        const targetX = Math.round(anchor.x - anchor.w / 2 - item.w / 2);
         if(item.x !== targetX) {
           result.set(id, { x: targetX });
killedBy: computeAlignAdjustments Should center-align on the x axis, rounding to the nearest whole grid unit
statusReason: expected { x: -3 } to strictly equal { x: 1 }

[Killed] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:84:62
         break;
       }
       case `center-x`: {
-        const targetX = Math.round(anchor.x + anchor.w / 2 - item.w / 2);
+        const targetX = Math.round(anchor.x + anchor.w / 2 - item.w * 2);
         if(item.x !== targetX) {
           result.set(id, { x: targetX });
killedBy: computeAlignAdjustments Should center-align on the x axis, rounding to the nearest whole grid unit
statusReason: expected { x: -4 } to strictly equal { x: 1 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:85:12
       }
       case `center-x`: {
         const targetX = Math.round(anchor.x + anchor.w / 2 - item.w / 2);
-        if(item.x !== targetX) {
+        if(true) {
           result.set(id, { x: targetX });
         }
killedBy: computeAlignAdjustments Should not include an item already exactly center-aligned on the x axis
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:85:12
       }
       case `center-x`: {
         const targetX = Math.round(anchor.x + anchor.w / 2 - item.w / 2);
-        if(item.x !== targetX) {
+        if(false) {
           result.set(id, { x: targetX });
         }
killedBy: computeAlignAdjustments Should center-align on the x axis, rounding to the nearest whole grid unit
statusReason: expected undefined to strictly equal { x: 1 }

[Killed] BlockStatement
src/gridlayout/helpers/align-distribute-helper.ts:90:24
         }
         break;
       }
-      case `center-y`: {
-        const targetY = Math.round(anchor.y + anchor.h / 2 - item.h / 2);
-        if(item.y !== targetY) {
-          result.set(id, { y: targetY });
-        }
-        break;
-      }
+      case `center-y`: {}
     }
   });
killedBy: computeAlignAdjustments Should center-align on the y axis
statusReason: expected undefined to strictly equal { y: 1 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:90:7
         }
         break;
       }
-      case `center-y`: {
-        const targetY = Math.round(anchor.y + anchor.h / 2 - item.h / 2);
-        if(item.y !== targetY) {
-          result.set(id, { y: targetY });
-        }
-        break;
-      }
+      case `center-y`:
     }
   });
killedBy: computeAlignAdjustments Should center-align on the y axis
statusReason: expected undefined to strictly equal { y: 1 }

[Killed] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:91:47
         break;
       }
       case `center-y`: {
-        const targetY = Math.round(anchor.y + anchor.h / 2 - item.h / 2);
+        const targetY = Math.round(anchor.y + anchor.h * 2 - item.h / 2);
         if(item.y !== targetY) {
           result.set(id, { y: targetY });
killedBy: computeAlignAdjustments Should center-align on the y axis
statusReason: expected { y: 7 } to strictly equal { y: 1 }

[Killed] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:91:36
         break;
       }
       case `center-y`: {
-        const targetY = Math.round(anchor.y + anchor.h / 2 - item.h / 2);
+        const targetY = Math.round(anchor.y + anchor.h / 2 + item.h / 2);
         if(item.y !== targetY) {
           result.set(id, { y: targetY });
killedBy: computeAlignAdjustments Should center-align on the y axis
statusReason: expected { y: 3 } to strictly equal { y: 1 }

[Killed] EqualityOperator
src/gridlayout/helpers/align-distribute-helper.ts:92:12
       }
       case `center-y`: {
         const targetY = Math.round(anchor.y + anchor.h / 2 - item.h / 2);
-        if(item.y !== targetY) {
+        if(item.y === targetY) {
           result.set(id, { y: targetY });
         }
killedBy: computeAlignAdjustments Should center-align on the y axis
statusReason: expected undefined to strictly equal { y: 1 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:92:12
       }
       case `center-y`: {
         const targetY = Math.round(anchor.y + anchor.h / 2 - item.h / 2);
-        if(item.y !== targetY) {
+        if(false) {
           result.set(id, { y: targetY });
         }
killedBy: computeAlignAdjustments Should center-align on the y axis
statusReason: expected undefined to strictly equal { y: 1 }

[Killed] MethodExpression
src/gridlayout/helpers/align-distribute-helper.ts:126:17
 ): Map<string | number, { x?: number; y?: number }> {
   const result = new Map<string | number, { x?: number; y?: number }>();
 
-  const items = itemIds
-    .map(id => layout.find(entry => entry.i === id))
-    .filter((item): item is ILayoutItem => item !== undefined);
+  const items = itemIds.map(id => layout.find(entry => entry.i === id));
 
   if(items.length < 3) {
killedBy: computeDistributeAdjustments Should skip an id that doesn't match any real layout item, without throwing
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ArrowFunction
src/gridlayout/helpers/align-distribute-helper.ts:127:10
   const result = new Map<string | number, { x?: number; y?: number }>();
 
   const items = itemIds
-    .map(id => layout.find(entry => entry.i === id))
+    .map(() => undefined)
     .filter((item): item is ILayoutItem => item !== undefined);
 
killedBy: computeDistributeAdjustments Should evenly space the one middle item's x between the first and last, on the horizontal axis
statusReason: expected undefined to strictly equal { x: 10 }

[Killed] ArrowFunction
src/gridlayout/helpers/align-distribute-helper.ts:127:28
   const result = new Map<string | number, { x?: number; y?: number }>();
 
   const items = itemIds
-    .map(id => layout.find(entry => entry.i === id))
+    .map(id => layout.find(() => undefined))
     .filter((item): item is ILayoutItem => item !== undefined);
 
killedBy: computeDistributeAdjustments Should evenly space the one middle item's x between the first and last, on the horizontal axis
statusReason: expected undefined to strictly equal { x: 10 }

[Killed] ArrowFunction
src/gridlayout/helpers/align-distribute-helper.ts:128:13
 
   const items = itemIds
     .map(id => layout.find(entry => entry.i === id))
-    .filter((item): item is ILayoutItem => item !== undefined);
+    .filter(() => undefined);
 
   if(items.length < 3) {
killedBy: computeDistributeAdjustments Should evenly space the one middle item's x between the first and last, on the horizontal axis
statusReason: expected undefined to strictly equal { x: 10 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:128:44
 
   const items = itemIds
     .map(id => layout.find(entry => entry.i === id))
-    .filter((item): item is ILayoutItem => item !== undefined);
+    .filter((item): item is ILayoutItem => false);
 
   if(items.length < 3) {
killedBy: computeDistributeAdjustments Should evenly space the one middle item's x between the first and last, on the horizontal axis
statusReason: expected undefined to strictly equal { x: 10 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:130:6
     .map(id => layout.find(entry => entry.i === id))
     .filter((item): item is ILayoutItem => item !== undefined);
 
-  if(items.length < 3) {
+  if(false) {
     return result;
   }
killedBy: computeDistributeAdjustments Should return an empty map with fewer than 3 items
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] EqualityOperator
src/gridlayout/helpers/align-distribute-helper.ts:130:6
     .map(id => layout.find(entry => entry.i === id))
     .filter((item): item is ILayoutItem => item !== undefined);
 
-  if(items.length < 3) {
+  if(items.length <= 3) {
     return result;
   }
killedBy: computeDistributeAdjustments Should evenly space the one middle item's x between the first and last, on the horizontal axis
statusReason: expected undefined to strictly equal { x: 10 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:134:18
     return result;
   }
 
-  const posKey = axis === `horizontal` ? `x` : `y`;
+  const posKey = true ? `x` : `y`;
   const sizeKey = axis === `horizontal` ? `w` : `h`;
   const sorted = [...items].sort((a, b) => a[posKey] - b[posKey]);
killedBy: computeDistributeAdjustments Should distribute on the vertical axis independently of x
statusReason: expected undefined to strictly equal { y: 10 }

[Killed] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:134:18
     return result;
   }
 
-  const posKey = axis === `horizontal` ? `x` : `y`;
+  const posKey = false ? `x` : `y`;
   const sizeKey = axis === `horizontal` ? `w` : `h`;
   const sorted = [...items].sort((a, b) => a[posKey] - b[posKey]);
killedBy: computeDistributeAdjustments Should evenly space the one middle item's x between the first and last, on the horizontal axis
statusReason: expected undefined to strictly equal { x: 10 }

[Survived] ConditionalExpression
src/gridlayout/helpers/align-distribute-helper.ts:135:19
   }
 
   const posKey = axis === `horizontal` ? `x` : `y`;
-  const sizeKey = axis === `horizontal` ? `w` : `h`;
+  const sizeKey = false ? `w` : `h`;
   const sorted = [...items].sort((a, b) => a[posKey] - b[posKey]);
 

[Survived] EqualityOperator
src/gridlayout/helpers/align-distribute-helper.ts:135:19
   }
 
   const posKey = axis === `horizontal` ? `x` : `y`;
-  const sizeKey = axis === `horizontal` ? `w` : `h`;
+  const sizeKey = axis !== `horizontal` ? `w` : `h`;
   const sorted = [...items].sort((a, b) => a[posKey] - b[posKey]);
 

[Survived] MethodExpression
src/gridlayout/helpers/align-distribute-helper.ts:136:18
 
   const posKey = axis === `horizontal` ? `x` : `y`;
   const sizeKey = axis === `horizontal` ? `w` : `h`;
-  const sorted = [...items].sort((a, b) => a[posKey] - b[posKey]);
+  const sorted = [...items];
 
   const first = sorted[0];

[Survived] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:136:44
 
   const posKey = axis === `horizontal` ? `x` : `y`;
   const sizeKey = axis === `horizontal` ? `w` : `h`;
-  const sorted = [...items].sort((a, b) => a[posKey] - b[posKey]);
+  const sorted = [...items].sort((a, b) => a[posKey] + b[posKey]);
 
   const first = sorted[0];

[Killed] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:139:23
   const sorted = [...items].sort((a, b) => a[posKey] - b[posKey]);
 
   const first = sorted[0];
-  const last = sorted[sorted.length - 1];
+  const last = sorted[sorted.length + 1];
   const span = (last[posKey] + last[sizeKey]) - first[posKey];
   const totalSize = sorted.reduce((sum, item) => sum + item[sizeKey], 0);
killedBy: computeDistributeAdjustments Should evenly space the one middle item's x between the first and last, on the horizontal axis
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:140:17
 
   const first = sorted[0];
   const last = sorted[sorted.length - 1];
-  const span = (last[posKey] + last[sizeKey]) - first[posKey];
+  const span = (last[posKey] - last[sizeKey]) - first[posKey];
   const totalSize = sorted.reduce((sum, item) => sum + item[sizeKey], 0);
   // Can go negative if the selected items are collectively wider/taller
killedBy: computeDistributeAdjustments Should evenly space the one middle item's x between the first and last, on the horizontal axis
statusReason: expected { x: 8 } to strictly equal { x: 10 }

[Survived] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:140:16
 
   const first = sorted[0];
   const last = sorted[sorted.length - 1];
-  const span = (last[posKey] + last[sizeKey]) - first[posKey];
+  const span = last[posKey] + last[sizeKey] + first[posKey];
   const totalSize = sorted.reduce((sum, item) => sum + item[sizeKey], 0);
   // Can go negative if the selected items are collectively wider/taller

[Killed] ArithmeticOperator
src/gridlayout/helpers/align-distribute-helper.ts:141:50
   const first = sorted[0];
   const last = sorted[sorted.length - 1];
   const span = (last[posKey] + last[sizeKey]) - first[posKey];
-  const totalSize = sorted.reduce((sum, item) => sum + item[sizeKey], 0);
+  const totalSize = sorted.reduce((sum, item) => sum - item[sizeKey], 0);
   // Can go negative if the selected items are collectively wider/taller
   // than the span between the first and last item's own edges (e.g.
killedBy: computeDistributeAdjustments Should evenly space the one middle item's x between the first and last, on the horizontal axis
statusReason: expected { x: 16 } to strictly equal { x: 10 }
