[Killed] BlockStatement
src/gridlayout/helpers/alignment-helper.ts:166:26
   }
 
   let bestBottom: number | undefined;
-  others.forEach(item => {
-    const otherTop = item.y;
-    const otherLeft = item.x;
-    const otherRight = item.x + item.w;
-    const xOverlaps = otherLeft < activeRight && otherRight > activeLeft;
-    if(xOverlaps && otherTop >= activeBottom && (bestBottom === undefined || otherTop < bestBottom)) {
-      bestBottom = otherTop;
-    }
-  });
+  others.forEach(item => {});
   if(bestBottom !== undefined && bestBottom > activeBottom) {
     indicators.push({ axis: `y`, distance: bestBottom - activeBottom, gapEnd: bestBottom, gapStart: activeBottom });
killedBy: findSpacingIndicators Should find the gap to a neighbor below
statusReason: expected [] to deep equally contain { axis: 'y', distance: 4, …(2) }

[Killed] ConditionalExpression
src/gridlayout/helpers/alignment-helper.ts:170:23
     const otherTop = item.y;
     const otherLeft = item.x;
     const otherRight = item.x + item.w;
-    const xOverlaps = otherLeft < activeRight && otherRight > activeLeft;
+    const xOverlaps = false;
     if(xOverlaps && otherTop >= activeBottom && (bestBottom === undefined || otherTop < bestBottom)) {
       bestBottom = otherTop;
killedBy: findSpacingIndicators Should find the gap to a neighbor below
statusReason: expected [] to deep equally contain { axis: 'y', distance: 4, …(2) }

[Killed] ConditionalExpression
src/gridlayout/helpers/alignment-helper.ts:171:21
     const otherLeft = item.x;
     const otherRight = item.x + item.w;
     const xOverlaps = otherLeft < activeRight && otherRight > activeLeft;
-    if(xOverlaps && otherTop >= activeBottom && (bestBottom === undefined || otherTop < bestBottom)) {
+    if(xOverlaps && true && (bestBottom === undefined || otherTop < bestBottom)) {
       bestBottom = otherTop;
     }
killedBy: findSpacingIndicators Should find all four sides' gaps at once when neighbors exist on every side
statusReason: expected [ …(3) ] to have a length of 4 but got 3

[Killed] LogicalOperator
src/gridlayout/helpers/alignment-helper.ts:171:8
     const otherLeft = item.x;
     const otherRight = item.x + item.w;
     const xOverlaps = otherLeft < activeRight && otherRight > activeLeft;
-    if(xOverlaps && otherTop >= activeBottom && (bestBottom === undefined || otherTop < bestBottom)) {
+    if(xOverlaps && otherTop >= activeBottom || bestBottom === undefined || otherTop < bestBottom) {
       bestBottom = otherTop;
     }
killedBy: findSpacingIndicators Should ignore a candidate whose perpendicular range doesn't overlap activeItem's, even though it's on the same side
statusReason: expected [ { axis: 'y', distance: 8, …(2) } ] to strictly equal []

[Killed] EqualityOperator
src/gridlayout/helpers/alignment-helper.ts:175:34
       bestBottom = otherTop;
     }
   });
-  if(bestBottom !== undefined && bestBottom > activeBottom) {
+  if(bestBottom !== undefined && bestBottom <= activeBottom) {
     indicators.push({ axis: `y`, distance: bestBottom - activeBottom, gapEnd: bestBottom, gapStart: activeBottom });
   }
killedBy: findSpacingIndicators Should find the gap to a neighbor below
statusReason: expected [] to deep equally contain { axis: 'y', distance: 4, …(2) }

[Killed] EqualityOperator
src/gridlayout/helpers/alignment-helper.ts:175:6
       bestBottom = otherTop;
     }
   });
-  if(bestBottom !== undefined && bestBottom > activeBottom) {
+  if(bestBottom === undefined && bestBottom > activeBottom) {
     indicators.push({ axis: `y`, distance: bestBottom - activeBottom, gapEnd: bestBottom, gapStart: activeBottom });
   }
killedBy: findSpacingIndicators Should find the gap to a neighbor below
statusReason: expected [] to deep equally contain { axis: 'y', distance: 4, …(2) }

[Killed] ArithmeticOperator
src/gridlayout/helpers/alignment-helper.ts:176:44
     }
   });
   if(bestBottom !== undefined && bestBottom > activeBottom) {
-    indicators.push({ axis: `y`, distance: bestBottom - activeBottom, gapEnd: bestBottom, gapStart: activeBottom });
+    indicators.push({ axis: `y`, distance: bestBottom + activeBottom, gapEnd: bestBottom, gapStart: activeBottom });
   }
 
killedBy: findSpacingIndicators Should find the gap to a neighbor below
statusReason: expected [ { axis: 'y', distance: 8, …(2) } ] to deep equally contain { axis: 'y', distance: 4, …(2) }

[Killed] EqualityOperator
src/gridlayout/helpers/alignment-helper.ts:209:6
   activeItem: ILayoutItem,
   threshold: number,
 ): { x?: number; y?: number } {
-  if(threshold <= 0) {
+  if(threshold > 0) {
     return {};
   }
killedBy: findSnapAdjustment Should snap x to align the active item's left edge with another item's left edge, within threshold
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/gridlayout/helpers/alignment-helper.ts:209:6
   activeItem: ILayoutItem,
   threshold: number,
 ): { x?: number; y?: number } {
-  if(threshold <= 0) {
+  if(false) {
     return {};
   }
killedBy: findSnapAdjustment Should return an empty object when threshold is 0
statusReason: expected { x: +0 } to strictly equal {}

[Killed] ConditionalExpression
src/gridlayout/helpers/alignment-helper.ts:224:21
   let bestY: number | undefined;
 
   layout
-    .filter(item => item.i !== activeItem.i)
+    .filter(item => true)
     .forEach(item => {
       const otherLeft = item.x;
killedBy: findSnapAdjustment Should snap x to align the active item's left edge with another item's left edge, within threshold
statusReason: expected 3 to be +0 // Object.is equality

[Killed] ArrayDeclaration
src/gridlayout/helpers/alignment-helper.ts:236:7
       // left-to-either / right-to-either behavior — and, if within
       // threshold, compute what activeItem.x/y would need to be for
       // that specific edge to land exactly on the target.
-      [
-        { activeEdge: activeLeft, otherEdge: otherLeft, toX: (target: number): number => target },
-        { activeEdge: activeLeft, otherEdge: otherRight, toX: (target: number): number => target },
-        { activeEdge: activeRight, otherEdge: otherLeft, toX: (target: number): number => target - activeItem.w },
-        { activeEdge: activeRight, otherEdge: otherRight, toX: (target: number): number => target - activeItem.w },
-      ].forEach(({ activeEdge, otherEdge, toX }) => {
+      [].forEach(({ activeEdge, otherEdge, toX }) => {
         const distance = Math.abs(activeEdge - otherEdge);
         if(distance <= threshold && distance < bestXDistance) {
killedBy: findSnapAdjustment Should snap x to align the active item's left edge with another item's left edge, within threshold
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrowFunction
src/gridlayout/helpers/alignment-helper.ts:237:62
       // threshold, compute what activeItem.x/y would need to be for
       // that specific edge to land exactly on the target.
       [
-        { activeEdge: activeLeft, otherEdge: otherLeft, toX: (target: number): number => target },
+        { activeEdge: activeLeft, otherEdge: otherLeft, toX: () => undefined },
         { activeEdge: activeLeft, otherEdge: otherRight, toX: (target: number): number => target },
         { activeEdge: activeRight, otherEdge: otherLeft, toX: (target: number): number => target - activeItem.w },
killedBy: findSnapAdjustment Should snap x to align the active item's left edge with another item's left edge, within threshold
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ObjectLiteral
src/gridlayout/helpers/alignment-helper.ts:237:9
       // threshold, compute what activeItem.x/y would need to be for
       // that specific edge to land exactly on the target.
       [
-        { activeEdge: activeLeft, otherEdge: otherLeft, toX: (target: number): number => target },
+        {},
         { activeEdge: activeLeft, otherEdge: otherRight, toX: (target: number): number => target },
         { activeEdge: activeRight, otherEdge: otherLeft, toX: (target: number): number => target - activeItem.w },
killedBy: findSnapAdjustment Should snap x to align the active item's left edge with another item's left edge, within threshold
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrowFunction
src/gridlayout/helpers/alignment-helper.ts:238:63
       // that specific edge to land exactly on the target.
       [
         { activeEdge: activeLeft, otherEdge: otherLeft, toX: (target: number): number => target },
-        { activeEdge: activeLeft, otherEdge: otherRight, toX: (target: number): number => target },
+        { activeEdge: activeLeft, otherEdge: otherRight, toX: () => undefined },
         { activeEdge: activeRight, otherEdge: otherLeft, toX: (target: number): number => target - activeItem.w },
         { activeEdge: activeRight, otherEdge: otherRight, toX: (target: number): number => target - activeItem.w },
killedBy: findSnapAdjustment Should pick the closest match when multiple items are within threshold
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/gridlayout/helpers/alignment-helper.ts:239:91
       [
         { activeEdge: activeLeft, otherEdge: otherLeft, toX: (target: number): number => target },
         { activeEdge: activeLeft, otherEdge: otherRight, toX: (target: number): number => target },
-        { activeEdge: activeRight, otherEdge: otherLeft, toX: (target: number): number => target - activeItem.w },
+        { activeEdge: activeRight, otherEdge: otherLeft, toX: (target: number): number => target + activeItem.w },
         { activeEdge: activeRight, otherEdge: otherRight, toX: (target: number): number => target - activeItem.w },
       ].forEach(({ activeEdge, otherEdge, toX }) => {
killedBy: findSnapAdjustment Should snap the active item's right edge to another item's left edge, adjusting for the item's own width
statusReason: expected 8 to be 4 // Object.is equality

[Killed] ArrowFunction
src/gridlayout/helpers/alignment-helper.ts:239:63
       [
         { activeEdge: activeLeft, otherEdge: otherLeft, toX: (target: number): number => target },
         { activeEdge: activeLeft, otherEdge: otherRight, toX: (target: number): number => target },
-        { activeEdge: activeRight, otherEdge: otherLeft, toX: (target: number): number => target - activeItem.w },
+        { activeEdge: activeRight, otherEdge: otherLeft, toX: () => undefined },
         { activeEdge: activeRight, otherEdge: otherRight, toX: (target: number): number => target - activeItem.w },
       ].forEach(({ activeEdge, otherEdge, toX }) => {
killedBy: findSnapAdjustment Should snap the active item's right edge to another item's left edge, adjusting for the item's own width
statusReason: expected undefined to be 4 // Object.is equality

[Killed] ArrowFunction
src/gridlayout/helpers/alignment-helper.ts:240:64
         { activeEdge: activeLeft, otherEdge: otherLeft, toX: (target: number): number => target },
         { activeEdge: activeLeft, otherEdge: otherRight, toX: (target: number): number => target },
         { activeEdge: activeRight, otherEdge: otherLeft, toX: (target: number): number => target - activeItem.w },
-        { activeEdge: activeRight, otherEdge: otherRight, toX: (target: number): number => target - activeItem.w },
+        { activeEdge: activeRight, otherEdge: otherRight, toX: () => undefined },
       ].forEach(({ activeEdge, otherEdge, toX }) => {
         const distance = Math.abs(activeEdge - otherEdge);
killedBy: findSnapAdjustment Should snap the active item's right edge to another item's right edge (the remaining untested x edge-combination)
statusReason: expected undefined to be 12 // Object.is equality

[Killed] ArithmeticOperator
src/gridlayout/helpers/alignment-helper.ts:240:92
         { activeEdge: activeLeft, otherEdge: otherLeft, toX: (target: number): number => target },
         { activeEdge: activeLeft, otherEdge: otherRight, toX: (target: number): number => target },
         { activeEdge: activeRight, otherEdge: otherLeft, toX: (target: number): number => target - activeItem.w },
-        { activeEdge: activeRight, otherEdge: otherRight, toX: (target: number): number => target - activeItem.w },
+        { activeEdge: activeRight, otherEdge: otherRight, toX: (target: number): number => target + activeItem.w },
       ].forEach(({ activeEdge, otherEdge, toX }) => {
         const distance = Math.abs(activeEdge - otherEdge);
killedBy: findSnapAdjustment Should snap the active item's right edge to another item's right edge (the remaining untested x edge-combination)
statusReason: expected 16 to be 12 // Object.is equality

[Killed] BlockStatement
src/gridlayout/helpers/alignment-helper.ts:241:53
         { activeEdge: activeLeft, otherEdge: otherRight, toX: (target: number): number => target },
         { activeEdge: activeRight, otherEdge: otherLeft, toX: (target: number): number => target - activeItem.w },
         { activeEdge: activeRight, otherEdge: otherRight, toX: (target: number): number => target - activeItem.w },
-      ].forEach(({ activeEdge, otherEdge, toX }) => {
-        const distance = Math.abs(activeEdge - otherEdge);
-        if(distance <= threshold && distance < bestXDistance) {
-          bestXDistance = distance;
-          bestX = toX(otherEdge);
-        }
-      });
+      ].forEach(({ activeEdge, otherEdge, toX }) => {});
 
       [
killedBy: findSnapAdjustment Should snap x to align the active item's left edge with another item's left edge, within threshold
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/gridlayout/helpers/alignment-helper.ts:242:35
         { activeEdge: activeRight, otherEdge: otherLeft, toX: (target: number): number => target - activeItem.w },
         { activeEdge: activeRight, otherEdge: otherRight, toX: (target: number): number => target - activeItem.w },
       ].forEach(({ activeEdge, otherEdge, toX }) => {
-        const distance = Math.abs(activeEdge - otherEdge);
+        const distance = Math.abs(activeEdge + otherEdge);
         if(distance <= threshold && distance < bestXDistance) {
           bestXDistance = distance;
killedBy: findSnapAdjustment Should snap the active item's right edge to another item's left edge, adjusting for the item's own width
statusReason: expected undefined to be 4 // Object.is equality

[Killed] LogicalOperator
src/gridlayout/helpers/alignment-helper.ts:243:12
         { activeEdge: activeRight, otherEdge: otherRight, toX: (target: number): number => target - activeItem.w },
       ].forEach(({ activeEdge, otherEdge, toX }) => {
         const distance = Math.abs(activeEdge - otherEdge);
-        if(distance <= threshold && distance < bestXDistance) {
+        if(distance <= threshold || distance < bestXDistance) {
           bestXDistance = distance;
           bestX = toX(otherEdge);
killedBy: findSnapAdjustment Should not snap when the nearest edge is further than threshold
statusReason: expected 2 to be undefined

[Killed] ConditionalExpression
src/gridlayout/helpers/alignment-helper.ts:243:12
         { activeEdge: activeRight, otherEdge: otherRight, toX: (target: number): number => target - activeItem.w },
       ].forEach(({ activeEdge, otherEdge, toX }) => {
         const distance = Math.abs(activeEdge - otherEdge);
-        if(distance <= threshold && distance < bestXDistance) {
+        if(false) {
           bestXDistance = distance;
           bestX = toX(otherEdge);
killedBy: findSnapAdjustment Should snap x to align the active item's left edge with another item's left edge, within threshold
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrayDeclaration
src/gridlayout/helpers/alignment-helper.ts:249:7
         }
       });
 
-      [
-        { activeEdge: activeTop, otherEdge: otherTop, toY: (target: number): number => target },
-        { activeEdge: activeTop, otherEdge: otherBottom, toY: (target: number): number => target },
-        { activeEdge: activeBottom, otherEdge: otherTop, toY: (target: number): number => target - activeItem.h },
-        { activeEdge: activeBottom, otherEdge: otherBottom, toY: (target: number): number => target - activeItem.h },
-      ].forEach(({ activeEdge, otherEdge, toY }) => {
+      [].forEach(({ activeEdge, otherEdge, toY }) => {
         const distance = Math.abs(activeEdge - otherEdge);
         if(distance <= threshold && distance < bestYDistance) {
killedBy: findSnapAdjustment Should snap y independently of x, on the vertical axis
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrowFunction
src/gridlayout/helpers/alignment-helper.ts:250:60
       });
 
       [
-        { activeEdge: activeTop, otherEdge: otherTop, toY: (target: number): number => target },
+        { activeEdge: activeTop, otherEdge: otherTop, toY: () => undefined },
         { activeEdge: activeTop, otherEdge: otherBottom, toY: (target: number): number => target },
         { activeEdge: activeBottom, otherEdge: otherTop, toY: (target: number): number => target - activeItem.h },
killedBy: findSnapAdjustment Should snap y independently of x, on the vertical axis
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ObjectLiteral
src/gridlayout/helpers/alignment-helper.ts:250:9
       });
 
       [
-        { activeEdge: activeTop, otherEdge: otherTop, toY: (target: number): number => target },
+        {},
         { activeEdge: activeTop, otherEdge: otherBottom, toY: (target: number): number => target },
         { activeEdge: activeBottom, otherEdge: otherTop, toY: (target: number): number => target - activeItem.h },
killedBy: findSnapAdjustment Should snap y independently of x, on the vertical axis
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrowFunction
src/gridlayout/helpers/alignment-helper.ts:251:63
 
       [
         { activeEdge: activeTop, otherEdge: otherTop, toY: (target: number): number => target },
-        { activeEdge: activeTop, otherEdge: otherBottom, toY: (target: number): number => target },
+        { activeEdge: activeTop, otherEdge: otherBottom, toY: () => undefined },
         { activeEdge: activeBottom, otherEdge: otherTop, toY: (target: number): number => target - activeItem.h },
         { activeEdge: activeBottom, otherEdge: otherBottom, toY: (target: number): number => target - activeItem.h },
killedBy: findSnapAdjustment Should snap on the remaining three untested y edge-combinations (top-to-bottom, bottom-to-top, bottom-to-bottom)
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ArithmeticOperator
src/gridlayout/helpers/alignment-helper.ts:252:91
       [
         { activeEdge: activeTop, otherEdge: otherTop, toY: (target: number): number => target },
         { activeEdge: activeTop, otherEdge: otherBottom, toY: (target: number): number => target },
-        { activeEdge: activeBottom, otherEdge: otherTop, toY: (target: number): number => target - activeItem.h },
+        { activeEdge: activeBottom, otherEdge: otherTop, toY: (target: number): number => target + activeItem.h },
         { activeEdge: activeBottom, otherEdge: otherBottom, toY: (target: number): number => target - activeItem.h },
       ].forEach(({ activeEdge, otherEdge, toY }) => {
killedBy: findSnapAdjustment Should snap on the remaining three untested y edge-combinations (top-to-bottom, bottom-to-top, bottom-to-bottom)
statusReason: expected 7 to be 3 // Object.is equality

[Killed] ArrowFunction
src/gridlayout/helpers/alignment-helper.ts:252:63
       [
         { activeEdge: activeTop, otherEdge: otherTop, toY: (target: number): number => target },
         { activeEdge: activeTop, otherEdge: otherBottom, toY: (target: number): number => target },
-        { activeEdge: activeBottom, otherEdge: otherTop, toY: (target: number): number => target - activeItem.h },
+        { activeEdge: activeBottom, otherEdge: otherTop, toY: () => undefined },
         { activeEdge: activeBottom, otherEdge: otherBottom, toY: (target: number): number => target - activeItem.h },
       ].forEach(({ activeEdge, otherEdge, toY }) => {
killedBy: findSnapAdjustment Should snap on the remaining three untested y edge-combinations (top-to-bottom, bottom-to-top, bottom-to-bottom)
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ArrowFunction
src/gridlayout/helpers/alignment-helper.ts:253:66
         { activeEdge: activeTop, otherEdge: otherTop, toY: (target: number): number => target },
         { activeEdge: activeTop, otherEdge: otherBottom, toY: (target: number): number => target },
         { activeEdge: activeBottom, otherEdge: otherTop, toY: (target: number): number => target - activeItem.h },
-        { activeEdge: activeBottom, otherEdge: otherBottom, toY: (target: number): number => target - activeItem.h },
+        { activeEdge: activeBottom, otherEdge: otherBottom, toY: () => undefined },
       ].forEach(({ activeEdge, otherEdge, toY }) => {
         const distance = Math.abs(activeEdge - otherEdge);
killedBy: findSnapAdjustment Should snap on the remaining three untested y edge-combinations (top-to-bottom, bottom-to-top, bottom-to-bottom)
statusReason: expected undefined to be 12 // Object.is equality

[Killed] ArithmeticOperator
src/gridlayout/helpers/alignment-helper.ts:253:94
         { activeEdge: activeTop, otherEdge: otherTop, toY: (target: number): number => target },
         { activeEdge: activeTop, otherEdge: otherBottom, toY: (target: number): number => target },
         { activeEdge: activeBottom, otherEdge: otherTop, toY: (target: number): number => target - activeItem.h },
-        { activeEdge: activeBottom, otherEdge: otherBottom, toY: (target: number): number => target - activeItem.h },
+        { activeEdge: activeBottom, otherEdge: otherBottom, toY: (target: number): number => target + activeItem.h },
       ].forEach(({ activeEdge, otherEdge, toY }) => {
         const distance = Math.abs(activeEdge - otherEdge);
killedBy: findSnapAdjustment Should snap on the remaining three untested y edge-combinations (top-to-bottom, bottom-to-top, bottom-to-bottom)
statusReason: expected 16 to be 12 // Object.is equality

[Killed] BlockStatement
src/gridlayout/helpers/alignment-helper.ts:254:53
         { activeEdge: activeTop, otherEdge: otherBottom, toY: (target: number): number => target },
         { activeEdge: activeBottom, otherEdge: otherTop, toY: (target: number): number => target - activeItem.h },
         { activeEdge: activeBottom, otherEdge: otherBottom, toY: (target: number): number => target - activeItem.h },
-      ].forEach(({ activeEdge, otherEdge, toY }) => {
-        const distance = Math.abs(activeEdge - otherEdge);
-        if(distance <= threshold && distance < bestYDistance) {
-          bestYDistance = distance;
-          bestY = toY(otherEdge);
-        }
-      });
+      ].forEach(({ activeEdge, otherEdge, toY }) => {});
     });
 
killedBy: findSnapAdjustment Should snap y independently of x, on the vertical axis
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/gridlayout/helpers/alignment-helper.ts:255:35
         { activeEdge: activeBottom, otherEdge: otherTop, toY: (target: number): number => target - activeItem.h },
         { activeEdge: activeBottom, otherEdge: otherBottom, toY: (target: number): number => target - activeItem.h },
       ].forEach(({ activeEdge, otherEdge, toY }) => {
-        const distance = Math.abs(activeEdge - otherEdge);
+        const distance = Math.abs(activeEdge + otherEdge);
         if(distance <= threshold && distance < bestYDistance) {
           bestYDistance = distance;
killedBy: findSnapAdjustment Should snap on the remaining three untested y edge-combinations (top-to-bottom, bottom-to-top, bottom-to-bottom)
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ConditionalExpression
src/gridlayout/helpers/alignment-helper.ts:256:12
         { activeEdge: activeBottom, otherEdge: otherBottom, toY: (target: number): number => target - activeItem.h },
       ].forEach(({ activeEdge, otherEdge, toY }) => {
         const distance = Math.abs(activeEdge - otherEdge);
-        if(distance <= threshold && distance < bestYDistance) {
+        if(true) {
           bestYDistance = distance;
           bestY = toY(otherEdge);
killedBy: findSnapAdjustment Should snap y independently of x, on the vertical axis
statusReason: expected 18 to be +0 // Object.is equality

[Killed] EqualityOperator
src/gridlayout/helpers/alignment-helper.ts:256:37
         { activeEdge: activeBottom, otherEdge: otherBottom, toY: (target: number): number => target - activeItem.h },
       ].forEach(({ activeEdge, otherEdge, toY }) => {
         const distance = Math.abs(activeEdge - otherEdge);
-        if(distance <= threshold && distance < bestYDistance) {
+        if(distance <= threshold && distance >= bestYDistance) {
           bestYDistance = distance;
           bestY = toY(otherEdge);
killedBy: findSnapAdjustment Should snap y independently of x, on the vertical axis
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/gridlayout/helpers/alignment-helper.ts:264:27
     });
 
   const result: { x?: number; y?: number } = {};
-  if(bestX !== undefined) {
-    result.x = Math.max(bestX, 0);
-  }
+  if(bestX !== undefined) {}
   if(bestY !== undefined) {
     result.y = Math.max(bestY, 0);
killedBy: findSnapAdjustment Should snap x to align the active item's left edge with another item's left edge, within threshold
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/gridlayout/helpers/alignment-helper.ts:264:6
     });
 
   const result: { x?: number; y?: number } = {};
-  if(bestX !== undefined) {
+  if(true) {
     result.x = Math.max(bestX, 0);
   }
killedBy: findSnapAdjustment Should not snap when the nearest edge is further than threshold
statusReason: expected NaN to be undefined

[Killed] MethodExpression
src/gridlayout/helpers/alignment-helper.ts:265:16
 
   const result: { x?: number; y?: number } = {};
   if(bestX !== undefined) {
-    result.x = Math.max(bestX, 0);
+    result.x = Math.min(bestX, 0);
   }
   if(bestY !== undefined) {
killedBy: findSnapAdjustment Should snap the active item's right edge to another item's left edge, adjusting for the item's own width
statusReason: expected +0 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/gridlayout/helpers/alignment-helper.ts:267:6
   if(bestX !== undefined) {
     result.x = Math.max(bestX, 0);
   }
-  if(bestY !== undefined) {
+  if(true) {
     result.y = Math.max(bestY, 0);
   }
killedBy: findSnapAdjustment Should return an empty object when nothing else is in the layout
statusReason: expected { y: NaN } to strictly equal {}

[Killed] EqualityOperator
src/gridlayout/helpers/alignment-helper.ts:267:6
   if(bestX !== undefined) {
     result.x = Math.max(bestX, 0);
   }
-  if(bestY !== undefined) {
+  if(bestY === undefined) {
     result.y = Math.max(bestY, 0);
   }
killedBy: findSnapAdjustment Should snap y independently of x, on the vertical axis
statusReason: expected undefined to be +0 // Object.is equality

[Killed] MethodExpression
src/gridlayout/helpers/alignment-helper.ts:268:16
     result.x = Math.max(bestX, 0);
   }
   if(bestY !== undefined) {
-    result.y = Math.max(bestY, 0);
+    result.y = Math.min(bestY, 0);
   }
   return result;
killedBy: findSnapAdjustment Should snap on the remaining three untested y edge-combinations (top-to-bottom, bottom-to-top, bottom-to-bottom)
statusReason: expected +0 to be 5 // Object.is equality
