[Killed] ArrowFunction
src/gridlayout/helpers/compactor.ts:89:12
  * reimplementing it.
  */
 export const verticalCompactor: ICompactor = {
-  compact: (layout: TLayout, _cols: number, context: ICompactorContext): TLayout =>
-    compactLayout(layout, true, context.minPositions as Record<string | number, { y: number }> | undefined),
+  compact: () => undefined,
   type: `vertical`,
 };
killedBy: findOrGenerateResponsiveLayout Should clone, bounds-correct and compact the original layout for the new breakpoint
statusReason: expected undefined to strictly equal [ Array(2) ]

[Killed] BooleanLiteral
src/gridlayout/helpers/compactor.ts:90:27
  */
 export const verticalCompactor: ICompactor = {
   compact: (layout: TLayout, _cols: number, context: ICompactorContext): TLayout =>
-    compactLayout(layout, true, context.minPositions as Record<string | number, { y: number }> | undefined),
+    compactLayout(layout, false, context.minPositions as Record<string | number, { y: number }> | undefined),
   type: `vertical`,
 };
killedBy: findOrGenerateResponsiveLayout Should clone, bounds-correct and compact the original layout for the new breakpoint
statusReason: expected [ Array(2) ] to strictly equal [ Array(2) ]

[Killed] ObjectLiteral
src/gridlayout/helpers/compactor.ts:100:40
  * still resolve by pushing down, and (during a `restoreOnDrag`-gated
  * compaction specifically) never rise above `context.minPositions`.
  */
-export const noCompactor: ICompactor = {
-  compact: (layout: TLayout, _cols: number, context: ICompactorContext): TLayout =>
-    compactLayout(layout, false, context.minPositions as Record<string | number, { y: number }> | undefined),
-  type: `none`,
-};
+export const noCompactor: ICompactor = {};
 
 /**
killedBy: compactor.interface noCompactor Should have type "none"
statusReason: expected undefined to be 'none' // Object.is equality

[Killed] ArrowFunction
src/gridlayout/helpers/compactor.ts:101:12
  * compaction specifically) never rise above `context.minPositions`.
  */
 export const noCompactor: ICompactor = {
-  compact: (layout: TLayout, _cols: number, context: ICompactorContext): TLayout =>
-    compactLayout(layout, false, context.minPositions as Record<string | number, { y: number }> | undefined),
+  compact: () => undefined,
   type: `none`,
 };
killedBy: compactor.interface noCompactor Should produce identical results to compactLayout(layout, false) directly
statusReason: expected undefined to strictly equal [ { h: 2, i: '0', w: 2, …(3) }, …(1) ]

[Killed] BooleanLiteral
src/gridlayout/helpers/compactor.ts:102:27
  */
 export const noCompactor: ICompactor = {
   compact: (layout: TLayout, _cols: number, context: ICompactorContext): TLayout =>
-    compactLayout(layout, false, context.minPositions as Record<string | number, { y: number }> | undefined),
+    compactLayout(layout, true, context.minPositions as Record<string | number, { y: number }> | undefined),
   type: `none`,
 };
killedBy: compactor.interface noCompactor Should produce identical results to compactLayout(layout, false) directly
statusReason: expected [ { h: 2, i: '0', w: 2, …(3) }, …(1) ] to strictly equal [ { h: 2, i: '0', w: 2, …(3) }, …(1) ]

[Killed] StringLiteral
src/gridlayout/helpers/compactor.ts:103:9
 export const noCompactor: ICompactor = {
   compact: (layout: TLayout, _cols: number, context: ICompactorContext): TLayout =>
     compactLayout(layout, false, context.minPositions as Record<string | number, { y: number }> | undefined),
-  type: `none`,
+  type: ``,
 };
 
killedBy: compactor.interface noCompactor Should have type "none"
statusReason: expected '' to be 'none' // Object.is equality

[Killed] ArrowFunction
src/gridlayout/helpers/compactor.ts:116:12
  * resting layout settles).
  */
 export const horizontalCompactor: ICompactor = {
-  compact: (layout: TLayout, _cols: number, context: ICompactorContext): TLayout =>
-    compactLayoutHorizontal(layout, true, context.minPositions as Record<string | number, { x: number }> | undefined),
+  compact: () => undefined,
   type: `horizontal`,
 };
killedBy: findOrGenerateResponsiveLayout Should apply horizontal compaction when compactType is HORIZONTAL
statusReason: expected undefined to strictly equal [ Array(2) ]

[Killed] BooleanLiteral
src/gridlayout/helpers/compactor.ts:117:37
  */
 export const horizontalCompactor: ICompactor = {
   compact: (layout: TLayout, _cols: number, context: ICompactorContext): TLayout =>
-    compactLayoutHorizontal(layout, true, context.minPositions as Record<string | number, { x: number }> | undefined),
+    compactLayoutHorizontal(layout, false, context.minPositions as Record<string | number, { x: number }> | undefined),
   type: `horizontal`,
 };
killedBy: compactor.interface horizontalCompactor Should produce identical results to compactLayoutHorizontal(layout, true) directly
statusReason: expected [ …(2) ] to strictly equal [ { h: 2, i: '0', w: 1, …(3) }, …(1) ]

[Killed] StringLiteral
src/gridlayout/helpers/compactor.ts:118:9
 export const horizontalCompactor: ICompactor = {
   compact: (layout: TLayout, _cols: number, context: ICompactorContext): TLayout =>
     compactLayoutHorizontal(layout, true, context.minPositions as Record<string | number, { x: number }> | undefined),
-  type: `horizontal`,
+  type: ``,
 };
 
killedBy: compactor.interface horizontalCompactor Should have type "horizontal"
statusReason: expected '' to be 'horizontal' // Object.is equality

[Killed] ObjectLiteral
src/gridlayout/helpers/compactor.ts:128:53
  * applied to compaction specifically; items may genuinely end up
  * overlapping one another as a result.
  */
-export const verticalOverlapCompactor: ICompactor = {
-  compact: (layout: TLayout): TLayout => compactLayoutOverlapVertical(layout),
-  type: `vertical-overlap`,
-};
+export const verticalOverlapCompactor: ICompactor = {};
 
 /**
killedBy: compactor.interface verticalOverlapCompactor Should have type "vertical-overlap"
statusReason: expected undefined to be 'vertical-overlap' // Object.is equality

[Killed] ArrowFunction
src/gridlayout/helpers/compactor.ts:129:12
  * overlapping one another as a result.
  */
 export const verticalOverlapCompactor: ICompactor = {
-  compact: (layout: TLayout): TLayout => compactLayoutOverlapVertical(layout),
+  compact: () => undefined,
   type: `vertical-overlap`,
 };
killedBy: compactor.interface verticalOverlapCompactor Should produce identical results to compactLayoutOverlapVertical(layout) directly
statusReason: expected undefined to strictly equal [ { h: 2, i: '0', w: 2, …(3) }, …(1) ]

[Killed] ArrowFunction
src/gridlayout/helpers/compactor.ts:138:12
  * every non-static item moves straight to `x: 0`, ignoring collisions.
  */
 export const horizontalOverlapCompactor: ICompactor = {
-  compact: (layout: TLayout): TLayout => compactLayoutOverlapHorizontal(layout),
+  compact: () => undefined,
   type: `horizontal-overlap`,
 };
killedBy: compactor.interface horizontalOverlapCompactor Should produce identical results to compactLayoutOverlapHorizontal(layout) directly
statusReason: expected undefined to strictly equal [ { h: 2, i: '0', w: 1, …(3) }, …(1) ]

[Killed] BlockStatement
src/gridlayout/helpers/compactor.ts:152:69
  * `react-grid-layout` v2's own `getCompactor(compactType, ...)`
  * factory function.
  */
-export function getCompactor(compactType: ECompactType): ICompactor {
-  switch(compactType) {
-    case ECompactType.HORIZONTAL:
-      return horizontalCompactor;
-    case ECompactType.HORIZONTAL_OVERLAP:
-      return horizontalOverlapCompactor;
-    case ECompactType.VERTICAL_OVERLAP:
-      return verticalOverlapCompactor;
-    case ECompactType.NONE:
-      return noCompactor;
-    case ECompactType.VERTICAL:
-    default:
-      return verticalCompactor;
-  }
-}
+export function getCompactor(compactType: ECompactType): ICompactor {}
 
killedBy: compactor.interface getCompactor Should return verticalCompactor for ECompactType.VERTICAL
statusReason: expected undefined to be { compact: [Function], …(1) } // Object.is equality

[Killed] ConditionalExpression
src/gridlayout/helpers/compactor.ts:154:5
  */
 export function getCompactor(compactType: ECompactType): ICompactor {
   switch(compactType) {
-    case ECompactType.HORIZONTAL:
-      return horizontalCompactor;
+    case ECompactType.HORIZONTAL:
     case ECompactType.HORIZONTAL_OVERLAP:
       return horizontalOverlapCompactor;
killedBy: findOrGenerateResponsiveLayout Should apply horizontal compaction when compactType is HORIZONTAL
statusReason: expected [ Array(2) ] to strictly equal [ Array(2) ]

[Killed] ConditionalExpression
src/gridlayout/helpers/compactor.ts:156:5
   switch(compactType) {
     case ECompactType.HORIZONTAL:
       return horizontalCompactor;
-    case ECompactType.HORIZONTAL_OVERLAP:
-      return horizontalOverlapCompactor;
+    case ECompactType.HORIZONTAL_OVERLAP:
     case ECompactType.VERTICAL_OVERLAP:
       return verticalOverlapCompactor;
killedBy: compactor.interface getCompactor Should return horizontalOverlapCompactor for ECompactType.HORIZONTAL_OVERLAP
statusReason: expected { compact: [Function], …(1) } to be { compact: [Function], …(1) } // Object.is equality

[Killed] ConditionalExpression
src/gridlayout/helpers/compactor.ts:158:5
       return horizontalCompactor;
     case ECompactType.HORIZONTAL_OVERLAP:
       return horizontalOverlapCompactor;
-    case ECompactType.VERTICAL_OVERLAP:
-      return verticalOverlapCompactor;
+    case ECompactType.VERTICAL_OVERLAP:
     case ECompactType.NONE:
       return noCompactor;
killedBy: compactor.interface getCompactor Should return verticalOverlapCompactor for ECompactType.VERTICAL_OVERLAP
statusReason: expected { compact: [Function], type: 'none' } to be { compact: [Function], …(1) } // Object.is equality

[Killed] ConditionalExpression
src/gridlayout/helpers/compactor.ts:160:5
       return horizontalOverlapCompactor;
     case ECompactType.VERTICAL_OVERLAP:
       return verticalOverlapCompactor;
-    case ECompactType.NONE:
-      return noCompactor;
+    case ECompactType.NONE:
     case ECompactType.VERTICAL:
     default:
killedBy: compactor.interface getCompactor Should return noCompactor for ECompactType.NONE
statusReason: expected { compact: [Function], …(1) } to be { compact: [Function], type: 'none' } // Object.is equality

[Killed] ConditionalExpression
src/gridlayout/helpers/compactor.ts:163:5
     case ECompactType.NONE:
       return noCompactor;
     case ECompactType.VERTICAL:
-    default:
-      return verticalCompactor;
+    default:
   }
 }
killedBy: findOrGenerateResponsiveLayout Should clone, bounds-correct and compact the original layout for the new breakpoint
statusReason: Cannot read properties of undefined (reading 'compact')
