[Survived] StringLiteral
src/gridlayout/helpers/export-svg.ts:76:16
     backgroundColor = null,
     colNum = 12,
     containerWidth = 1200,
-    itemFill = `#eef2ff`,
+    itemFill = ``,
     itemStroke = `#c7d2fe`,
     labelColor = `#3730a3`,

[Killed] MethodExpression
src/gridlayout/helpers/export-svg.ts:86:50
   const [marginX, marginY] = margin;
   const colWidth = calcColWidth(containerWidth, marginX, colNum);
 
-  const bottomRow = layout.reduce((max, item) => Math.max(max, item.y + item.h), 0);
+  const bottomRow = layout.reduce((max, item) => Math.min(max, item.y + item.h), 0);
   const totalHeight = bottomRow > 0 ? calcGridItemWH(bottomRow, rowHeight, marginY) + marginY : marginY;
 
killedBy: exportLayoutAsSvg Should size the viewBox/height to fit the bottommost item
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain 'height="550"'

[Killed] ArrowFunction
src/gridlayout/helpers/export-svg.ts:86:35
   const [marginX, marginY] = margin;
   const colWidth = calcColWidth(containerWidth, marginX, colNum);
 
-  const bottomRow = layout.reduce((max, item) => Math.max(max, item.y + item.h), 0);
+  const bottomRow = layout.reduce(() => undefined, 0);
   const totalHeight = bottomRow > 0 ? calcGridItemWH(bottomRow, rowHeight, marginY) + marginY : marginY;
 
killedBy: exportLayoutAsSvg Should size the viewBox/height to fit the bottommost item
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain 'height="550"'

[Killed] ArithmeticOperator
src/gridlayout/helpers/export-svg.ts:87:39
   const colWidth = calcColWidth(containerWidth, marginX, colNum);
 
   const bottomRow = layout.reduce((max, item) => Math.max(max, item.y + item.h), 0);
-  const totalHeight = bottomRow > 0 ? calcGridItemWH(bottomRow, rowHeight, marginY) + marginY : marginY;
+  const totalHeight = bottomRow > 0 ? calcGridItemWH(bottomRow, rowHeight, marginY) - marginY : marginY;
 
   const escapeXml = (value: string): string =>
killedBy: exportLayoutAsSvg Should size the viewBox/height to fit the bottommost item
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain 'height="550"'

[Killed] EqualityOperator
src/gridlayout/helpers/export-svg.ts:87:23
   const colWidth = calcColWidth(containerWidth, marginX, colNum);
 
   const bottomRow = layout.reduce((max, item) => Math.max(max, item.y + item.h), 0);
-  const totalHeight = bottomRow > 0 ? calcGridItemWH(bottomRow, rowHeight, marginY) + marginY : marginY;
+  const totalHeight = bottomRow >= 0 ? calcGridItemWH(bottomRow, rowHeight, marginY) + marginY : marginY;
 
   const escapeXml = (value: string): string =>
killedBy: exportLayoutAsSvg Should produce a valid, empty SVG document for an empty layout
statusReason: Invalid gridUnits parameter passed

[Killed] ArrowFunction
src/gridlayout/helpers/export-svg.ts:89:21
   const bottomRow = layout.reduce((max, item) => Math.max(max, item.y + item.h), 0);
   const totalHeight = bottomRow > 0 ? calcGridItemWH(bottomRow, rowHeight, marginY) + marginY : marginY;
 
-  const escapeXml = (value: string): string =>
-    value.replace(/&/g, `&amp;`).replace(/</g, `&lt;`).replace(/>/g, `&gt;`).replace(/"/g, `&quot;`);
+  const escapeXml = () => undefined;
 
   const rects = layout
killedBy: exportLayoutAsSvg Should render a rectangle and label for each item
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain '>0</text>'

[Killed] StringLiteral
src/gridlayout/helpers/export-svg.ts:90:70
   const totalHeight = bottomRow > 0 ? calcGridItemWH(bottomRow, rowHeight, marginY) + marginY : marginY;
 
   const escapeXml = (value: string): string =>
-    value.replace(/&/g, `&amp;`).replace(/</g, `&lt;`).replace(/>/g, `&gt;`).replace(/"/g, `&quot;`);
+    value.replace(/&/g, `&amp;`).replace(/</g, `&lt;`).replace(/>/g, ``).replace(/"/g, `&quot;`);
 
   const rects = layout
killedBy: exportLayoutAsSvg Should escape XML-unsafe characters in item ids
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain '&lt;script&gt;'

[Killed] BlockStatement
src/gridlayout/helpers/export-svg.ts:93:18
     value.replace(/&/g, `&amp;`).replace(/</g, `&lt;`).replace(/>/g, `&gt;`).replace(/"/g, `&quot;`);
 
   const rects = layout
-    .map(item => {
-      const pixelX = colWidth * item.x + (item.x + 1) * marginX;
-      const pixelY = rowHeight * item.y + (item.y + 1) * marginY;
-      const pixelW = calcGridItemWH(item.w, colWidth, marginX);
-      const pixelH = calcGridItemWH(item.h, rowHeight, marginY);
-      const label = escapeXml(String(item.i));
-
-      return [
-        `<rect x="${pixelX}" y="${pixelY}" width="${pixelW}" height="${pixelH}"`,
-        ` fill="${itemFill}" stroke="${itemStroke}" stroke-width="1" rx="8" ry="8" />`,
-        `<text x="${pixelX + pixelW / 2}" y="${pixelY + pixelH / 2}" fill="${labelColor}"`,
-        ` font-family="sans-serif" font-size="13" text-anchor="middle" dominant-baseline="middle">${label}</text>`,
-      ].join(``);
-    })
+    .map(item => {})
     .join(``);
 
killedBy: exportLayoutAsSvg Should render a rectangle and label for each item
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/gridlayout/helpers/export-svg.ts:94:43
 
   const rects = layout
     .map(item => {
-      const pixelX = colWidth * item.x + (item.x + 1) * marginX;
+      const pixelX = colWidth * item.x + (item.x - 1) * marginX;
       const pixelY = rowHeight * item.y + (item.y + 1) * marginY;
       const pixelW = calcGridItemWH(item.w, colWidth, marginX);
killedBy: exportLayoutAsSvg Should compute exact pixel x/y/width/height for a non-zero position — not just x:0 (every other test in this file only ever uses x:0, and the "viewBox" test above only checks the agg
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain 'x="210" y="490" width="190" height="3…'

[Killed] ArithmeticOperator
src/gridlayout/helpers/export-svg.ts:94:22
 
   const rects = layout
     .map(item => {
-      const pixelX = colWidth * item.x + (item.x + 1) * marginX;
+      const pixelX = colWidth * item.x - (item.x + 1) * marginX;
       const pixelY = rowHeight * item.y + (item.y + 1) * marginY;
       const pixelW = calcGridItemWH(item.w, colWidth, marginX);
killedBy: exportLayoutAsSvg Should compute exact pixel x/y/width/height for a non-zero position — not just x:0 (every other test in this file only ever uses x:0, and the "viewBox" test above only checks the agg
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain 'x="210" y="490" width="190" height="3…'

[Killed] ArithmeticOperator
src/gridlayout/helpers/export-svg.ts:95:22
   const rects = layout
     .map(item => {
       const pixelX = colWidth * item.x + (item.x + 1) * marginX;
-      const pixelY = rowHeight * item.y + (item.y + 1) * marginY;
+      const pixelY = rowHeight / item.y + (item.y + 1) * marginY;
       const pixelW = calcGridItemWH(item.w, colWidth, marginX);
       const pixelH = calcGridItemWH(item.h, rowHeight, marginY);
killedBy: exportLayoutAsSvg Should compute exact pixel x/y/width/height for a non-zero position — not just x:0 (every other test in this file only ever uses x:0, and the "viewBox" test above only checks the agg
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain 'x="210" y="490" width="190" height="3…'

[Killed] ArithmeticOperator
src/gridlayout/helpers/export-svg.ts:95:44
   const rects = layout
     .map(item => {
       const pixelX = colWidth * item.x + (item.x + 1) * marginX;
-      const pixelY = rowHeight * item.y + (item.y + 1) * marginY;
+      const pixelY = rowHeight * item.y + (item.y - 1) * marginY;
       const pixelW = calcGridItemWH(item.w, colWidth, marginX);
       const pixelH = calcGridItemWH(item.h, rowHeight, marginY);
killedBy: exportLayoutAsSvg Should compute exact pixel x/y/width/height for a non-zero position — not just x:0 (every other test in this file only ever uses x:0, and the "viewBox" test above only checks the agg
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain 'x="210" y="490" width="190" height="3…'

[Killed] StringLiteral
src/gridlayout/helpers/export-svg.ts:101:9
       const label = escapeXml(String(item.i));
 
       return [
-        `<rect x="${pixelX}" y="${pixelY}" width="${pixelW}" height="${pixelH}"`,
+        ``,
         ` fill="${itemFill}" stroke="${itemStroke}" stroke-width="1" rx="8" ry="8" />`,
         `<text x="${pixelX + pixelW / 2}" y="${pixelY + pixelH / 2}" fill="${labelColor}"`,
killedBy: exportLayoutAsSvg Should render a rectangle and label for each item
statusReason: expected +0 to be 2 // Object.is equality

[Killed] StringLiteral
src/gridlayout/helpers/export-svg.ts:102:9
 
       return [
         `<rect x="${pixelX}" y="${pixelY}" width="${pixelW}" height="${pixelH}"`,
-        ` fill="${itemFill}" stroke="${itemStroke}" stroke-width="1" rx="8" ry="8" />`,
+        ``,
         `<text x="${pixelX + pixelW / 2}" y="${pixelY + pixelH / 2}" fill="${labelColor}"`,
         ` font-family="sans-serif" font-size="13" text-anchor="middle" dominant-baseline="middle">${label}</text>`,
killedBy: exportLayoutAsSvg Should use the custom itemFill/itemStroke/labelColor option values, not just the defaults
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain 'fill="#123456"'

[Killed] ArithmeticOperator
src/gridlayout/helpers/export-svg.ts:103:48
       return [
         `<rect x="${pixelX}" y="${pixelY}" width="${pixelW}" height="${pixelH}"`,
         ` fill="${itemFill}" stroke="${itemStroke}" stroke-width="1" rx="8" ry="8" />`,
-        `<text x="${pixelX + pixelW / 2}" y="${pixelY + pixelH / 2}" fill="${labelColor}"`,
+        `<text x="${pixelX + pixelW / 2}" y="${pixelY - pixelH / 2}" fill="${labelColor}"`,
         ` font-family="sans-serif" font-size="13" text-anchor="middle" dominant-baseline="middle">${label}</text>`,
       ].join(``);
killedBy: exportLayoutAsSvg Should center the label's own x/y at the item rect's center point (pixelX + pixelW/2, pixelY + pixelH/2)
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain '<text x="105" y="165"'

[Killed] ArithmeticOperator
src/gridlayout/helpers/export-svg.ts:103:30
       return [
         `<rect x="${pixelX}" y="${pixelY}" width="${pixelW}" height="${pixelH}"`,
         ` fill="${itemFill}" stroke="${itemStroke}" stroke-width="1" rx="8" ry="8" />`,
-        `<text x="${pixelX + pixelW / 2}" y="${pixelY + pixelH / 2}" fill="${labelColor}"`,
+        `<text x="${pixelX + pixelW * 2}" y="${pixelY + pixelH / 2}" fill="${labelColor}"`,
         ` font-family="sans-serif" font-size="13" text-anchor="middle" dominant-baseline="middle">${label}</text>`,
       ].join(``);
killedBy: exportLayoutAsSvg Should center the label's own x/y at the item rect's center point (pixelX + pixelW/2, pixelY + pixelH/2)
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain '<text x="105" y="165"'

[Survived] StringLiteral
src/gridlayout/helpers/export-svg.ts:109:106
     })
     .join(``);
 
-  const background = backgroundColor ? `<rect width="100%" height="100%" fill="${backgroundColor}" />` : ``;
+  const background = backgroundColor ? `<rect width="100%" height="100%" fill="${backgroundColor}" />` : `Stryker was here!`;
 
   return `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 ${containerWidth} ${totalHeight}" width="${containerWidth}" height="${totalHeight}">${background}${rects}</svg>`;
