[Survived] ArithmeticOperator
src/gridlayout/helpers/move-helper.ts:203:46
     [EMovingDirections.LEFT]: [itemToMove.x + collidesWith.w, collidesWith.y],
     [EMovingDirections.RIGHT]: [itemToMove.x - collidesWith.w, collidesWith.y],
     [EMovingDirections.UP]: [itemToMove.x, itemToMove.y + collidesWith.h],
-    [EMovingDirections.DOWN]: [itemToMove.x, itemToMove.y - collidesWith.h],
+    [EMovingDirections.DOWN]: [itemToMove.x, itemToMove.y + collidesWith.h],
   };
 

[Survived] ArrayDeclaration
src/gridlayout/helpers/move-helper.ts:203:31
     [EMovingDirections.LEFT]: [itemToMove.x + collidesWith.w, collidesWith.y],
     [EMovingDirections.RIGHT]: [itemToMove.x - collidesWith.w, collidesWith.y],
     [EMovingDirections.UP]: [itemToMove.x, itemToMove.y + collidesWith.h],
-    [EMovingDirections.DOWN]: [itemToMove.x, itemToMove.y - collidesWith.h],
+    [EMovingDirections.DOWN]: [],
   };
 

[Killed] ConditionalExpression
src/gridlayout/helpers/move-helper.ts:206:6
     [EMovingDirections.DOWN]: [itemToMove.x, itemToMove.y - collidesWith.h],
   };
 
-  if(horizontalShift) {
+  if(false) {
     const horizontalDirection =
       movingDirection === EMovingDirections.LEFT || movingDirection === EMovingDirections.RIGHT;
killedBy: moveElement Should shift a colliding item horizontally when horizontalShift is enabled
statusReason: expected [ { i: 'a', x: 1, y: +0, …(3) }, …(1) ] to strictly equal [ { i: 'a', x: 1, y: +0, …(3) }, …(1) ]

[Killed] ConditionalExpression
src/gridlayout/helpers/move-helper.ts:206:6
     [EMovingDirections.DOWN]: [itemToMove.x, itemToMove.y - collidesWith.h],
   };
 
-  if(horizontalShift) {
+  if(true) {
     const horizontalDirection =
       movingDirection === EMovingDirections.LEFT || movingDirection === EMovingDirections.RIGHT;
killedBy: moveElement Should push the moved item itself away when it collides with a static item, not the other way around — confirmed gap via a fresh coverage report
statusReason: expected { i: 'a', x: 2, y: +0, w: 2, …(2) } to match object { x: +0, y: 1 }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/gridlayout/helpers/move-helper.ts:208:53
 
   if(horizontalShift) {
     const horizontalDirection =
-      movingDirection === EMovingDirections.LEFT || movingDirection === EMovingDirections.RIGHT;
+      movingDirection === EMovingDirections.LEFT || false;
 
     if(
killedBy: moveElementAwayFromCollision Should fall back to the default drop position when the colliding item is narrower and offset (horizontalShift)
statusReason: Invalid parameter values passed

[Killed] LogicalOperator
src/gridlayout/helpers/move-helper.ts:208:7
 
   if(horizontalShift) {
     const horizontalDirection =
-      movingDirection === EMovingDirections.LEFT || movingDirection === EMovingDirections.RIGHT;
+      movingDirection === EMovingDirections.LEFT && movingDirection === EMovingDirections.RIGHT;
 
     if(
killedBy: moveElementAwayFromCollision Should fall back to the default drop position when the colliding item is narrower and offset (horizontalShift)
statusReason: Invalid parameter values passed

[Killed] LogicalOperator
src/gridlayout/helpers/move-helper.ts:211:7
       movingDirection === EMovingDirections.LEFT || movingDirection === EMovingDirections.RIGHT;
 
     if(
-      movingDirection in movingCordsData &&
-      !(horizontalDirection && collidesWith.w < itemToMove.w && collidesWith.x !== itemToMove.x)
+      movingDirection in movingCordsData || !(horizontalDirection && collidesWith.w < itemToMove.w && collidesWith.x !== itemToMove.x)
     ) {
       const [x, y] = movingCordsData[movingDirection];
killedBy: moveElementAwayFromCollision Should fall back to the default drop position when the colliding item is narrower and offset (horizontalShift)
statusReason: Invalid parameter values passed

[Killed] ConditionalExpression
src/gridlayout/helpers/move-helper.ts:211:7
       movingDirection === EMovingDirections.LEFT || movingDirection === EMovingDirections.RIGHT;
 
     if(
-      movingDirection in movingCordsData &&
-      !(horizontalDirection && collidesWith.w < itemToMove.w && collidesWith.x !== itemToMove.x)
+      false
     ) {
       const [x, y] = movingCordsData[movingDirection];
killedBy: moveElement Should shift a colliding item horizontally when horizontalShift is enabled
statusReason: expected [ { i: 'a', x: 1, y: +0, …(3) }, …(1) ] to strictly equal [ { i: 'a', x: 1, y: +0, …(3) }, …(1) ]

[Killed] ConditionalExpression
src/gridlayout/helpers/move-helper.ts:212:9
 
     if(
       movingDirection in movingCordsData &&
-      !(horizontalDirection && collidesWith.w < itemToMove.w && collidesWith.x !== itemToMove.x)
+      !(false)
     ) {
       const [x, y] = movingCordsData[movingDirection];
killedBy: moveElementAwayFromCollision Should fall back to the default drop position when the colliding item is narrower and offset (horizontalShift)
statusReason: Invalid parameter values passed

[Killed] EqualityOperator
src/gridlayout/helpers/move-helper.ts:212:65
 
     if(
       movingDirection in movingCordsData &&
-      !(horizontalDirection && collidesWith.w < itemToMove.w && collidesWith.x !== itemToMove.x)
+      !(horizontalDirection && collidesWith.w < itemToMove.w && collidesWith.x === itemToMove.x)
     ) {
       const [x, y] = movingCordsData[movingDirection];
killedBy: moveElementAwayFromCollision Should fall back to the default drop position when the colliding item is narrower and offset (horizontalShift)
statusReason: Invalid parameter values passed

[Killed] BlockStatement
src/gridlayout/helpers/move-helper.ts:213:7
     if(
       movingDirection in movingCordsData &&
       !(horizontalDirection && collidesWith.w < itemToMove.w && collidesWith.x !== itemToMove.x)
-    ) {
-      const [x, y] = movingCordsData[movingDirection];
-
-      movingCordsData.$default.x = x;
-      movingCordsData.$default.y = y;
-    }
+    ) {}
   }
 
killedBy: moveElement Should shift a colliding item horizontally when horizontalShift is enabled
statusReason: expected [ { i: 'a', x: 1, y: +0, …(3) }, …(1) ] to strictly equal [ { i: 'a', x: 1, y: +0, …(3) }, …(1) ]
