[Killed] BlockStatement
src/gridlayout/helpers/responsive-helper.ts:40:15
   cols: number,
   compactType: ECompactType,
   distributeEvenly: boolean,
-): TLayout => {
-  // we cant return the layouts[breakpoints] directly because we don't know whether user change the layout or not
-
-  // Find or generate the next layout
-  const layout = cloneLayout(orgLayout || []);
-  const bounded = correctBounds(layout, { cols }, distributeEvenly);
-
-  return getCompactor(compactType).compact(bounded, cols, { compactType });
-};
+): TLayout => {};
 
killedBy: findOrGenerateResponsiveLayout Should clone, bounds-correct and compact the original layout for the new breakpoint
statusReason: expected undefined to strictly equal [ Array(2) ]

[Killed] ConditionalExpression
src/gridlayout/helpers/responsive-helper.ts:44:30
   // we cant return the layouts[breakpoints] directly because we don't know whether user change the layout or not
 
   // Find or generate the next layout
-  const layout = cloneLayout(orgLayout || []);
+  const layout = cloneLayout(false);
   const bounded = correctBounds(layout, { cols }, distributeEvenly);
 
killedBy: findOrGenerateResponsiveLayout Should clone, bounds-correct and compact the original layout for the new breakpoint
statusReason: Cannot read properties of undefined (reading 'isStatic')

[Killed] ConditionalExpression
src/gridlayout/helpers/responsive-helper.ts:44:30
   // we cant return the layouts[breakpoints] directly because we don't know whether user change the layout or not
 
   // Find or generate the next layout
-  const layout = cloneLayout(orgLayout || []);
+  const layout = cloneLayout(true);
   const bounded = correctBounds(layout, { cols }, distributeEvenly);
 
killedBy: findOrGenerateResponsiveLayout Should clone, bounds-correct and compact the original layout for the new breakpoint
statusReason: Cannot read properties of undefined (reading 'isStatic')

[Survived] ObjectLiteral
src/gridlayout/helpers/responsive-helper.ts:47:59
   const layout = cloneLayout(orgLayout || []);
   const bounded = correctBounds(layout, { cols }, distributeEvenly);
 
-  return getCompactor(compactType).compact(bounded, cols, { compactType });
+  return getCompactor(compactType).compact(bounded, cols, {});
 };
 
