[Killed] BlockStatement
src/gridlayout/helpers/sort-helper.ts:11:67
  * @param  {TLayout} layout   Array of layout objects.
  * @return {TLayout}          A new, sorted array (does not mutate `layout`).
  */
-export function sortLayoutItemsByRowCol(layout: TLayout): TLayout {
-  const a: ILayoutItem[] = [];
-  return a.concat(layout).sort((itemA, itemB) => {
-    if(itemA.y === itemB.y && itemA.x === itemB.x) {
-      return 0;
-    }
-
-    if(itemA.y > itemB.y || (itemA.y === itemB.y && itemA.x > itemB.x)) {
-      return 1;
-    }
-
-    return -1;
-  });
-}
+export function sortLayoutItemsByRowCol(layout: TLayout): TLayout {}
 
 /**
killedBy: moveElement Should return
statusReason: Cannot read properties of undefined (reading 'reverse')

[Killed] ArrayDeclaration
src/gridlayout/helpers/sort-helper.ts:12:28
  * @return {TLayout}          A new, sorted array (does not mutate `layout`).
  */
 export function sortLayoutItemsByRowCol(layout: TLayout): TLayout {
-  const a: ILayoutItem[] = [];
+  const a: ILayoutItem[] = ["Stryker was here"];
   return a.concat(layout).sort((itemA, itemB) => {
     if(itemA.y === itemB.y && itemA.x === itemB.x) {
killedBy: findOrGenerateResponsiveLayout Should clone, bounds-correct and compact the original layout for the new breakpoint
statusReason: Cannot create property 'y' on string 'Stryker was here'

[Killed] BlockStatement
src/gridlayout/helpers/sort-helper.ts:13:50
  */
 export function sortLayoutItemsByRowCol(layout: TLayout): TLayout {
   const a: ILayoutItem[] = [];
-  return a.concat(layout).sort((itemA, itemB) => {
-    if(itemA.y === itemB.y && itemA.x === itemB.x) {
-      return 0;
-    }
-
-    if(itemA.y > itemB.y || (itemA.y === itemB.y && itemA.x > itemB.x)) {
-      return 1;
-    }
-
-    return -1;
-  });
+  return a.concat(layout).sort((itemA, itemB) => {});
 }
 
killedBy: sortLayoutItemsByRowCol Should return correct sorted layout
statusReason: expected [ …(8) ] to strictly equal [ …(8) ]

[Killed] MethodExpression
src/gridlayout/helpers/sort-helper.ts:13:10
  */
 export function sortLayoutItemsByRowCol(layout: TLayout): TLayout {
   const a: ILayoutItem[] = [];
-  return a.concat(layout).sort((itemA, itemB) => {
-    if(itemA.y === itemB.y && itemA.x === itemB.x) {
-      return 0;
-    }
-
-    if(itemA.y > itemB.y || (itemA.y === itemB.y && itemA.x > itemB.x)) {
-      return 1;
-    }
-
-    return -1;
-  });
+  return a.concat(layout);
 }
 
killedBy: sortLayoutItemsByRowCol Should return correct sorted layout
statusReason: expected [ …(8) ] to strictly equal [ …(8) ]

[Killed] ConditionalExpression
src/gridlayout/helpers/sort-helper.ts:14:8
 export function sortLayoutItemsByRowCol(layout: TLayout): TLayout {
   const a: ILayoutItem[] = [];
   return a.concat(layout).sort((itemA, itemB) => {
-    if(itemA.y === itemB.y && itemA.x === itemB.x) {
+    if(true && itemA.x === itemB.x) {
       return 0;
     }
killedBy: sortLayoutItemsByRowCol Should return correct sorted layout
statusReason: expected [ …(8) ] to strictly equal [ …(8) ]

[Killed] ConditionalExpression
src/gridlayout/helpers/sort-helper.ts:14:8
 export function sortLayoutItemsByRowCol(layout: TLayout): TLayout {
   const a: ILayoutItem[] = [];
   return a.concat(layout).sort((itemA, itemB) => {
-    if(itemA.y === itemB.y && itemA.x === itemB.x) {
+    if(true) {
       return 0;
     }
killedBy: sortLayoutItemsByRowCol Should return correct sorted layout
statusReason: expected [ …(8) ] to strictly equal [ …(8) ]

[Killed] EqualityOperator
src/gridlayout/helpers/sort-helper.ts:18:8
       return 0;
     }
 
-    if(itemA.y > itemB.y || (itemA.y === itemB.y && itemA.x > itemB.x)) {
+    if(itemA.y <= itemB.y || (itemA.y === itemB.y && itemA.x > itemB.x)) {
       return 1;
     }
killedBy: compactor.interface noCompactor Should still resolve an actual collision by pushing down, not leave items overlapping
statusReason: expected 1 to be greater than or equal to 4

[Killed] EqualityOperator
src/gridlayout/helpers/sort-helper.ts:18:8
       return 0;
     }
 
-    if(itemA.y > itemB.y || (itemA.y === itemB.y && itemA.x > itemB.x)) {
+    if(itemA.y >= itemB.y || (itemA.y === itemB.y && itemA.x > itemB.x)) {
       return 1;
     }
killedBy: sortLayoutItemsByRowCol Should return correct sorted layout
statusReason: expected [ …(8) ] to strictly equal [ …(8) ]

[Killed] UnaryOperator
src/gridlayout/helpers/sort-helper.ts:22:12
       return 1;
     }
 
-    return -1;
+    return +1;
   });
 }
killedBy: sortLayoutItemsByRowCol Should return correct sorted layout
statusReason: expected [ …(8) ] to strictly equal [ …(8) ]

[Killed] BlockStatement
src/gridlayout/helpers/sort-helper.ts:39:67
  * @param  {TLayout} layout   Array of layout objects.
  * @return {TLayout}          A new, sorted array (does not mutate `layout`).
  */
-export function sortLayoutItemsByColRow(layout: TLayout): TLayout {
-  const a: ILayoutItem[] = [];
-  return a.concat(layout).sort((itemA, itemB) => {
-    if(itemA.x === itemB.x && itemA.y === itemB.y) {
-      return 0;
-    }
-
-    if(itemA.x > itemB.x || (itemA.x === itemB.x && itemA.y > itemB.y)) {
-      return 1;
-    }
-
-    return -1;
-  });
-}
+export function sortLayoutItemsByColRow(layout: TLayout): TLayout {}
 
killedBy: sortLayoutItemsByColRow Should return correct sorted layout, leftmost column first, then top-to-bottom within a column
statusReason: expected undefined to strictly equal [ …(8) ]

[Killed] ArrayDeclaration
src/gridlayout/helpers/sort-helper.ts:40:28
  * @return {TLayout}          A new, sorted array (does not mutate `layout`).
  */
 export function sortLayoutItemsByColRow(layout: TLayout): TLayout {
-  const a: ILayoutItem[] = [];
+  const a: ILayoutItem[] = ["Stryker was here"];
   return a.concat(layout).sort((itemA, itemB) => {
     if(itemA.x === itemB.x && itemA.y === itemB.y) {
killedBy: findOrGenerateResponsiveLayout Should apply horizontal compaction when compactType is HORIZONTAL
statusReason: Cannot create property 'x' on string 'Stryker was here'

[Killed] MethodExpression
src/gridlayout/helpers/sort-helper.ts:41:10
  */
 export function sortLayoutItemsByColRow(layout: TLayout): TLayout {
   const a: ILayoutItem[] = [];
-  return a.concat(layout).sort((itemA, itemB) => {
-    if(itemA.x === itemB.x && itemA.y === itemB.y) {
-      return 0;
-    }
-
-    if(itemA.x > itemB.x || (itemA.x === itemB.x && itemA.y > itemB.y)) {
-      return 1;
-    }
-
-    return -1;
-  });
+  return a.concat(layout);
 }
 
killedBy: sortLayoutItemsByColRow Should return correct sorted layout, leftmost column first, then top-to-bottom within a column
statusReason: expected [ …(8) ] to strictly equal [ …(8) ]

[Killed] BlockStatement
src/gridlayout/helpers/sort-helper.ts:41:50
  */
 export function sortLayoutItemsByColRow(layout: TLayout): TLayout {
   const a: ILayoutItem[] = [];
-  return a.concat(layout).sort((itemA, itemB) => {
-    if(itemA.x === itemB.x && itemA.y === itemB.y) {
-      return 0;
-    }
-
-    if(itemA.x > itemB.x || (itemA.x === itemB.x && itemA.y > itemB.y)) {
-      return 1;
-    }
-
-    return -1;
-  });
+  return a.concat(layout).sort((itemA, itemB) => {});
 }
 
killedBy: sortLayoutItemsByColRow Should return correct sorted layout, leftmost column first, then top-to-bottom within a column
statusReason: expected [ …(8) ] to strictly equal [ …(8) ]

[Killed] BlockStatement
src/gridlayout/helpers/sort-helper.ts:42:52
 export function sortLayoutItemsByColRow(layout: TLayout): TLayout {
   const a: ILayoutItem[] = [];
   return a.concat(layout).sort((itemA, itemB) => {
-    if(itemA.x === itemB.x && itemA.y === itemB.y) {
-      return 0;
-    }
+    if(itemA.x === itemB.x && itemA.y === itemB.y) {}
 
     if(itemA.x > itemB.x || (itemA.x === itemB.x && itemA.y > itemB.y)) {
killedBy: sortLayoutItemsByColRow Should return correct sorted layout when layout items share the exact same x and y (the tie-case branch)
statusReason: expected [ …(3) ] to strictly equal [ …(3) ]

[Killed] EqualityOperator
src/gridlayout/helpers/sort-helper.ts:42:8
 export function sortLayoutItemsByColRow(layout: TLayout): TLayout {
   const a: ILayoutItem[] = [];
   return a.concat(layout).sort((itemA, itemB) => {
-    if(itemA.x === itemB.x && itemA.y === itemB.y) {
+    if(itemA.x !== itemB.x && itemA.y === itemB.y) {
       return 0;
     }
killedBy: compactLayoutHorizontal Should process items leftmost-first, so a later item settles against an earlier one already placed to its left
statusReason: expected [ Array(2) ] to strictly equal [ { i: 'a', x: 2, y: +0, …(3) }, …(1) ]

[Killed] LogicalOperator
src/gridlayout/helpers/sort-helper.ts:46:30
       return 0;
     }
 
-    if(itemA.x > itemB.x || (itemA.x === itemB.x && itemA.y > itemB.y)) {
+    if(itemA.x > itemB.x || (itemA.x === itemB.x || itemA.y > itemB.y)) {
       return 1;
     }
killedBy: sortLayoutItemsByColRow Should return correct sorted layout, leftmost column first, then top-to-bottom within a column
statusReason: expected [ …(8) ] to strictly equal [ …(8) ]

[Killed] LogicalOperator
src/gridlayout/helpers/sort-helper.ts:46:8
       return 0;
     }
 
-    if(itemA.x > itemB.x || (itemA.x === itemB.x && itemA.y > itemB.y)) {
+    if(itemA.x > itemB.x && itemA.x === itemB.x && itemA.y > itemB.y) {
       return 1;
     }
killedBy: sortLayoutItemsByColRow Should return correct sorted layout, leftmost column first, then top-to-bottom within a column
statusReason: expected [ …(8) ] to strictly equal [ …(8) ]
