[Killed] BlockStatement
src/helpers/draggable-utils.ts:8:38
  * @param num       The number to validate.
  * @returns boolean If the param is a real number it returns true, if not it returns false.
  */
-function isNum(num: number): boolean {
-  return !Number.isNaN(num);
-}
+function isNum(num: number): boolean {}
 
 /**
killedBy: createCoreData Should compute deltas against the last known position on subsequent moves
statusReason: expected { deltaX: +0, deltaY: +0, …(4) } to strictly equal { deltaX: 5, deltaY: 6, …(4) }

[Killed] BooleanLiteral
src/helpers/draggable-utils.ts:9:10
  * @returns boolean If the param is a real number it returns true, if not it returns false.
  */
 function isNum(num: number): boolean {
-  return !Number.isNaN(num);
+  return Number.isNaN(num);
 }
 
killedBy: createCoreData Should return zero deltas and use x/y as last coords on the first move
statusReason: expected { deltaX: NaN, deltaY: NaN, …(4) } to strictly equal { deltaX: +0, deltaY: +0, …(4) }

[Killed] BlockStatement
src/helpers/draggable-utils.ts:34:117
  *
  * @param evt The mouse (or native drag/resize) event to read the position from.
  */
-export function offsetXYFromParentOf(evt: { target: EventTarget | null; clientX: number; clientY: number }): IPoint {
-  const t = evt.target as HTMLElement;
-  const offsetParent = t.offsetParent || document.body;
-  const offsetParentRect =
-    t.offsetParent === document.body
-      ? {
-        left: 0,
-        top: 0,
-      }
-      : offsetParent.getBoundingClientRect();
-
-  const x = evt.clientX + offsetParent.scrollLeft - offsetParentRect.left;
-  const y = evt.clientY + offsetParent.scrollTop - offsetParentRect.top;
-
-  /* const x = Math.round(evt.clientX + offsetParent.scrollLeft - offsetParentRect.left);
-  const y = Math.round(evt.clientY + offsetParent.scrollTop - offsetParentRect.top); */
-
-  return {
-    x,
-    y,
-  };
-}
+export function offsetXYFromParentOf(evt: { target: EventTarget | null; clientX: number; clientY: number }): IPoint {}
 
 /** Position delta between two consecutive drag/resize ticks, as computed by {@link createCoreData}. */
killedBy: offsetXYFromParentOf Should ignore the actual bounding rect when the target's offsetParent is literally document.body
statusReason: expected undefined to strictly equal { x: 50, y: 40 }

[Killed] ConditionalExpression
src/helpers/draggable-utils.ts:36:24
  */
 export function offsetXYFromParentOf(evt: { target: EventTarget | null; clientX: number; clientY: number }): IPoint {
   const t = evt.target as HTMLElement;
-  const offsetParent = t.offsetParent || document.body;
+  const offsetParent = true;
   const offsetParentRect =
     t.offsetParent === document.body
killedBy: offsetXYFromParentOf Should ignore the actual bounding rect when the target's offsetParent is literally document.body
statusReason: expected { x: NaN, y: NaN } to strictly equal { x: 50, y: 40 }

[Killed] ConditionalExpression
src/helpers/draggable-utils.ts:36:24
  */
 export function offsetXYFromParentOf(evt: { target: EventTarget | null; clientX: number; clientY: number }): IPoint {
   const t = evt.target as HTMLElement;
-  const offsetParent = t.offsetParent || document.body;
+  const offsetParent = false;
   const offsetParentRect =
     t.offsetParent === document.body
killedBy: offsetXYFromParentOf Should ignore the actual bounding rect when the target's offsetParent is literally document.body
statusReason: expected { x: NaN, y: NaN } to strictly equal { x: 50, y: 40 }

[Killed] EqualityOperator
src/helpers/draggable-utils.ts:38:5
   const t = evt.target as HTMLElement;
   const offsetParent = t.offsetParent || document.body;
   const offsetParentRect =
-    t.offsetParent === document.body
+    t.offsetParent !== document.body
       ? {
         left: 0,
killedBy: offsetXYFromParentOf Should ignore the actual bounding rect when the target's offsetParent is literally document.body
statusReason: expected { x: -949, y: -959 } to strictly equal { x: 50, y: 40 }

[Killed] ConditionalExpression
src/helpers/draggable-utils.ts:38:5
   const t = evt.target as HTMLElement;
   const offsetParent = t.offsetParent || document.body;
   const offsetParentRect =
-    t.offsetParent === document.body
+    false
       ? {
         left: 0,
killedBy: offsetXYFromParentOf Should ignore the actual bounding rect when the target's offsetParent is literally document.body
statusReason: expected { x: -949, y: -959 } to strictly equal { x: 50, y: 40 }

[Killed] ArithmeticOperator
src/helpers/draggable-utils.ts:45:13
       }
       : offsetParent.getBoundingClientRect();
 
-  const x = evt.clientX + offsetParent.scrollLeft - offsetParentRect.left;
+  const x = evt.clientX - offsetParent.scrollLeft - offsetParentRect.left;
   const y = evt.clientY + offsetParent.scrollTop - offsetParentRect.top;
 
killedBy: offsetXYFromParentOf Should offset against the parent's bounding rect and scroll position when offsetParent is a real element
statusReason: expected { x: 87, y: 77 } to strictly equal { x: 93, y: 77 }

[Killed] ArithmeticOperator
src/helpers/draggable-utils.ts:45:13
       }
       : offsetParent.getBoundingClientRect();
 
-  const x = evt.clientX + offsetParent.scrollLeft - offsetParentRect.left;
+  const x = evt.clientX + offsetParent.scrollLeft + offsetParentRect.left;
   const y = evt.clientY + offsetParent.scrollTop - offsetParentRect.top;
 
killedBy: offsetXYFromParentOf Should fall back to document.body and read its bounding rect when the target has no offsetParent
statusReason: expected { x: 58, y: 37 } to strictly equal { x: 42, y: 37 }

[Killed] ArithmeticOperator
src/helpers/draggable-utils.ts:46:13
       : offsetParent.getBoundingClientRect();
 
   const x = evt.clientX + offsetParent.scrollLeft - offsetParentRect.left;
-  const y = evt.clientY + offsetParent.scrollTop - offsetParentRect.top;
+  const y = evt.clientY + offsetParent.scrollTop + offsetParentRect.top;
 
   /* const x = Math.round(evt.clientX + offsetParent.scrollLeft - offsetParentRect.left);
killedBy: offsetXYFromParentOf Should fall back to document.body and read its bounding rect when the target has no offsetParent
statusReason: expected { x: 42, y: 43 } to strictly equal { x: 42, y: 37 }

[Killed] ArithmeticOperator
src/helpers/draggable-utils.ts:46:13
       : offsetParent.getBoundingClientRect();
 
   const x = evt.clientX + offsetParent.scrollLeft - offsetParentRect.left;
-  const y = evt.clientY + offsetParent.scrollTop - offsetParentRect.top;
+  const y = evt.clientY - offsetParent.scrollTop - offsetParentRect.top;
 
   /* const x = Math.round(evt.clientX + offsetParent.scrollLeft - offsetParentRect.left);
killedBy: offsetXYFromParentOf Should offset against the parent's bounding rect and scroll position when offsetParent is a real element
statusReason: expected { x: 93, y: 73 } to strictly equal { x: 93, y: 77 }

[Killed] BlockStatement
src/helpers/draggable-utils.ts:79:104
  * @param x     Current tick's x position.
  * @param y     Current tick's y position.
  */
-export function createCoreData(lastX: number, lastY: number, x: number, y: number): IDraggableCoreData {
-  // State changes are often (but not always!) async. We want the latest value.
-  const isStart = !isNum(lastX);
-
-  if(isStart) {
-    // If this is our first move, use the x and y as last coords.
-    return {
-      deltaX: 0,
-      deltaY: 0,
-      lastX: x,
-      lastY: y,
-      x,
-      y,
-    };
-  }
-  // Otherwise calculate proper values.
-  return {
-    deltaX: x - lastX,
-    deltaY: y - lastY,
-    lastX,
-    lastY,
-    x,
-    y,
-  };
-}
+export function createCoreData(lastX: number, lastY: number, x: number, y: number): IDraggableCoreData {}
 
killedBy: createCoreData Should return zero deltas and use x/y as last coords on the first move
statusReason: expected undefined to strictly equal { deltaX: +0, deltaY: +0, …(4) }

[Killed] BooleanLiteral
src/helpers/draggable-utils.ts:81:19
  */
 export function createCoreData(lastX: number, lastY: number, x: number, y: number): IDraggableCoreData {
   // State changes are often (but not always!) async. We want the latest value.
-  const isStart = !isNum(lastX);
+  const isStart = isNum(lastX);
 
   if(isStart) {
killedBy: createCoreData Should return zero deltas and use x/y as last coords on the first move
statusReason: expected { deltaX: NaN, deltaY: NaN, …(4) } to strictly equal { deltaX: +0, deltaY: +0, …(4) }

[Killed] BlockStatement
src/helpers/draggable-utils.ts:83:15
   // State changes are often (but not always!) async. We want the latest value.
   const isStart = !isNum(lastX);
 
-  if(isStart) {
-    // If this is our first move, use the x and y as last coords.
-    return {
-      deltaX: 0,
-      deltaY: 0,
-      lastX: x,
-      lastY: y,
-      x,
-      y,
-    };
-  }
+  if(isStart) {}
   // Otherwise calculate proper values.
   return {
killedBy: createCoreData Should return zero deltas and use x/y as last coords on the first move
statusReason: expected { deltaX: NaN, deltaY: NaN, …(4) } to strictly equal { deltaX: +0, deltaY: +0, …(4) }

[Killed] ConditionalExpression
src/helpers/draggable-utils.ts:83:6
   // State changes are often (but not always!) async. We want the latest value.
   const isStart = !isNum(lastX);
 
-  if(isStart) {
+  if(true) {
     // If this is our first move, use the x and y as last coords.
     return {
killedBy: createCoreData Should compute deltas against the last known position on subsequent moves
statusReason: expected { deltaX: +0, deltaY: +0, …(4) } to strictly equal { deltaX: 5, deltaY: 6, …(4) }

[Killed] ArithmeticOperator
src/helpers/draggable-utils.ts:96:13
   }
   // Otherwise calculate proper values.
   return {
-    deltaX: x - lastX,
+    deltaX: x + lastX,
     deltaY: y - lastY,
     lastX,
killedBy: createCoreData Should compute deltas against the last known position on subsequent moves
statusReason: expected { deltaX: 25, deltaY: 6, …(4) } to strictly equal { deltaX: 5, deltaY: 6, …(4) }

[Killed] ArithmeticOperator
src/helpers/draggable-utils.ts:97:13
   // Otherwise calculate proper values.
   return {
     deltaX: x - lastX,
-    deltaY: y - lastY,
+    deltaY: y + lastY,
     lastX,
     lastY,
killedBy: createCoreData Should compute deltas against the last known position on subsequent moves
statusReason: expected { deltaX: 5, deltaY: 46, …(4) } to strictly equal { deltaX: 5, deltaY: 6, …(4) }
