[Killed] BlockStatement
src/helpers/native-interaction.ts:49:119
  * others) falls through to the same default the object form's own
  * unset fields use, rather than being rejected.
  */
-function resolveActivationDistance(distance: TDragActivationDistance | undefined | null, pointerType: string): number {
-  if(distance === undefined || distance === null) {
-    return DRAG_ACTIVATION_THRESHOLD_PX;
-  }
-  if(typeof distance === `number`) {
-    return distance;
-  }
-  const perType = (distance as Record<string, number | undefined>)[pointerType];
-  return perType ?? DRAG_ACTIVATION_THRESHOLD_PX;
-}
+function resolveActivationDistance(distance: TDragActivationDistance | undefined | null, pointerType: string): number {}
 
 export interface INativeDragEvent {
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:50:6
  * unset fields use, rather than being rejected.
  */
 function resolveActivationDistance(distance: TDragActivationDistance | undefined | null, pointerType: string): number {
-  if(distance === undefined || distance === null) {
+  if(true) {
     return DRAG_ACTIVATION_THRESHOLD_PX;
   }
killedBy: native-interaction createNativeDraggable dragActivationDistance Should apply a single numeric activationDistance to every pointer type
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:50:6
  * unset fields use, rather than being rejected.
  */
 function resolveActivationDistance(distance: TDragActivationDistance | undefined | null, pointerType: string): number {
-  if(distance === undefined || distance === null) {
+  if(false || distance === null) {
     return DRAG_ACTIVATION_THRESHOLD_PX;
   }
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] BlockStatement
src/helpers/native-interaction.ts:53:36
   if(distance === undefined || distance === null) {
     return DRAG_ACTIVATION_THRESHOLD_PX;
   }
-  if(typeof distance === `number`) {
-    return distance;
-  }
+  if(typeof distance === `number`) {}
   const perType = (distance as Record<string, number | undefined>)[pointerType];
   return perType ?? DRAG_ACTIVATION_THRESHOLD_PX;
killedBy: native-interaction createNativeDraggable dragActivationDistance Should apply a single numeric activationDistance to every pointer type
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:53:6
   if(distance === undefined || distance === null) {
     return DRAG_ACTIVATION_THRESHOLD_PX;
   }
-  if(typeof distance === `number`) {
+  if(true) {
     return distance;
   }
killedBy: native-interaction createNativeDraggable dragActivationDistance Should apply a distinct per-pointer-type threshold, resolved from the gesture's own pointerType at pointerdown
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] LogicalOperator
src/helpers/native-interaction.ts:57:10
     return distance;
   }
   const perType = (distance as Record<string, number | undefined>)[pointerType];
-  return perType ?? DRAG_ACTIVATION_THRESHOLD_PX;
+  return perType && DRAG_ACTIVATION_THRESHOLD_PX;
 }
 
killedBy: native-interaction createNativeDraggable dragActivationDistance Should apply a distinct per-pointer-type threshold, resolved from the gesture's own pointerType at pointerdown
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] BooleanLiteral
src/helpers/native-interaction.ts:77:6
 
 /** `false`/no-match reasons a candidate pointerdown target is rejected before a drag is allowed to start. */
 function passesDragFilters(target: EventTarget | null, options: INativeDraggableOptions): boolean {
-  if(!(target instanceof Element)) {
+  if(target instanceof Element) {
     return true;
   }
killedBy: native-interaction createNativeDraggable Should not start a drag when ignoreFrom matches the pointerdown target
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] BlockStatement
src/helpers/native-interaction.ts:77:36
 
 /** `false`/no-match reasons a candidate pointerdown target is rejected before a drag is allowed to start. */
 function passesDragFilters(target: EventTarget | null, options: INativeDraggableOptions): boolean {
-  if(!(target instanceof Element)) {
-    return true;
-  }
+  if(!(target instanceof Element)) {}
   if(options.allowFrom) {
     // Bug fix: an explicit `allowFrom` restricts dragging to exactly
killedBy: native-interaction createNativeDraggable Should allow a drag to start when the pointerdown target isn't an Element at all — confirmed gap via a fresh coverage report
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] BooleanLiteral
src/helpers/native-interaction.ts:78:12
 /** `false`/no-match reasons a candidate pointerdown target is rejected before a drag is allowed to start. */
 function passesDragFilters(target: EventTarget | null, options: INativeDraggableOptions): boolean {
   if(!(target instanceof Element)) {
-    return true;
+    return false;
   }
   if(options.allowFrom) {
killedBy: native-interaction createNativeDraggable Should allow a drag to start when the pointerdown target isn't an Element at all — confirmed gap via a fresh coverage report
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:80:6
   if(!(target instanceof Element)) {
     return true;
   }
-  if(options.allowFrom) {
+  if(false) {
     // Bug fix: an explicit `allowFrom` restricts dragging to exactly
     // that one handle — `ignoreFrom`'s own role (excluding specific
killedBy: native-interaction createNativeDraggable Should not start a drag when allowFrom is set and the pointerdown target doesn't match it
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:80:6
   if(!(target instanceof Element)) {
     return true;
   }
-  if(options.allowFrom) {
+  if(true) {
     // Bug fix: an explicit `allowFrom` restricts dragging to exactly
     // that one handle — `ignoreFrom`'s own role (excluding specific
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] BooleanLiteral
src/helpers/native-interaction.ts:95:12
     // warning. Checking `allowFrom` on its own first, and returning
     // its result directly rather than falling through to `ignoreFrom`
     // at all, fixes this.
-    return !!target.closest(options.allowFrom);
+    return !target.closest(options.allowFrom);
   }
   if(options.ignoreFrom && target.closest(options.ignoreFrom)) {
killedBy: native-interaction createNativeDraggable Should not start a drag when allowFrom is set and the pointerdown target doesn't match it
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:97:6
     // at all, fixes this.
     return !!target.closest(options.allowFrom);
   }
-  if(options.ignoreFrom && target.closest(options.ignoreFrom)) {
+  if(false) {
     return false;
   }
killedBy: native-interaction createNativeDraggable Should not start a drag when ignoreFrom matches the pointerdown target
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:97:6
     // at all, fixes this.
     return !!target.closest(options.allowFrom);
   }
-  if(options.ignoreFrom && target.closest(options.ignoreFrom)) {
+  if(true) {
     return false;
   }
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] BooleanLiteral
src/helpers/native-interaction.ts:98:12
     return !!target.closest(options.allowFrom);
   }
   if(options.ignoreFrom && target.closest(options.ignoreFrom)) {
-    return false;
+    return true;
   }
   return true;
killedBy: native-interaction createNativeDraggable Should not start a drag when ignoreFrom matches the pointerdown target
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Survived] BooleanLiteral
src/helpers/native-interaction.ts:129:21
   let pointerId: number | null = null;
   let startX = 0;
   let startY = 0;
-  let dragStarted = false;
+  let dragStarted = true;
   let activationThresholdPx = DRAG_ACTIVATION_THRESHOLD_PX;

[Killed] BlockStatement
src/helpers/native-interaction.ts:133:56
   let activationThresholdPx = DRAG_ACTIVATION_THRESHOLD_PX;
 
-  const onPointerMove = (event: PointerEvent): void => {
-    if(event.pointerId !== pointerId) {
-      return;
-    }
-    if(!dragStarted) {
-      const dx = event.clientX - startX;
-      const dy = event.clientY - startY;
-      if(Math.hypot(dx, dy) < activationThresholdPx) {
-        return;
-      }
-      dragStarted = true;
-      // Fired at the pointerdown position, not the current one — matches
-      // interact.js's own dragstart, which reports where the gesture
-      // began, not wherever it happened to cross the activation threshold.
-      onEvent({ clientX: startX, clientY: startY, target: el, type: `dragstart` });
-    }
-    onEvent({ clientX: event.clientX, clientY: event.clientY, target: el, type: `dragmove` });
-  };
+  const onPointerMove = (event: PointerEvent): void => {};
 
   const cleanup = (): void => {
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] EqualityOperator
src/helpers/native-interaction.ts:134:8
   let activationThresholdPx = DRAG_ACTIVATION_THRESHOLD_PX;
 
   const onPointerMove = (event: PointerEvent): void => {
-    if(event.pointerId !== pointerId) {
+    if(event.pointerId === pointerId) {
       return;
     }
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] BlockStatement
src/helpers/native-interaction.ts:134:39
   let activationThresholdPx = DRAG_ACTIVATION_THRESHOLD_PX;
 
   const onPointerMove = (event: PointerEvent): void => {
-    if(event.pointerId !== pointerId) {
-      return;
-    }
+    if(event.pointerId !== pointerId) {}
     if(!dragStarted) {
       const dx = event.clientX - startX;
killedBy: native-interaction createNativeDraggable Should ignore a second pointer's pointerdown while the first is already being tracked, not abandon the first
statusReason: expected [ 'dragstart', 'dragmove', …(3) ] to strictly equal [ 'dragstart', 'dragmove', …(2) ]

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:137:8
     if(event.pointerId !== pointerId) {
       return;
     }
-    if(!dragStarted) {
+    if(false) {
       const dx = event.clientX - startX;
       const dy = event.clientY - startY;
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [ 'dragmove' ] to strictly equal []

[Killed] BooleanLiteral
src/helpers/native-interaction.ts:137:8
     if(event.pointerId !== pointerId) {
       return;
     }
-    if(!dragStarted) {
+    if(dragStarted) {
       const dx = event.clientX - startX;
       const dy = event.clientY - startY;
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [ 'dragmove' ] to strictly equal []

[Survived] ArithmeticOperator
src/helpers/native-interaction.ts:138:18
       return;
     }
     if(!dragStarted) {
-      const dx = event.clientX - startX;
+      const dx = event.clientX + startX;
       const dy = event.clientY - startY;
       if(Math.hypot(dx, dy) < activationThresholdPx) {

[Survived] ArithmeticOperator
src/helpers/native-interaction.ts:139:18
     }
     if(!dragStarted) {
       const dx = event.clientX - startX;
-      const dy = event.clientY - startY;
+      const dy = event.clientY + startY;
       if(Math.hypot(dx, dy) < activationThresholdPx) {
         return;

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:140:10
     if(!dragStarted) {
       const dx = event.clientX - startX;
       const dy = event.clientY - startY;
-      if(Math.hypot(dx, dy) < activationThresholdPx) {
+      if(false) {
         return;
       }
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:140:10
     if(!dragStarted) {
       const dx = event.clientX - startX;
       const dy = event.clientY - startY;
-      if(Math.hypot(dx, dy) < activationThresholdPx) {
+      if(true) {
         return;
       }
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] BooleanLiteral
src/helpers/native-interaction.ts:143:21
       if(Math.hypot(dx, dy) < activationThresholdPx) {
         return;
       }
-      dragStarted = true;
+      dragStarted = false;
       // Fired at the pointerdown position, not the current one — matches
       // interact.js's own dragstart, which reports where the gesture
killedBy: native-interaction createNativeDraggable Should fire dragend on pointerup, only if a drag had actually started
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal [ 'dragstart', 'dragmove', 'dragend' ]

[Killed] ObjectLiteral
src/helpers/native-interaction.ts:149:13
       // began, not wherever it happened to cross the activation threshold.
       onEvent({ clientX: startX, clientY: startY, target: el, type: `dragstart` });
     }
-    onEvent({ clientX: event.clientX, clientY: event.clientY, target: el, type: `dragmove` });
+    onEvent({});
   };
 
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [ 'dragstart', undefined ] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] StringLiteral
src/helpers/native-interaction.ts:149:81
       // began, not wherever it happened to cross the activation threshold.
       onEvent({ clientX: startX, clientY: startY, target: el, type: `dragstart` });
     }
-    onEvent({ clientX: event.clientX, clientY: event.clientY, target: el, type: `dragmove` });
+    onEvent({ clientX: event.clientX, clientY: event.clientY, target: el, type: `` });
   };
 
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [ 'dragstart', '' ] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] BlockStatement
src/helpers/native-interaction.ts:152:31
     onEvent({ clientX: event.clientX, clientY: event.clientY, target: el, type: `dragmove` });
   };
 
-  const cleanup = (): void => {
-    if(pointerId !== null) {
-      try {
-        el.releasePointerCapture(pointerId);
-      } catch{
-        // Already released (e.g. the pointer left the document) — not an error.
-      }
-    }
-    pointerId = null;
-    dragStarted = false;
-    el.removeEventListener(`pointermove`, onPointerMove);
-    el.removeEventListener(`pointerup`, onPointerUp);
-    el.removeEventListener(`pointercancel`, onPointerUp);
-  };
+  const cleanup = (): void => {};
 
   const onPointerUp = (event: PointerEvent): void => {
killedBy: native-interaction createNativeDraggable Should fire dragend on pointerup, only if a drag had actually started
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove', 'dragend' ]

[Survived] ConditionalExpression
src/helpers/native-interaction.ts:153:8
   };
 
   const cleanup = (): void => {
-    if(pointerId !== null) {
+    if(true) {
       try {
         el.releasePointerCapture(pointerId);

[Survived] EqualityOperator
src/helpers/native-interaction.ts:153:8
   };
 
   const cleanup = (): void => {
-    if(pointerId !== null) {
+    if(pointerId === null) {
       try {
         el.releasePointerCapture(pointerId);

[Survived] BlockStatement
src/helpers/native-interaction.ts:154:11
 
   const cleanup = (): void => {
     if(pointerId !== null) {
-      try {
-        el.releasePointerCapture(pointerId);
-      } catch{
+      try {} catch{
         // Already released (e.g. the pointer left the document) — not an error.
       }

[Survived] BooleanLiteral
src/helpers/native-interaction.ts:161:19
       }
     }
     pointerId = null;
-    dragStarted = false;
+    dragStarted = true;
     el.removeEventListener(`pointermove`, onPointerMove);
     el.removeEventListener(`pointerup`, onPointerUp);

[Survived] StringLiteral
src/helpers/native-interaction.ts:162:28
     }
     pointerId = null;
     dragStarted = false;
-    el.removeEventListener(`pointermove`, onPointerMove);
+    el.removeEventListener(``, onPointerMove);
     el.removeEventListener(`pointerup`, onPointerUp);
     el.removeEventListener(`pointercancel`, onPointerUp);

[Killed] BlockStatement
src/helpers/native-interaction.ts:167:54
     el.removeEventListener(`pointercancel`, onPointerUp);
   };
 
-  const onPointerUp = (event: PointerEvent): void => {
-    if(event.pointerId !== pointerId) {
-      return;
-    }
-    if(dragStarted) {
-      onEvent({ clientX: event.clientX, clientY: event.clientY, target: el, type: `dragend` });
-    }
-    cleanup();
-  };
+  const onPointerUp = (event: PointerEvent): void => {};
 
   const onPointerDown = (event: PointerEvent): void => {
killedBy: native-interaction createNativeDraggable Should fire dragend on pointerup, only if a drag had actually started
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove', 'dragend' ]

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:168:8
   };
 
   const onPointerUp = (event: PointerEvent): void => {
-    if(event.pointerId !== pointerId) {
+    if(true) {
       return;
     }
killedBy: native-interaction createNativeDraggable Should fire dragend on pointerup, only if a drag had actually started
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove', 'dragend' ]

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:168:8
   };
 
   const onPointerUp = (event: PointerEvent): void => {
-    if(event.pointerId !== pointerId) {
+    if(false) {
       return;
     }
killedBy: native-interaction createNativeDraggable Should ignore a pointerup from a pointer other than the one currently tracked, while a drag is still active — confirmed gap via a fresh coverage report
statusReason: expected [ 'dragstart', 'dragmove', 'dragend' ] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:171:8
     if(event.pointerId !== pointerId) {
       return;
     }
-    if(dragStarted) {
+    if(false) {
       onEvent({ clientX: event.clientX, clientY: event.clientY, target: el, type: `dragend` });
     }
killedBy: native-interaction createNativeDraggable Should fire dragend on pointerup, only if a drag had actually started
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal [ 'dragstart', 'dragmove', 'dragend' ]

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:171:8
     if(event.pointerId !== pointerId) {
       return;
     }
-    if(dragStarted) {
+    if(true) {
       onEvent({ clientX: event.clientX, clientY: event.clientY, target: el, type: `dragend` });
     }
killedBy: native-interaction createNativeDraggable Should fire dragend on pointerup, only if a drag had actually started
statusReason: expected [ 'dragend' ] to strictly equal []

[Killed] StringLiteral
src/helpers/native-interaction.ts:172:83
       return;
     }
     if(dragStarted) {
-      onEvent({ clientX: event.clientX, clientY: event.clientY, target: el, type: `dragend` });
+      onEvent({ clientX: event.clientX, clientY: event.clientY, target: el, type: `` });
     }
     cleanup();
killedBy: native-interaction createNativeDraggable Should fire dragend on pointerup, only if a drag had actually started
statusReason: expected [ 'dragstart', 'dragmove', '' ] to strictly equal [ 'dragstart', 'dragmove', 'dragend' ]

[Killed] BooleanLiteral
src/helpers/native-interaction.ts:179:8
 
   const onPointerDown = (event: PointerEvent): void => {
     const options = getOptions();
-    if(!options.enabled) {
+    if(options.enabled) {
       return;
     }
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] BlockStatement
src/helpers/native-interaction.ts:179:26
 
   const onPointerDown = (event: PointerEvent): void => {
     const options = getOptions();
-    if(!options.enabled) {
-      return;
-    }
+    if(!options.enabled) {}
     // Primary button/first touch point only — a right-click or
     // secondary pointer shouldn't start a drag.
killedBy: native-interaction createNativeDraggable Should not start a drag when disabled
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:184:8
     }
     // Primary button/first touch point only — a right-click or
     // secondary pointer shouldn't start a drag.
-    if(event.button !== 0) {
+    if(false) {
       return;
     }
killedBy: native-interaction createNativeDraggable Should ignore a non-primary button
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] BlockStatement
src/helpers/native-interaction.ts:184:28
     }
     // Primary button/first touch point only — a right-click or
     // secondary pointer shouldn't start a drag.
-    if(event.button !== 0) {
-      return;
-    }
+    if(event.button !== 0) {}
     // Bug fix: a second pointer pressing down on the same item while
     // one is already being tracked (two fingers on the same item, or
killedBy: native-interaction createNativeDraggable Should ignore a non-primary button
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] EqualityOperator
src/helpers/native-interaction.ts:198:8
     // until the current gesture's own pointerup/pointercancel clears
     // it, is the same "one gesture at a time per element" invariant
     // interact.js's own Interactable had.
-    if(pointerId !== null) {
+    if(pointerId === null) {
       return;
     }
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] BlockStatement
src/helpers/native-interaction.ts:198:28
     // until the current gesture's own pointerup/pointercancel clears
     // it, is the same "one gesture at a time per element" invariant
     // interact.js's own Interactable had.
-    if(pointerId !== null) {
-      return;
-    }
+    if(pointerId !== null) {}
     if(!passesDragFilters(event.target, options)) {
       return;
killedBy: native-interaction createNativeDraggable Should ignore a second pointer's pointerdown while the first is already being tracked, not abandon the first
statusReason: expected [ 'dragstart', 'dragmove', …(2) ] to strictly equal [ 'dragstart', 'dragmove', …(2) ]

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:201:8
     if(pointerId !== null) {
       return;
     }
-    if(!passesDragFilters(event.target, options)) {
+    if(true) {
       return;
     }
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove' ]

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:201:8
     if(pointerId !== null) {
       return;
     }
-    if(!passesDragFilters(event.target, options)) {
+    if(false) {
       return;
     }
killedBy: native-interaction createNativeDraggable Should not start a drag when ignoreFrom matches the pointerdown target
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] BooleanLiteral
src/helpers/native-interaction.ts:208:19
     ({ pointerId } = event);
     ({ clientX: startX, clientY: startY } = event);
     activationThresholdPx = resolveActivationDistance(options.activationDistance, event.pointerType);
-    dragStarted = false;
+    dragStarted = true;
     el.setPointerCapture(pointerId);
     el.addEventListener(`pointermove`, onPointerMove);
killedBy: native-interaction createNativeDraggable Should not start a drag until the pointer moves past the activation threshold
statusReason: expected [ 'dragmove' ] to strictly equal []

[Killed] StringLiteral
src/helpers/native-interaction.ts:211:25
     dragStarted = false;
     el.setPointerCapture(pointerId);
     el.addEventListener(`pointermove`, onPointerMove);
-    el.addEventListener(`pointerup`, onPointerUp);
+    el.addEventListener(``, onPointerUp);
     el.addEventListener(`pointercancel`, onPointerUp);
   };
killedBy: native-interaction createNativeDraggable Should fire dragend on pointerup, only if a drag had actually started
statusReason: expected [] to strictly equal [ 'dragstart', 'dragmove', 'dragend' ]

[Survived] StringLiteral
src/helpers/native-interaction.ts:212:25
     el.setPointerCapture(pointerId);
     el.addEventListener(`pointermove`, onPointerMove);
     el.addEventListener(`pointerup`, onPointerUp);
-    el.addEventListener(`pointercancel`, onPointerUp);
+    el.addEventListener(``, onPointerUp);
   };
 

[Killed] ObjectLiteral
src/helpers/native-interaction.ts:217:10
 
   el.addEventListener(`pointerdown`, onPointerDown);
 
-  return {
-    destroy(): void {
-      el.removeEventListener(`pointerdown`, onPointerDown);
-      cleanup();
-    },
-  };
+  return {};
 }
 
killedBy: native-interaction createNativeDraggable Should stop listening after destroy() is called
statusReason: draggable.destroy is not a function

[Killed] BlockStatement
src/helpers/native-interaction.ts:218:21
   el.addEventListener(`pointerdown`, onPointerDown);
 
   return {
-    destroy(): void {
-      el.removeEventListener(`pointerdown`, onPointerDown);
-      cleanup();
-    },
+    destroy(): void {},
   };
 }
killedBy: native-interaction createNativeDraggable Should stop listening after destroy() is called
statusReason: expected [ 'dragstart', 'dragmove' ] to strictly equal []

[Killed] BooleanLiteral
src/helpers/native-interaction.ts:243:54
 
 /** Which of the 8 resize-hint spans map to which `IInteractEdges` combination. */
 export const RESIZE_EDGE_MAP: Record<TResizeHandle, IInteractEdges> = {
-  e: { bottom: false, left: false, right: true, top: false },
+  e: { bottom: false, left: false, right: true, top: true },
   n: { bottom: false, left: false, right: false, top: true },
   ne: { bottom: false, left: false, right: true, top: true },
killedBy: native-interaction createNativeResizable RESIZE_EDGE_MAP should map each of the 8 handles to its own exact edge combination
statusReason: expected { e: { bottom: false, …(3) }, …(7) } to strictly equal { e: { bottom: false, …(3) }, …(7) }

[Killed] BooleanLiteral
src/helpers/native-interaction.ts:243:43
 
 /** Which of the 8 resize-hint spans map to which `IInteractEdges` combination. */
 export const RESIZE_EDGE_MAP: Record<TResizeHandle, IInteractEdges> = {
-  e: { bottom: false, left: false, right: true, top: false },
+  e: { bottom: false, left: false, right: false, top: false },
   n: { bottom: false, left: false, right: false, top: true },
   ne: { bottom: false, left: false, right: true, top: true },
killedBy: native-interaction createNativeResizable RESIZE_EDGE_MAP should map each of the 8 handles to its own exact edge combination
statusReason: expected { e: { bottom: false, …(3) }, …(7) } to strictly equal { e: { bottom: false, …(3) }, …(7) }

[Killed] BooleanLiteral
src/helpers/native-interaction.ts:244:29
 /** Which of the 8 resize-hint spans map to which `IInteractEdges` combination. */
 export const RESIZE_EDGE_MAP: Record<TResizeHandle, IInteractEdges> = {
   e: { bottom: false, left: false, right: true, top: false },
-  n: { bottom: false, left: false, right: false, top: true },
+  n: { bottom: false, left: true, right: false, top: true },
   ne: { bottom: false, left: false, right: true, top: true },
   nw: { bottom: false, left: true, right: false, top: true },
killedBy: native-interaction createNativeResizable RESIZE_EDGE_MAP should map each of the 8 handles to its own exact edge combination
statusReason: expected { e: { bottom: false, …(3) }, …(7) } to strictly equal { e: { bottom: false, …(3) }, …(7) }
