[Killed] ConditionalExpression
src/helpers/native-interaction.ts:418:8
     const { overflowX } = style;
     const scrollableY = (overflowY === `auto` || overflowY === `scroll`) && node.scrollHeight > node.clientHeight;
     const scrollableX = (overflowX === `auto` || overflowX === `scroll`) && node.scrollWidth > node.clientWidth;
-    if(scrollableY || scrollableX) {
+    if(true) {
       return node;
     }
killedBy: native-interaction createNativeAutoScroll Should recognize overflow:'scroll' (not just 'auto') as scrollable, and treat an exact scrollHeight===clientHeight as NOT scrollable
statusReason: expected [Function] to not throw an error but 'TypeError: container.scrollBy is not …' was thrown

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:433:8
   let rafId: number | null = null;
 
   const tick = (): void => {
-    if(!container) {
+    if(true) {
       return;
     }
killedBy: native-interaction createNativeAutoScroll Should scroll a scrollable ancestor when the tracked position is near its edge
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/helpers/native-interaction.ts:433:20
   let rafId: number | null = null;
 
   const tick = (): void => {
-    if(!container) {
-      return;
-    }
+    if(!container) {}
     const rect = container.getBoundingClientRect();
     let dx = 0;
killedBy: native-interaction createNativeAutoScroll Should no-op (not throw, not scroll) when a scheduled tick fires after a second start() call overwrote container to null
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Survived] ArithmeticOperator
src/helpers/native-interaction.ts:440:22
     let dx = 0;
     let dy = 0;
 
-    const distLeft = lastClientX - rect.left;
+    const distLeft = lastClientX + rect.left;
     const distRight = rect.right - lastClientX;
     const distTop = lastClientY - rect.top;

[Killed] ArithmeticOperator
src/helpers/native-interaction.ts:441:23
     let dy = 0;
 
     const distLeft = lastClientX - rect.left;
-    const distRight = rect.right - lastClientX;
+    const distRight = rect.right + lastClientX;
     const distTop = lastClientY - rect.top;
     const distBottom = rect.bottom - lastClientY;
killedBy: native-interaction createNativeAutoScroll Should scroll toward the bottom-right when the tracked position is near that edge instead
statusReason: expected 0 to be greater than 0

[Survived] ArithmeticOperator
src/helpers/native-interaction.ts:442:21
 
     const distLeft = lastClientX - rect.left;
     const distRight = rect.right - lastClientX;
-    const distTop = lastClientY - rect.top;
+    const distTop = lastClientY + rect.top;
     const distBottom = rect.bottom - lastClientY;
 

[Killed] ArithmeticOperator
src/helpers/native-interaction.ts:443:24
     const distLeft = lastClientX - rect.left;
     const distRight = rect.right - lastClientX;
     const distTop = lastClientY - rect.top;
-    const distBottom = rect.bottom - lastClientY;
+    const distBottom = rect.bottom + lastClientY;
 
     if(distLeft >= 0 && distLeft < AUTO_SCROLL_MARGIN_PX) {
killedBy: native-interaction createNativeAutoScroll Should scroll toward the bottom-right when the tracked position is near that edge instead
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:445:8
     const distTop = lastClientY - rect.top;
     const distBottom = rect.bottom - lastClientY;
 
-    if(distLeft >= 0 && distLeft < AUTO_SCROLL_MARGIN_PX) {
+    if(false) {
       dx = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distLeft / AUTO_SCROLL_MARGIN_PX);
     } else if(distRight >= 0 && distRight < AUTO_SCROLL_MARGIN_PX) {
killedBy: native-interaction createNativeAutoScroll Should scroll a scrollable ancestor when the tracked position is near its edge
statusReason: expected 0 to be less than 0

[Killed] EqualityOperator
src/helpers/native-interaction.ts:445:25
     const distTop = lastClientY - rect.top;
     const distBottom = rect.bottom - lastClientY;
 
-    if(distLeft >= 0 && distLeft < AUTO_SCROLL_MARGIN_PX) {
+    if(distLeft >= 0 && distLeft >= AUTO_SCROLL_MARGIN_PX) {
       dx = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distLeft / AUTO_SCROLL_MARGIN_PX);
     } else if(distRight >= 0 && distRight < AUTO_SCROLL_MARGIN_PX) {
killedBy: native-interaction createNativeAutoScroll Should scroll a scrollable ancestor when the tracked position is near its edge
statusReason: expected 0 to be less than 0

[Killed] ArithmeticOperator
src/helpers/native-interaction.ts:446:45
     const distBottom = rect.bottom - lastClientY;
 
     if(distLeft >= 0 && distLeft < AUTO_SCROLL_MARGIN_PX) {
-      dx = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distLeft / AUTO_SCROLL_MARGIN_PX);
+      dx = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distLeft * AUTO_SCROLL_MARGIN_PX);
     } else if(distRight >= 0 && distRight < AUTO_SCROLL_MARGIN_PX) {
       dx = AUTO_SCROLL_MAX_SPEED_PX * (1 - distRight / AUTO_SCROLL_MARGIN_PX);
killedBy: native-interaction createNativeAutoScroll Should scroll a scrollable ancestor when the tracked position is near its edge
statusReason: expected 4788 to be less than 0

[Killed] UnaryOperator
src/helpers/native-interaction.ts:446:12
     const distBottom = rect.bottom - lastClientY;
 
     if(distLeft >= 0 && distLeft < AUTO_SCROLL_MARGIN_PX) {
-      dx = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distLeft / AUTO_SCROLL_MARGIN_PX);
+      dx = +AUTO_SCROLL_MAX_SPEED_PX * (1 - distLeft / AUTO_SCROLL_MARGIN_PX);
     } else if(distRight >= 0 && distRight < AUTO_SCROLL_MARGIN_PX) {
       dx = AUTO_SCROLL_MAX_SPEED_PX * (1 - distRight / AUTO_SCROLL_MARGIN_PX);
killedBy: native-interaction createNativeAutoScroll Should scroll a scrollable ancestor when the tracked position is near its edge
statusReason: expected 9 to be less than 0

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:447:15
 
     if(distLeft >= 0 && distLeft < AUTO_SCROLL_MARGIN_PX) {
       dx = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distLeft / AUTO_SCROLL_MARGIN_PX);
-    } else if(distRight >= 0 && distRight < AUTO_SCROLL_MARGIN_PX) {
+    } else if(true) {
       dx = AUTO_SCROLL_MAX_SPEED_PX * (1 - distRight / AUTO_SCROLL_MARGIN_PX);
     }
killedBy: native-interaction createNativeAutoScroll Should not scroll when the tracked position is far from any edge
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      -48,

[Killed] EqualityOperator
src/helpers/native-interaction.ts:447:33
 
     if(distLeft >= 0 && distLeft < AUTO_SCROLL_MARGIN_PX) {
       dx = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distLeft / AUTO_SCROLL_MARGIN_PX);
-    } else if(distRight >= 0 && distRight < AUTO_SCROLL_MARGIN_PX) {
+    } else if(distRight >= 0 && distRight >= AUTO_SCROLL_MARGIN_PX) {
       dx = AUTO_SCROLL_MAX_SPEED_PX * (1 - distRight / AUTO_SCROLL_MARGIN_PX);
     }
killedBy: native-interaction createNativeAutoScroll Should scroll toward the bottom-right when the tracked position is near that edge instead
statusReason: expected 0 to be greater than 0

[Killed] ArithmeticOperator
src/helpers/native-interaction.ts:448:44
     if(distLeft >= 0 && distLeft < AUTO_SCROLL_MARGIN_PX) {
       dx = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distLeft / AUTO_SCROLL_MARGIN_PX);
     } else if(distRight >= 0 && distRight < AUTO_SCROLL_MARGIN_PX) {
-      dx = AUTO_SCROLL_MAX_SPEED_PX * (1 - distRight / AUTO_SCROLL_MARGIN_PX);
+      dx = AUTO_SCROLL_MAX_SPEED_PX * (1 - distRight * AUTO_SCROLL_MARGIN_PX);
     }
     if(distTop >= 0 && distTop < AUTO_SCROLL_MARGIN_PX) {
killedBy: native-interaction createNativeAutoScroll Should scroll toward the bottom-right when the tracked position is near that edge instead
statusReason: expected -4788 to be greater than 0

[Survived] ArithmeticOperator
src/helpers/native-interaction.ts:448:40
     if(distLeft >= 0 && distLeft < AUTO_SCROLL_MARGIN_PX) {
       dx = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distLeft / AUTO_SCROLL_MARGIN_PX);
     } else if(distRight >= 0 && distRight < AUTO_SCROLL_MARGIN_PX) {
-      dx = AUTO_SCROLL_MAX_SPEED_PX * (1 - distRight / AUTO_SCROLL_MARGIN_PX);
+      dx = AUTO_SCROLL_MAX_SPEED_PX * (1 + distRight / AUTO_SCROLL_MARGIN_PX);
     }
     if(distTop >= 0 && distTop < AUTO_SCROLL_MARGIN_PX) {

[Killed] EqualityOperator
src/helpers/native-interaction.ts:450:8
     } else if(distRight >= 0 && distRight < AUTO_SCROLL_MARGIN_PX) {
       dx = AUTO_SCROLL_MAX_SPEED_PX * (1 - distRight / AUTO_SCROLL_MARGIN_PX);
     }
-    if(distTop >= 0 && distTop < AUTO_SCROLL_MARGIN_PX) {
+    if(distTop < 0 && distTop < AUTO_SCROLL_MARGIN_PX) {
       dy = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distTop / AUTO_SCROLL_MARGIN_PX);
     } else if(distBottom >= 0 && distBottom < AUTO_SCROLL_MARGIN_PX) {
killedBy: native-interaction createNativeAutoScroll Should scroll a scrollable ancestor when the tracked position is near its edge
statusReason: expected 0 to be less than 0

[Killed] EqualityOperator
src/helpers/native-interaction.ts:450:8
     } else if(distRight >= 0 && distRight < AUTO_SCROLL_MARGIN_PX) {
       dx = AUTO_SCROLL_MAX_SPEED_PX * (1 - distRight / AUTO_SCROLL_MARGIN_PX);
     }
-    if(distTop >= 0 && distTop < AUTO_SCROLL_MARGIN_PX) {
+    if(distTop > 0 && distTop < AUTO_SCROLL_MARGIN_PX) {
       dy = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distTop / AUTO_SCROLL_MARGIN_PX);
     } else if(distBottom >= 0 && distBottom < AUTO_SCROLL_MARGIN_PX) {
killedBy: native-interaction createNativeAutoScroll Should compute an exact dx/dy at the left/top edge boundary (distance 0), not just a negative sign
statusReason: expected "vi.fn()" to be called with arguments: [ -12, -12 ]

Received:

  1st vi.fn() call:

  [
    -12,

[Killed] UnaryOperator
src/helpers/native-interaction.ts:451:12
       dx = AUTO_SCROLL_MAX_SPEED_PX * (1 - distRight / AUTO_SCROLL_MARGIN_PX);
     }
     if(distTop >= 0 && distTop < AUTO_SCROLL_MARGIN_PX) {
-      dy = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distTop / AUTO_SCROLL_MARGIN_PX);
+      dy = +AUTO_SCROLL_MAX_SPEED_PX * (1 - distTop / AUTO_SCROLL_MARGIN_PX);
     } else if(distBottom >= 0 && distBottom < AUTO_SCROLL_MARGIN_PX) {
       dy = AUTO_SCROLL_MAX_SPEED_PX * (1 - distBottom / AUTO_SCROLL_MARGIN_PX);
killedBy: native-interaction createNativeAutoScroll Should scroll a scrollable ancestor when the tracked position is near its edge
statusReason: expected 9 to be less than 0

[Killed] ArithmeticOperator
src/helpers/native-interaction.ts:451:45
       dx = AUTO_SCROLL_MAX_SPEED_PX * (1 - distRight / AUTO_SCROLL_MARGIN_PX);
     }
     if(distTop >= 0 && distTop < AUTO_SCROLL_MARGIN_PX) {
-      dy = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distTop / AUTO_SCROLL_MARGIN_PX);
+      dy = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distTop * AUTO_SCROLL_MARGIN_PX);
     } else if(distBottom >= 0 && distBottom < AUTO_SCROLL_MARGIN_PX) {
       dy = AUTO_SCROLL_MAX_SPEED_PX * (1 - distBottom / AUTO_SCROLL_MARGIN_PX);
killedBy: native-interaction createNativeAutoScroll Should scroll a scrollable ancestor when the tracked position is near its edge
statusReason: expected 4788 to be less than 0

[Killed] BlockStatement
src/helpers/native-interaction.ts:452:70
     }
     if(distTop >= 0 && distTop < AUTO_SCROLL_MARGIN_PX) {
       dy = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distTop / AUTO_SCROLL_MARGIN_PX);
-    } else if(distBottom >= 0 && distBottom < AUTO_SCROLL_MARGIN_PX) {
-      dy = AUTO_SCROLL_MAX_SPEED_PX * (1 - distBottom / AUTO_SCROLL_MARGIN_PX);
-    }
+    } else if(distBottom >= 0 && distBottom < AUTO_SCROLL_MARGIN_PX) {}
 
     if(dx !== 0 || dy !== 0) {
killedBy: native-interaction createNativeAutoScroll Should scroll toward the bottom-right when the tracked position is near that edge instead
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:452:15
     }
     if(distTop >= 0 && distTop < AUTO_SCROLL_MARGIN_PX) {
       dy = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distTop / AUTO_SCROLL_MARGIN_PX);
-    } else if(distBottom >= 0 && distBottom < AUTO_SCROLL_MARGIN_PX) {
+    } else if(true) {
       dy = AUTO_SCROLL_MAX_SPEED_PX * (1 - distBottom / AUTO_SCROLL_MARGIN_PX);
     }
killedBy: native-interaction createNativeAutoScroll Should not scroll when the tracked position is far from any edge
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      0,

[Killed] ArithmeticOperator
src/helpers/native-interaction.ts:453:44
     if(distTop >= 0 && distTop < AUTO_SCROLL_MARGIN_PX) {
       dy = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distTop / AUTO_SCROLL_MARGIN_PX);
     } else if(distBottom >= 0 && distBottom < AUTO_SCROLL_MARGIN_PX) {
-      dy = AUTO_SCROLL_MAX_SPEED_PX * (1 - distBottom / AUTO_SCROLL_MARGIN_PX);
+      dy = AUTO_SCROLL_MAX_SPEED_PX * (1 - distBottom * AUTO_SCROLL_MARGIN_PX);
     }
 
killedBy: native-interaction createNativeAutoScroll Should scroll toward the bottom-right when the tracked position is near that edge instead
statusReason: expected -4788 to be greater than 0

[Survived] ArithmeticOperator
src/helpers/native-interaction.ts:453:40
     if(distTop >= 0 && distTop < AUTO_SCROLL_MARGIN_PX) {
       dy = -AUTO_SCROLL_MAX_SPEED_PX * (1 - distTop / AUTO_SCROLL_MARGIN_PX);
     } else if(distBottom >= 0 && distBottom < AUTO_SCROLL_MARGIN_PX) {
-      dy = AUTO_SCROLL_MAX_SPEED_PX * (1 - distBottom / AUTO_SCROLL_MARGIN_PX);
+      dy = AUTO_SCROLL_MAX_SPEED_PX * (1 + distBottom / AUTO_SCROLL_MARGIN_PX);
     }
 

[Killed] EqualityOperator
src/helpers/native-interaction.ts:456:8
       dy = AUTO_SCROLL_MAX_SPEED_PX * (1 - distBottom / AUTO_SCROLL_MARGIN_PX);
     }
 
-    if(dx !== 0 || dy !== 0) {
+    if(dx === 0 || dy !== 0) {
       container.scrollBy(dx, dy);
     }
killedBy: native-interaction createNativeAutoScroll Should not scroll when the tracked position is far from any edge
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      0,

[Killed] ConditionalExpression
src/helpers/native-interaction.ts:456:8
       dy = AUTO_SCROLL_MAX_SPEED_PX * (1 - distBottom / AUTO_SCROLL_MARGIN_PX);
     }
 
-    if(dx !== 0 || dy !== 0) {
+    if(true) {
       container.scrollBy(dx, dy);
     }
killedBy: native-interaction createNativeAutoScroll Should not scroll when the tracked position is far from any edge
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      0,

[Killed] BlockStatement
src/helpers/native-interaction.ts:463:34
   };
 
   return {
-    start(el: HTMLElement): void {
-      container = findScrollableAncestor(el);
-      if(container && rafId === null) {
-        rafId = requestAnimationFrame(tick);
-      }
-    },
+    start(el: HTMLElement): void {},
     stop(): void {
       if(rafId !== null) {
killedBy: native-interaction createNativeAutoScroll Should scroll a scrollable ancestor when the tracked position is near its edge
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/helpers/native-interaction.ts:465:39
   return {
     start(el: HTMLElement): void {
       container = findScrollableAncestor(el);
-      if(container && rafId === null) {
-        rafId = requestAnimationFrame(tick);
-      }
+      if(container && rafId === null) {}
     },
     stop(): void {
killedBy: native-interaction createNativeAutoScroll Should scroll a scrollable ancestor when the tracked position is near its edge
statusReason: expected "vi.fn()" to be called at least once

[Killed] EqualityOperator
src/helpers/native-interaction.ts:465:23
   return {
     start(el: HTMLElement): void {
       container = findScrollableAncestor(el);
-      if(container && rafId === null) {
+      if(container && rafId !== null) {
         rafId = requestAnimationFrame(tick);
       }
killedBy: native-interaction createNativeAutoScroll Should scroll a scrollable ancestor when the tracked position is near its edge
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/helpers/native-interaction.ts:469:18
         rafId = requestAnimationFrame(tick);
       }
     },
-    stop(): void {
-      if(rafId !== null) {
-        cancelAnimationFrame(rafId);
-        rafId = null;
-      }
-      container = null;
-    },
+    stop(): void {},
     update(clientX: number, clientY: number): void {
       lastClientX = clientX;
killedBy: native-interaction createNativeAutoScroll Should stop ticking once stop() is called
statusReason: expected "vi.fn()" to not be called at all, but actually been called 3 times

Received:

  1st vi.fn() call:

    Array [
      -9,

[Survived] ConditionalExpression
src/helpers/native-interaction.ts:470:10
       }
     },
     stop(): void {
-      if(rafId !== null) {
+      if(true) {
         cancelAnimationFrame(rafId);
         rafId = null;

[Survived] EqualityOperator
src/helpers/native-interaction.ts:470:10
       }
     },
     stop(): void {
-      if(rafId !== null) {
+      if(rafId === null) {
         cancelAnimationFrame(rafId);
         rafId = null;

[Killed] BlockStatement
src/helpers/native-interaction.ts:476:52
       }
       container = null;
     },
-    update(clientX: number, clientY: number): void {
-      lastClientX = clientX;
-      lastClientY = clientY;
-    },
+    update(clientX: number, clientY: number): void {},
   };
 }
killedBy: native-interaction createNativeAutoScroll Should scroll toward the bottom-right when the tracked position is near that edge instead
statusReason: expected -12 to be greater than 0
