[Killed] BlockStatement
src/validators/margin-validator.ts:12:70
  * @param value The `[horizontal, vertical]` margin tuple to validate.
  * @returns `true` if both values are positive numbers.
  */
-export const marginValidator = (value: [number, number]): boolean => {
-  const values = value.map(v => typeof v === `number`);
-  const isLength = value.length === 2;
-
-  return values.indexOf(false) === -1 && isLength && value[0] > 0 && value[1] > 0;
-};
+export const marginValidator = (value: [number, number]): boolean => {};
 
killedBy: marginValidator When margin are valid
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
src/validators/margin-validator.ts:13:28
  * @returns `true` if both values are positive numbers.
  */
 export const marginValidator = (value: [number, number]): boolean => {
-  const values = value.map(v => typeof v === `number`);
+  const values = value.map(() => undefined);
   const isLength = value.length === 2;
 
killedBy: marginValidator Should be false when only the typeof check fails — a string that would coerce to a valid positive number if the type check were bypassed
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/validators/margin-validator.ts:13:33
  * @returns `true` if both values are positive numbers.
  */
 export const marginValidator = (value: [number, number]): boolean => {
-  const values = value.map(v => typeof v === `number`);
+  const values = value.map(v => false);
   const isLength = value.length === 2;
 
killedBy: marginValidator When margin are valid
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/validators/margin-validator.ts:14:20
  */
 export const marginValidator = (value: [number, number]): boolean => {
   const values = value.map(v => typeof v === `number`);
-  const isLength = value.length === 2;
+  const isLength = value.length !== 2;
 
   return values.indexOf(false) === -1 && isLength && value[0] > 0 && value[1] > 0;
killedBy: marginValidator When margin are valid
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/validators/margin-validator.ts:14:20
  */
 export const marginValidator = (value: [number, number]): boolean => {
   const values = value.map(v => typeof v === `number`);
-  const isLength = value.length === 2;
+  const isLength = false;
 
   return values.indexOf(false) === -1 && isLength && value[0] > 0 && value[1] > 0;
killedBy: marginValidator When margin are valid
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/validators/margin-validator.ts:16:10
   const values = value.map(v => typeof v === `number`);
   const isLength = value.length === 2;
 
-  return values.indexOf(false) === -1 && isLength && value[0] > 0 && value[1] > 0;
+  return values.indexOf(false) === -1 || isLength && value[0] > 0 && value[1] > 0;
 };
 
killedBy: marginValidator Should be false when only the typeof check fails — a string that would coerce to a valid positive number if the type check were bypassed
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/validators/margin-validator.ts:16:10
   const values = value.map(v => typeof v === `number`);
   const isLength = value.length === 2;
 
-  return values.indexOf(false) === -1 && isLength && value[0] > 0 && value[1] > 0;
+  return values.indexOf(false) === -1 && isLength && value[0] > 0 || value[1] > 0;
 };
 
killedBy: marginValidator Should be false when only value[0] fails its own >0 check (value[1] genuinely passes)
statusReason: expected true to be false // Object.is equality
