[Timeout] BlockStatement
src/components/Grid/GridLayout.tsx:68:64
  * fields compaction can actually touch avoids depending on the shape
  * of data this component never looks at otherwise.
  */
-function layoutPositionsEqual(a: TLayout, b: TLayout): boolean {
-  if(a.length !== b.length) {
-    return false;
-  }
-  const byId = new Map(b.map(item => [item.i, item]));
-  return a.every(item => {
-    const match = byId.get(item.i);
-    return match !== undefined && match.x === item.x && match.y === item.y && match.w === item.w && match.h === item.h;
-  });
-}
+function layoutPositionsEqual(a: TLayout, b: TLayout): boolean {}
 
 /** A single rendered alignment-guide line — pixel-converted from `core`'s own grid-unit `IAlignmentGuide`. */

[Survived] ConditionalExpression
src/components/Grid/GridLayout.tsx:69:6
  * of data this component never looks at otherwise.
  */
 function layoutPositionsEqual(a: TLayout, b: TLayout): boolean {
-  if(a.length !== b.length) {
+  if(false) {
     return false;
   }

[NoCoverage] BlockStatement
src/components/Grid/GridLayout.tsx:69:29
  * of data this component never looks at otherwise.
  */
 function layoutPositionsEqual(a: TLayout, b: TLayout): boolean {
-  if(a.length !== b.length) {
-    return false;
-  }
+  if(a.length !== b.length) {}
   const byId = new Map(b.map(item => [item.i, item]));
   return a.every(item => {

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:72:30
   if(a.length !== b.length) {
     return false;
   }
-  const byId = new Map(b.map(item => [item.i, item]));
+  const byId = new Map(b.map(() => undefined));
   return a.every(item => {
     const match = byId.get(item.i);
killedBy: GridLayout Should reflect a wholesale layout prop change (controlled component)
statusReason: Iterator value undefined is not an entry object

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:72:38
   if(a.length !== b.length) {
     return false;
   }
-  const byId = new Map(b.map(item => [item.i, item]));
+  const byId = new Map(b.map(item => []));
   return a.every(item => {
     const match = byId.get(item.i);

[Timeout] MethodExpression
src/components/Grid/GridLayout.tsx:73:10
     return false;
   }
   const byId = new Map(b.map(item => [item.i, item]));
-  return a.every(item => {
-    const match = byId.get(item.i);
-    return match !== undefined && match.x === item.x && match.y === item.y && match.w === item.w && match.h === item.h;
-  });
+  return a.some(item => {
+  const match = byId.get(item.i);
+  return match !== undefined && match.x === item.x && match.y === item.y && match.w === item.w && match.h === item.h;
+});
 }
 

[Timeout] BlockStatement
src/components/Grid/GridLayout.tsx:73:26
     return false;
   }
   const byId = new Map(b.map(item => [item.i, item]));
-  return a.every(item => {
-    const match = byId.get(item.i);
-    return match !== undefined && match.x === item.x && match.y === item.y && match.w === item.w && match.h === item.h;
-  });
+  return a.every(item => {});
 }
 

[Survived] ConditionalExpression
src/components/Grid/GridLayout.tsx:75:79
   const byId = new Map(b.map(item => [item.i, item]));
   return a.every(item => {
     const match = byId.get(item.i);
-    return match !== undefined && match.x === item.x && match.y === item.y && match.w === item.w && match.h === item.h;
+    return match !== undefined && match.x === item.x && match.y === item.y && true && match.h === item.h;
   });
 }

[Timeout] EqualityOperator
src/components/Grid/GridLayout.tsx:75:101
   const byId = new Map(b.map(item => [item.i, item]));
   return a.every(item => {
     const match = byId.get(item.i);
-    return match !== undefined && match.x === item.x && match.y === item.y && match.w === item.w && match.h === item.h;
+    return match !== undefined && match.x === item.x && match.y === item.y && match.w === item.w && match.h !== item.h;
   });
 }

[Timeout] StringLiteral
src/components/Grid/GridLayout.tsx:145:30
   useCssTransforms = true,
   transformScale = 1,
   transitionDurationMs = 200,
-  transitionTimingFunction = `ease`,
+  transitionTimingFunction = ``,
   compactType = ECompactType.VERTICAL,
   restoreOnDrag = false,

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:347:8
    * measurement that had nothing to do with that item's own bound.
    */
   const effectiveContainerWidth = useMemo(() => {
-    if(!hasMeasuredWidth) {
+    if(hasMeasuredWidth) {
       return containerWidth;
     }
killedBy: GridItem autoHeight Should clamp up to minW when the measured width converts to less than it
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:347:8
    * measurement that had nothing to do with that item's own bound.
    */
   const effectiveContainerWidth = useMemo(() => {
-    if(!hasMeasuredWidth) {
+    if(false) {
       return containerWidth;
     }
killedBy: GridItem autoHeight Should clamp up to minW when the measured width converts to less than it
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:352:10
     }
     let minFloorPx = 0;
     workingLayout.forEach(item => {
-      if(item.minW !== undefined && item.minW !== null) {
+      if(item.minW === undefined && item.minW !== null) {
         minFloorPx = Math.max(minFloorPx, item.minW * rowHeight + Math.max(0, item.minW - 1) * margin[0]);
       }
killedBy: GridLayout isMirrored (RTL) Should drag correctly under RTL, reporting a moved position
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/components/Grid/GridLayout.tsx:375:39
   // may invoke more than once per commit, e.g. under Strict Mode).
   const workingLayoutRef = useRef<TLayout>(workingLayout);
   const historyRef = useRef<TLayout[]>([]);
-  const futureRef = useRef<TLayout[]>([]);
+  const futureRef = useRef<TLayout[]>(["Stryker was here"]);
   const pendingUndoSnapshotRef = useRef<TLayout | null>(null);
   /**
killedBy: GridLayout undo/redo Should default canUndo/canRedo to false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:436:8
       return;
     }
     historyRef.current.push(cloneLayout(before));
-    if(historyRef.current.length > undoHistoryLimit) {
+    if(historyRef.current.length <= undoHistoryLimit) {
       historyRef.current.shift();
     }
killedBy: GridLayout undo/redo Should undo a drag back to its pre-drag position
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:465:6
   // below instead, rather than also being pulled into this synchronous
   // path.
   const [prevLayoutProp, setPrevLayoutProp] = useState(layout);
-  if(layout !== prevLayoutProp) {
+  if(false) {
     setPrevLayoutProp(layout);
     const cloned = cloneLayout(layout);
killedBy: GridLayout undo/redo Should treat an externally-driven layout length change as an undo-tracked action
statusReason: GridItem: no layout entry found for i="1".

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:465:6
   // below instead, rather than also being pulled into this synchronous
   // path.
   const [prevLayoutProp, setPrevLayoutProp] = useState(layout);
-  if(layout !== prevLayoutProp) {
+  if(layout === prevLayoutProp) {
     setPrevLayoutProp(layout);
     const cloned = cloneLayout(layout);
killedBy: GridLayout undo/redo Should default canUndo/canRedo to false
statusReason: Too many re-renders. React limits the number of renders to prevent an infinite loop.

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:468:59
   if(layout !== prevLayoutProp) {
     setPrevLayoutProp(layout);
     const cloned = cloneLayout(layout);
-    if(cloned.length !== workingLayoutRef.current.length) {
-      pendingUndoSnapshotRef.current = workingLayoutRef.current;
-    }
+    if(cloned.length !== workingLayoutRef.current.length) {}
     // Bug fix: an externally-supplied `layout` can contain
     // not-yet-resolved sentinel positions — most commonly a freshly
killedBy: GridLayout undo/redo Should treat an externally-driven layout length change as an undo-tracked action
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/components/Grid/GridLayout.tsx:492:24
     // spot. Confirmed directly via a real, reproduced case: a
     // freshly-added item's own `.style.transform` measured as an empty
     // string, sitting exactly on top of the grid's own first item.
-    const compacted = (compactor ?? getCompactor(compactType)).compact(cloned, colNum, { compactType });
+    const compacted = (compactor && getCompactor(compactType)).compact(cloned, colNum, { compactType });
     if(!layoutPositionsEqual(compacted, cloned)) {
       pendingCompactionNotifyRef.current = compacted;
killedBy: GridLayout undo/redo Should treat an externally-driven layout length change as an undo-tracked action
statusReason: Cannot read properties of null (reading 'compact')

[Survived] ConditionalExpression
src/components/Grid/GridLayout.tsx:493:8
     // freshly-added item's own `.style.transform` measured as an empty
     // string, sitting exactly on top of the grid's own first item.
     const compacted = (compactor ?? getCompactor(compactType)).compact(cloned, colNum, { compactType });
-    if(!layoutPositionsEqual(compacted, cloned)) {
+    if(false) {
       pendingCompactionNotifyRef.current = compacted;
     }

[NoCoverage] BlockStatement
src/components/Grid/GridLayout.tsx:493:50
     // freshly-added item's own `.style.transform` measured as an empty
     // string, sitting exactly on top of the grid's own first item.
     const compacted = (compactor ?? getCompactor(compactType)).compact(cloned, colNum, { compactType });
-    if(!layoutPositionsEqual(compacted, cloned)) {
-      pendingCompactionNotifyRef.current = compacted;
-    }
+    if(!layoutPositionsEqual(compacted, cloned)) {}
     workingLayoutRef.current = compacted;
     setWorkingLayout(compacted);

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:510:19
   // Also fires whatever `pendingCompactionNotifyRef` above queued — see
   // that ref's own doc comment for why `onLayoutChange` itself can't be
   // called synchronously from the render-phase sync block that sets it.
-  useEffect(() => {
-    if(pendingUndoSnapshotRef.current) {
-      commitUndoPoint(pendingUndoSnapshotRef.current);
-      pendingUndoSnapshotRef.current = null;
-    }
-    if(pendingCompactionNotifyRef.current) {
-      onLayoutChange?.(pendingCompactionNotifyRef.current);
-      pendingCompactionNotifyRef.current = null;
-    }
-  }, [workingLayout, commitUndoPoint, onLayoutChange]);
+  useEffect(() => {}, [workingLayout, commitUndoPoint, onLayoutChange]);
 
   // Prunes any selected id that no longer matches a real item — e.g.
killedBy: GridLayout undo/redo Should treat an externally-driven layout length change as an undo-tracked action
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:511:40
   // that ref's own doc comment for why `onLayoutChange` itself can't be
   // called synchronously from the render-phase sync block that sets it.
   useEffect(() => {
-    if(pendingUndoSnapshotRef.current) {
-      commitUndoPoint(pendingUndoSnapshotRef.current);
-      pendingUndoSnapshotRef.current = null;
-    }
+    if(pendingUndoSnapshotRef.current) {}
     if(pendingCompactionNotifyRef.current) {
       onLayoutChange?.(pendingCompactionNotifyRef.current);
killedBy: GridLayout undo/redo Should treat an externally-driven layout length change as an undo-tracked action
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:515:8
       commitUndoPoint(pendingUndoSnapshotRef.current);
       pendingUndoSnapshotRef.current = null;
     }
-    if(pendingCompactionNotifyRef.current) {
+    if(true) {
       onLayoutChange?.(pendingCompactionNotifyRef.current);
       pendingCompactionNotifyRef.current = null;
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: Cannot read properties of null (reading 'map')

[Timeout] ConditionalExpression
src/components/Grid/GridLayout.tsx:515:8
       commitUndoPoint(pendingUndoSnapshotRef.current);
       pendingUndoSnapshotRef.current = null;
     }
-    if(pendingCompactionNotifyRef.current) {
+    if(false) {
       onLayoutChange?.(pendingCompactionNotifyRef.current);
       pendingCompactionNotifyRef.current = null;

[NoCoverage] OptionalChaining
src/components/Grid/GridLayout.tsx:516:7
       pendingUndoSnapshotRef.current = null;
     }
     if(pendingCompactionNotifyRef.current) {
-      onLayoutChange?.(pendingCompactionNotifyRef.current);
+      onLayoutChange(pendingCompactionNotifyRef.current);
       pendingCompactionNotifyRef.current = null;
     }

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:536:12
       let changed = false;
       const next = new Set<string | number>();
       prev.forEach(id => {
-        if(validIds.has(id)) {
+        if(false) {
           next.add(id);
         } else {
killedBy: GridLayout multiSelect Should prune a selected id when its item is removed via an external layout change
statusReason: expected [] to strictly equal [ '1' ]

[Survived] MethodExpression
src/components/Grid/GridLayout.tsx:554:45
     // (a ref), so this doesn't need its own separate effect/dependency
     // wiring — just checked alongside the identical `workingLayout`
     // dependency the selection-pruning check above already has.
-    if(lastAnchorIdRef.current !== null && !workingLayout.some(item => item.i === lastAnchorIdRef.current)) {
+    if(lastAnchorIdRef.current !== null && !workingLayout.every(item => item.i === lastAnchorIdRef.current)) {
       lastAnchorIdRef.current = null;
     }

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:557:6
     if(lastAnchorIdRef.current !== null && !workingLayout.some(item => item.i === lastAnchorIdRef.current)) {
       lastAnchorIdRef.current = null;
     }
-  }, [workingLayout]);
+  }, []);
 
   // `onSelectionChanged` (matching Vue's own `EGridLayoutEvent.

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:592:8
   onSelectionChangedRef.current = onSelectionChanged;
   const hasMountedSelectionEffectRef = useRef(false);
   useEffect(() => {
-    if(!hasMountedSelectionEffectRef.current) {
+    if(false) {
       hasMountedSelectionEffectRef.current = true;
       return;
killedBy: GridLayout onSelectionChanged Should not fire on initial mount
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [],

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:634:8
   onColumnsChangedRef.current = onColumnsChanged;
   const hasMountedColNumEffectRef = useRef(false);
   useEffect(() => {
-    if(!hasMountedColNumEffectRef.current) {
+    if(true) {
       hasMountedColNumEffectRef.current = true;
       return;
killedBy: GridLayout onColumnsChanged Should fire with the new value when the colNum prop itself changes
statusReason: expected "vi.fn()" to be called with arguments: [ 6 ]

Number of calls: 0

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:648:30
       return undefined;
     }
     const measure = (): void => {
-      if(el.offsetWidth > 0) {
-        setContainerWidth(el.offsetWidth);
-        setHasMeasuredWidth(true);
-      }
+      if(el.offsetWidth > 0) {}
     };
     measure();
killedBy: GridLayout onLayoutReady Should call onLayoutReady exactly once, after the first successful container-width measurement, with the current layout
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:673:23
    * feature for a consumer who doesn't enable it.
    */
   useEffect(() => {
-    if(!responsive || !hasMeasuredWidth) {
+    if(!responsive || hasMeasuredWidth) {
       return;
     }
killedBy: GridLayout responsive Should resolve the active breakpoint from the measured container width and call onBreakpointChange
statusReason: expected "vi.fn()" to be called with arguments: [ 'xs', 4 ]

Received:

  1st vi.fn() call:

  [
-   "xs",

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:673:42
    * feature for a consumer who doesn't enable it.
    */
   useEffect(() => {
-    if(!responsive || !hasMeasuredWidth) {
-      return;
-    }
+    if(!responsive || !hasMeasuredWidth) {}
     const newBreakpoint = getBreakpointFromWidth(breakpoints, containerWidth);
     if(newBreakpoint === currentBreakpoint) {
killedBy: GridLayout multiSelect group move Should move every other selected item by the same delta as the dragged anchor
statusReason: expected 2 to be 6 // Object.is equality

[Survived] ObjectLiteral
src/components/Grid/GridLayout.tsx:711:31
         distributeEvenly,
       );
 
-    layoutsCacheRef.current = { ...layoutsCacheRef.current, [newBreakpoint]: nextLayout };
+    layoutsCacheRef.current = {};
     workingLayoutRef.current = nextLayout;
     setWorkingLayout(nextLayout);

[Killed] ObjectLiteral
src/components/Grid/GridLayout.tsx:744:42
     commitLayout(next);
   }, [colNum, commitLayout]);
 
-  const crossGridDrag = useCrossGridDrag({
-    allowCrossGridDrag,
-    containerRef,
-    disableExternalDrop,
-    layoutId,
-    onAcceptExternalItem: acceptExternalCrossGridItem,
-    onCrossGridDropRejected,
-    onCrossGridItemDropped,
-  });
+  const crossGridDrag = useCrossGridDrag({});
 
   /**
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:783:17
   const duplicateItem = useCallback((id: string | number): string | number | null => {
     const next = cloneLayout(workingLayoutRef.current);
     const source = getLayoutItem(next, id);
-    if(!source) {
-      return null;
-    }
+    if(!source) {}
 
     let suffix = 1;
killedBy: GridLayout imperative handle duplicateItem Should return null when the id doesn't match any item currently in the layout
statusReason: Cannot destructure property 'i' of 'source' as it is undefined.

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:783:8
   const duplicateItem = useCallback((id: string | number): string | number | null => {
     const next = cloneLayout(workingLayoutRef.current);
     const source = getLayoutItem(next, id);
-    if(!source) {
+    if(source) {
       return null;
     }
killedBy: GridLayout imperative handle duplicateItem Should clone the item with a new, collision-safe id, placed below the source
statusReason: expected null to be '0-copy' // Object.is equality

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:801:6
     commitForcedCompaction(next);
 
     return newId;
-  }, [commitUndoPoint, commitForcedCompaction]);
+  }, []);
 
   /**

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:822:8
     adjustments: Map<string | number, { x?: number; y?: number }>,
     selectedIds: (string | number)[],
   ): void => {
-    if(adjustments.size === 0) {
+    if(true) {
       return;
     }
killedBy: GridLayout align/distribute alignSelected Should align every other selected item's left edge to the anchor's, without moving the anchor itself
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:840:33
       const candidate = { ...item, ...adjustment };
       if(preventCollision) {
         const collisions = getAllCollisions(next, candidate)
-          .filter(layoutItem => layoutItem.i !== item.i && !selectedIdSet.has(layoutItem.i));
+          .filter(layoutItem => layoutItem.i === item.i && !selectedIdSet.has(layoutItem.i));
         if(collisions.length > 0) {
           return;
killedBy: GridLayout align/distribute alignSelected Should skip an adjustment that would collide with a non-selected item when preventCollision is on
statusReason: expected 5 to be +0 // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:841:12
       if(preventCollision) {
         const collisions = getAllCollisions(next, candidate)
           .filter(layoutItem => layoutItem.i !== item.i && !selectedIdSet.has(layoutItem.i));
-        if(collisions.length > 0) {
+        if(collisions.length >= 0) {
           return;
         }
killedBy: GridLayout align/distribute alignSelected Should apply an adjustment normally when preventCollision is on but that specific adjustment doesn't actually collide with anything — confirmed gap via a fres
statusReason: expected +0 to be 5 // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:848:10
       if(adjustment.x !== undefined) {
         item.x = adjustment.x;
       }
-      if(adjustment.y !== undefined) {
+      if(adjustment.y === undefined) {
         item.y = adjustment.y;
       }
killedBy: GridLayout align/distribute alignSelected Should align to the top edge
statusReason: expected 10 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/components/Grid/GridLayout.tsx:897:60
    * `options` still overrides the corresponding pre-filled one.
    */
   const exportLayoutAsSvg = useCallback((options?: IExportLayoutAsSvgOptions): string => {
-    return coreExportLayoutAsSvg(workingLayoutRef.current, {
-      colNum,
-      containerWidth: effectiveContainerWidth,
-      margin,
-      rowHeight,
-      ...options,
-    });
+    return coreExportLayoutAsSvg(workingLayoutRef.current, {});
   }, [colNum, effectiveContainerWidth, margin, rowHeight]);
 
killedBy: GridLayout exportLayoutAsSvg Should let an explicit option override the pre-filled grid dimension
statusReason: expected '<svg xmlns="http://www.w3.org/2000/sv…' to contain 'width="2000"'

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:924:46
     }
     const idAsString = String(id);
     const candidates = containerRef.current.querySelectorAll<HTMLElement>(`[data-grid-item-id]`);
-    return Array.from(candidates).find(el => el.getAttribute(`data-grid-item-id`) === idAsString) ?? null;
+    return Array.from(candidates).find(el => false) ?? null;
   }, []);
 
killedBy: GridLayout scrollToItem/focusItem Should scroll the matching item's own element into view
statusReason: expected "vi.fn()" to be called with arguments: [ { behavior: 'smooth', …(2) } ]

Number of calls: 0

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:924:46
     }
     const idAsString = String(id);
     const candidates = containerRef.current.querySelectorAll<HTMLElement>(`[data-grid-item-id]`);
-    return Array.from(candidates).find(el => el.getAttribute(`data-grid-item-id`) === idAsString) ?? null;
+    return Array.from(candidates).find(el => el.getAttribute(`data-grid-item-id`) !== idAsString) ?? null;
   }, []);
 
killedBy: GridLayout scrollToItem/focusItem Should scroll the matching item's own element into view
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:945:6
         resolve();
       }, 0);
     })
-  ), [findItemElement]);
+  ), []);
 
   /** Moves keyboard focus to the item with the given id, if it's currently rendered and focusable — the React port of Vue's own `focusItem`. Same deferral/no-op rationale as `scrollToItem` above. */

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:958:41
   ), [findItemElement]);
 
   const undo = useCallback((): void => {
-    if(historyRef.current.length === 0) {
-      return;
-    }
+    if(historyRef.current.length === 0) {}
     const previous = historyRef.current.pop()!;
     futureRef.current.push(cloneLayout(workingLayoutRef.current));
killedBy: GridLayout undo/redo Should be permanent no-ops when enableUndoRedo is off (the default)
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:958:8
   ), [findItemElement]);
 
   const undo = useCallback((): void => {
-    if(historyRef.current.length === 0) {
+    if(historyRef.current.length !== 0) {
       return;
     }
killedBy: GridLayout align/distribute alignSelected Should be undo-able
statusReason: expected 5 to be +0 // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:970:8
   }, [onLayoutChange]);
 
   const redo = useCallback((): void => {
-    if(futureRef.current.length === 0) {
+    if(futureRef.current.length !== 0) {
       return;
     }
killedBy: GridLayout undo/redo Should redo after an undo
statusReason: expected +0 to be 2 // Object.is equality

[NoCoverage] BlockStatement
src/components/Grid/GridLayout.tsx:999:24
   const toggleItemSelection = useCallback((id: string | number): void => {
     setSelectedItemIds(prev => {
       const next = new Set(prev);
-      if(next.has(id)) {
-        next.delete(id);
-      } else {
+      if(next.has(id)) {} else {
         next.add(id);
       }

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1010:33
 
   const clearSelection = useCallback((): void => {
     lastAnchorIdRef.current = null;
-    setSelectedItemIds(prev => (prev.size === 0 ? prev : new Set()));
+    setSelectedItemIds(prev => (prev.size !== 0 ? prev : new Set()));
   }, []);
 
killedBy: GridLayout multiSelect Should clear the selection when clicking the grid's own empty background
statusReason: expected [ '0' ] to strictly equal []

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1041:30
     if(!multiSelect) {
       return;
     }
-    if(modifiers.shiftKey && lastAnchorIdRef.current !== null) {
+    if(modifiers.shiftKey && lastAnchorIdRef.current === null) {
       const range = computeRangeSelection(workingLayoutRef.current, lastAnchorIdRef.current, id);
       setSelectedItemIds(new Set(range));
killedBy: GridLayout multiSelect Should compute the same range again (not toggle it back off) on a second, repeated Shift+click to the same target
statusReason: expected [ '0' ] to strictly equal [ '0', '1' ]

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1046:8
       setSelectedItemIds(new Set(range));
       return;
     }
-    if(modifiers.shiftKey || modifiers.ctrlKey || modifiers.metaKey) {
+    if(false) {
       toggleItemSelection(id);
     } else {
killedBy: GridLayout multiSelect Should toggle an item into the selection with a Ctrl+click, preserving the rest
statusReason: expected [ '1' ] to strictly equal [ '0', '1' ]

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1046:8
       setSelectedItemIds(new Set(range));
       return;
     }
-    if(modifiers.shiftKey || modifiers.ctrlKey || modifiers.metaKey) {
+    if(false || modifiers.metaKey) {
       toggleItemSelection(id);
     } else {
killedBy: GridLayout multiSelect Should toggle an item into the selection with a Ctrl+click, preserving the rest
statusReason: expected [ '1' ] to strictly equal [ '0', '1' ]

[Killed] ArrayDeclaration
src/components/Grid/GridLayout.tsx:1049:34
     if(modifiers.shiftKey || modifiers.ctrlKey || modifiers.metaKey) {
       toggleItemSelection(id);
     } else {
-      setSelectedItemIds(new Set([id]));
+      setSelectedItemIds(new Set([]));
     }
     lastAnchorIdRef.current = id;
killedBy: GridLayout multiSelect Should select an item exclusively on a plain click
statusReason: expected [] to strictly equal [ '0' ]

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1056:46
 
   const handleBackgroundClick = useCallback((event: MouseEvent<HTMLDivElement>): void => {
-    if(event.target === event.currentTarget) {
-      clearSelection();
-    }
+    if(event.target === event.currentTarget) {}
   }, [clearSelection]);
 
killedBy: GridLayout multiSelect Should clear the selection when clicking the grid's own empty background
statusReason: expected [ '0' ] to strictly equal []

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1063:14
 
   useImperativeHandle(ref, () => ({
     alignSelected,
-    canRedo: futureRef.current.length > 0,
+    canRedo: futureRef.current.length <= 0,
     canUndo: historyRef.current.length > 0,
     clearSelection,
killedBy: GridLayout undo/redo Should default canUndo/canRedo to false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1064:14
   useImperativeHandle(ref, () => ({
     alignSelected,
     canRedo: futureRef.current.length > 0,
-    canUndo: historyRef.current.length > 0,
+    canUndo: false,
     clearSelection,
     compactNow,
killedBy: GridLayout undo/redo Should undo a drag back to its pre-drag position
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/components/Grid/GridLayout.tsx:1105:24
    * whole picture).
    */
   const updateGuidesAndIndicators = useCallback((id: string | number, x: number, y: number, w: number, h: number): void => {
-    const activeItem = { h, i: id, w, x, y };
+    const activeItem = {};
 
     if(showAlignmentGuides) {
killedBy: GridLayout showAlignmentGuides Should render a guide line for each edge alignment found while dragging, and clear them on dragend
statusReason: expected  to have a length of 2 but got +0
