[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1107:8
   const updateGuidesAndIndicators = useCallback((id: string | number, x: number, y: number, w: number, h: number): void => {
     const activeItem = { h, i: id, w, x, y };
 
-    if(showAlignmentGuides) {
+    if(true) {
       const guides = findAlignmentGuides(workingLayoutRef.current, activeItem);
       if(guides.length === 0 || effectiveContainerWidth < 1) {
killedBy: GridLayout showAlignmentGuides Should not render any guide lines by default
statusReason: expected <div …(2)></div>
<div …(2)></div>
…(1) to have a length of +0 but got 3

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1109:33
 
     if(showAlignmentGuides) {
       const guides = findAlignmentGuides(workingLayoutRef.current, activeItem);
-      if(guides.length === 0 || effectiveContainerWidth < 1) {
+      if(guides.length === 0 || effectiveContainerWidth >= 1) {
         setAlignmentGuideStyles([]);
       } else {
killedBy: GridLayout showAlignmentGuides Should render a guide line for each edge alignment found while dragging, and clear them on dragend
statusReason: expected  to have a length of 2 but got +0

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1113:54
         setAlignmentGuideStyles([]);
       } else {
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
-        setAlignmentGuideStyles(guides.map(guide => (guide.axis === `x`
+        setAlignmentGuideStyles(guides.map(guide => (guide.axis !== `x`
           ? { height: `100%`, left: `${guide.position * (colWidth + margin[0]) + margin[0]}px`, top: `0`, width: `1px` }
           : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight + margin[1]) + margin[1]}px`, width: `100%` }
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a vertical (x-axis) guide line at the exact pixel position where two edges align
statusReason: expected '0px' to be '410px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1115:67
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
         setAlignmentGuideStyles(guides.map(guide => (guide.axis === `x`
           ? { height: `100%`, left: `${guide.position * (colWidth + margin[0]) + margin[0]}px`, top: `0`, width: `1px` }
-          : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight + margin[1]) + margin[1]}px`, width: `100%` }
+          : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight - margin[1]) + margin[1]}px`, width: `100%` }
         )));
       }
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a horizontal (y-axis) guide line at the exact pixel position where two edges align
statusReason: expected '190px' to be '230px' // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1122:10
 
     if(showSpacingGuides) {
       const indicators = findSpacingIndicators(workingLayoutRef.current, activeItem);
-      if(indicators.length === 0 || effectiveContainerWidth < 1) {
+      if(true) {
         setSpacingIndicatorStyles([]);
       } else {
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected null to be truthy

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1128:29
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
         setSpacingIndicatorStyles(indicators.map(indicator => {
           if(indicator.axis === `x`) {
-            const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
+            const startPx = indicator.gapStart * (colWidth + margin[0]) - margin[0];
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '500px' to be '510px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1129:27
         setSpacingIndicatorStyles(indicators.map(indicator => {
           if(indicator.axis === `x`) {
             const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
-            const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
+            const endPx = indicator.gapEnd / (colWidth + margin[0]) + margin[0];
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
             return {
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '210.03px' to be '510px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1130:29
           if(indicator.axis === `x`) {
             const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
-            const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
+            const centerY = (y + h / 2) * (rowHeight + margin[1]) - margin[1];
             return {
               label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '100px' to be '120px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1130:30
           if(indicator.axis === `x`) {
             const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
-            const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
+            const centerY = (y - h / 2) * (rowHeight + margin[1]) + margin[1];
             return {
               label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '-100px' to be '120px' // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1132:50
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
             return {
-              label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
+              label: `${indicator.distance} col${true ? `` : `s`}`,
               left: `${(startPx + endPx) / 2}px`,
               top: `${centerY}px`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '2 col' to be '2 cols' // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1141:48
           const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
           const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
           return {
-            label: `${indicator.distance} row${indicator.distance === 1 ? `` : `s`}`,
+            label: `${indicator.distance} row${true ? `` : `s`}`,
             left: `${centerX}px`,
             top: `${(startPxY + endPxY) / 2}px`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position for a vertical (row) gap — confirmed gap via a fresh coverage 
statusReason: expected '4 row' to be '4 rows' // Object.is equality

[Killed] StringLiteral
src/components/Grid/GridLayout.tsx:1142:19
           const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
           return {
             label: `${indicator.distance} row${indicator.distance === 1 ? `` : `s`}`,
-            left: `${centerX}px`,
+            left: ``,
             top: `${(startPxY + endPxY) / 2}px`,
           };
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position for a vertical (row) gap — confirmed gap via a fresh coverage 
statusReason: expected '' to be '110px' // Object.is equality

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:1153:6
   const clearGuidesAndIndicators = useCallback((): void => {
     setAlignmentGuideStyles([]);
     setSpacingIndicatorStyles([]);
-  }, []);
+  }, ["Stryker was here"]);
 
   /**

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:1167:8
    * possible without an awkward second clone.
    */
   const applyGroupMove = useCallback((next: TLayout, eventType: TGridGestureEventType, id: string | number, x: number, y: number): void => {
-    if(!(multiSelect && selectedItemIds.has(id) && selectedItemIds.size > 1)) {
+    if(multiSelect && selectedItemIds.has(id) && selectedItemIds.size > 1) {
       return;
     }
killedBy: GridLayout multiSelect group move Should move every other selected item by the same delta as the dragged anchor
statusReason: expected 4 to be 6 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1170:8
     if(!(multiSelect && selectedItemIds.has(id) && selectedItemIds.size > 1)) {
       return;
     }
-    if(eventType === `dragstart`) {
+    if(true) {
       groupMoveStartPositions.current = new Map(
         Array.from(selectedItemIds, selectedId => {
killedBy: GridLayout multiSelect group move Should move every other selected item by the same delta as the dragged anchor
statusReason: expected 4 to be 6 // Object.is equality

[Killed] LogicalOperator
src/components/Grid/GridLayout.tsx:1174:36
       groupMoveStartPositions.current = new Map(
         Array.from(selectedItemIds, selectedId => {
           const selectedItem = getLayoutItem(next, selectedId);
-          return [selectedId, { x: selectedItem?.x ?? 0, y: selectedItem?.y ?? 0 }];
+          return [selectedId, { x: selectedItem?.x && 0, y: selectedItem?.y ?? 0 }];
         }),
       );
killedBy: GridLayout multiSelect group move Should move every other selected item by the same delta as the dragged anchor
statusReason: expected 2 to be 6 // Object.is equality

[Killed] LogicalOperator
src/components/Grid/GridLayout.tsx:1177:16
           return [selectedId, { x: selectedItem?.x ?? 0, y: selectedItem?.y ?? 0 }];
         }),
       );
-    } else if((eventType === `dragmove` || eventType === `dragend`) && groupMoveStartPositions.current.has(id)) {
+    } else if((eventType === `dragmove` && eventType === `dragend`) && groupMoveStartPositions.current.has(id)) {
       const anchorStart = groupMoveStartPositions.current.get(id)!;
       const dx = x - anchorStart.x;
killedBy: GridLayout multiSelect group move Should move every other selected item by the same delta as the dragged anchor
statusReason: expected 4 to be 6 // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1177:113
           return [selectedId, { x: selectedItem?.x ?? 0, y: selectedItem?.y ?? 0 }];
         }),
       );
-    } else if((eventType === `dragmove` || eventType === `dragend`) && groupMoveStartPositions.current.has(id)) {
-      const anchorStart = groupMoveStartPositions.current.get(id)!;
-      const dx = x - anchorStart.x;
-      const dy = y - anchorStart.y;
-      groupMoveStartPositions.current.forEach((startPos, passengerId) => {
-        if(passengerId === id) {
-          return;
-        }
-        const passenger = getLayoutItem(next, passengerId);
-        if(passenger && !passenger.isStatic && passenger.isDraggable !== false) {
-          passenger.x = Math.max(startPos.x + dx, 0);
-          passenger.y = Math.max(startPos.y + dy, 0);
-        }
-      });
-    }
+    } else if((eventType === `dragmove` || eventType === `dragend`) && groupMoveStartPositions.current.has(id)) {}
   }, [multiSelect, selectedItemIds]);
 
killedBy: GridLayout multiSelect group move Should move every other selected item by the same delta as the dragged anchor
statusReason: expected 4 to be 6 // Object.is equality

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:1186:74
           return;
         }
         const passenger = getLayoutItem(next, passengerId);
-        if(passenger && !passenger.isStatic && passenger.isDraggable !== false) {
+        if(passenger && !passenger.isStatic && passenger.isDraggable !== true) {
           passenger.x = Math.max(startPos.x + dx, 0);
           passenger.y = Math.max(startPos.y + dy, 0);
killedBy: GridLayout multiSelect group move Should not move a passenger with isDraggable: false during a group drag
statusReason: expected 6 to be 4 // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1186:81
           return;
         }
         const passenger = getLayoutItem(next, passengerId);
-        if(passenger && !passenger.isStatic && passenger.isDraggable !== false) {
-          passenger.x = Math.max(startPos.x + dx, 0);
-          passenger.y = Math.max(startPos.y + dy, 0);
-        }
+        if(passenger && !passenger.isStatic && passenger.isDraggable !== false) {}
       });
     }
killedBy: GridLayout multiSelect group move Should move every other selected item by the same delta as the dragged anchor
statusReason: expected 4 to be 6 // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1196:52
 
   const applyGroupResize = useCallback((next: TLayout, eventType: TGridGestureEventType, id: string | number, w: number, h: number): void => {
-    if(!(multiSelect && selectedItemIds.has(id) && selectedItemIds.size > 1)) {
+    if(!(multiSelect && selectedItemIds.has(id) && selectedItemIds.size <= 1)) {
       return;
     }
killedBy: GridLayout multiSelect group resize Should resize every other selected item by the same delta as the resized anchor
statusReason: expected 3 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1199:8
     if(!(multiSelect && selectedItemIds.has(id) && selectedItemIds.size > 1)) {
       return;
     }
-    if(eventType === `resizestart`) {
+    if(false) {
       groupResizeStartSizes.current = new Map(
         Array.from(selectedItemIds, selectedId => {
killedBy: GridLayout multiSelect group resize Should resize every other selected item by the same delta as the resized anchor
statusReason: expected 3 to be 5 // Object.is equality

[Killed] OptionalChaining
src/components/Grid/GridLayout.tsx:1203:61
       groupResizeStartSizes.current = new Map(
         Array.from(selectedItemIds, selectedId => {
           const selectedItem = getLayoutItem(next, selectedId);
-          return [selectedId, { h: selectedItem?.h ?? 1, w: selectedItem?.w ?? 1 }];
+          return [selectedId, { h: selectedItem?.h ?? 1, w: selectedItem.w ?? 1 }];
         }),
       );
killedBy: GridLayout multiSelect group resize Should default a selected id's own snapshot size to 1,1 when its layout entry can't be found at resizestart — confirmed gap via a fresh coverage report
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1215:12
           return;
         }
         const passenger = getLayoutItem(next, passengerId);
-        if(passenger && !passenger.isStatic && passenger.isResizable !== false) {
+        if(false) {
           passenger.w = Math.min(Math.max(startSize.w + dw, passenger.minW ?? 1), passenger.maxW ?? Infinity);
           passenger.h = Math.min(Math.max(startSize.h + dh, passenger.minH ?? 1), passenger.maxH ?? Infinity);
killedBy: GridLayout multiSelect group resize Should resize every other selected item by the same delta as the resized anchor
statusReason: expected 3 to be 5 // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1215:81
           return;
         }
         const passenger = getLayoutItem(next, passengerId);
-        if(passenger && !passenger.isStatic && passenger.isResizable !== false) {
-          passenger.w = Math.min(Math.max(startSize.w + dw, passenger.minW ?? 1), passenger.maxW ?? Infinity);
-          passenger.h = Math.min(Math.max(startSize.h + dh, passenger.minH ?? 1), passenger.maxH ?? Infinity);
-        }
+        if(passenger && !passenger.isStatic && passenger.isResizable !== false) {}
       });
     }
killedBy: GridLayout multiSelect group resize Should resize every other selected item by the same delta as the resized anchor
statusReason: expected 3 to be 5 // Object.is equality

[Killed] LogicalOperator
src/components/Grid/GridLayout.tsx:1216:61
         }
         const passenger = getLayoutItem(next, passengerId);
         if(passenger && !passenger.isStatic && passenger.isResizable !== false) {
-          passenger.w = Math.min(Math.max(startSize.w + dw, passenger.minW ?? 1), passenger.maxW ?? Infinity);
+          passenger.w = Math.min(Math.max(startSize.w + dw, passenger.minW && 1), passenger.maxW ?? Infinity);
           passenger.h = Math.min(Math.max(startSize.h + dh, passenger.minH ?? 1), passenger.maxH ?? Infinity);
         }
killedBy: GridLayout multiSelect group resize Should resize every other selected item by the same delta as the resized anchor
statusReason: expected NaN to be 5 // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1217:43
         const passenger = getLayoutItem(next, passengerId);
         if(passenger && !passenger.isStatic && passenger.isResizable !== false) {
           passenger.w = Math.min(Math.max(startSize.w + dw, passenger.minW ?? 1), passenger.maxW ?? Infinity);
-          passenger.h = Math.min(Math.max(startSize.h + dh, passenger.minH ?? 1), passenger.maxH ?? Infinity);
+          passenger.h = Math.min(Math.max(startSize.h - dh, passenger.minH ?? 1), passenger.maxH ?? Infinity);
         }
       });
killedBy: GridLayout multiSelect group resize Should clamp a passenger's own grown height to its own maxH during a group resize
statusReason: expected 1 to be 4 // Object.is equality

[Killed] MethodExpression
src/components/Grid/GridLayout.tsx:1217:34
         const passenger = getLayoutItem(next, passengerId);
         if(passenger && !passenger.isStatic && passenger.isResizable !== false) {
           passenger.w = Math.min(Math.max(startSize.w + dw, passenger.minW ?? 1), passenger.maxW ?? Infinity);
-          passenger.h = Math.min(Math.max(startSize.h + dh, passenger.minH ?? 1), passenger.maxH ?? Infinity);
+          passenger.h = Math.min(Math.min(startSize.h + dh, passenger.minH ?? 1), passenger.maxH ?? Infinity);
         }
       });
killedBy: GridLayout multiSelect group resize Should clamp a passenger's own grown height to its own maxH during a group resize
statusReason: expected 1 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1226:8
   const handleItemDrag = useCallback((id: string | number, eventType: TGridGestureEventType, x: number, y: number, w: number, h: number, clientX?: number, clientY?: number): void => {
     const next = cloneLayout(workingLayoutRef.current);
     const item = getLayoutItem(next, id);
-    if(!item) {
+    if(false) {
       return;
     }
killedBy: GridLayout Should not throw when a drag reports an id no longer present in the layout (a plausible race: item removed mid-gesture)
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1240:10
       // compacts along (`y` for VERTICAL/NONE, `x` for HORIZONTAL; the
       // two `*_OVERLAP` types never consult `minPositions` at all, so
       // snapshotting either axis for them would be inert either way).
-      if(restoreOnDrag) {
+      if(true) {
         const axis = compactType === ECompactType.HORIZONTAL ? `x` : `y`;
         dragMinPositionsRef.current = Object.fromEntries(
killedBy: GridLayout multiSelect group move Should move every other selected item by the same delta as the dragged anchor
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1241:22
       // two `*_OVERLAP` types never consult `minPositions` at all, so
       // snapshotting either axis for them would be inert either way).
       if(restoreOnDrag) {
-        const axis = compactType === ECompactType.HORIZONTAL ? `x` : `y`;
+        const axis = true ? `x` : `y`;
         dragMinPositionsRef.current = Object.fromEntries(
           next.filter(entry => entry.i !== id).map(entry => [entry.i, { [axis]: entry[axis] }]),
killedBy: GridLayout restoreOnDrag Should not let another item compact past its own pre-drag position while a drag is in progress
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1243:32
       if(restoreOnDrag) {
         const axis = compactType === ECompactType.HORIZONTAL ? `x` : `y`;
         dragMinPositionsRef.current = Object.fromEntries(
-          next.filter(entry => entry.i !== id).map(entry => [entry.i, { [axis]: entry[axis] }]),
+          next.filter(entry => false).map(entry => [entry.i, { [axis]: entry[axis] }]),
         );
       } else {
killedBy: GridLayout restoreOnDrag Should not let another item compact past its own pre-drag position while a drag is in progress
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1265:8
     // else-if's own branch point with the preceding case the way v8's
     // own coverage instrumentation treats an else-if chain.
     /* v8 ignore next 3 -- see the comment above: unreachable since eventType can never be a fourth value the native handler would forward. */
-    if(eventType === `dragend`) {
+    if(true) {
       onDragEnd?.(id);
     }
killedBy: GridLayout onDragStart/onDragMove/onDragEnd Should call onDragStart/onDragMove/onDragEnd at the right gesture phases, with the dragged item's own id
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "a",

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1269:92
       onDragEnd?.(id);
     }
 
-    if(eventType === `dragend` && crossGridDrag.handleDragEnd(id, clientX, clientY, item)) {
-      // Accepted by another grid — the item no longer belongs to this
-      // one at all: remove it and commit that, skipping the normal
-      // moveElement/snap/group-move path entirely (there's nothing left
-      // here to move).
-      const withoutItem = next.filter(entry => entry.i !== id);
-      clearGuidesAndIndicators();
-      dragMinPositionsRef.current = undefined;
-      setIsAnyItemDragging(false);
-      setItemGesturePlaceholder(null);
-      commitLayout(withoutItem);
-      return;
-    }
+    if(eventType === `dragend` && crossGridDrag.handleDragEnd(id, clientX, clientY, item)) {}
 
     // Magnetic snapping — changes where the item actually lands, unlike
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1269:8
       onDragEnd?.(id);
     }
 
-    if(eventType === `dragend` && crossGridDrag.handleDragEnd(id, clientX, clientY, item)) {
+    if(eventType !== `dragend` && crossGridDrag.handleDragEnd(id, clientX, clientY, item)) {
       // Accepted by another grid — the item no longer belongs to this
       // one at all: remove it and commit that, skipping the normal
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1290:77
     // where there's no drag delta yet to snap).
     let resolvedX = x;
     let resolvedY = y;
-    if(snapToGrid && (eventType === `dragmove` || eventType === `dragend`)) {
-      const adjustment = findSnapAdjustment(next, { h: item.h, i: id, w: item.w, x, y }, snapThreshold);
-      if(adjustment.x !== undefined) {
-        resolvedX = adjustment.x;
-      }
-      if(adjustment.y !== undefined) {
-        resolvedY = adjustment.y;
-      }
-    }
+    if(snapToGrid && (eventType === `dragmove` || eventType === `dragend`)) {}
 
     applyGroupMove(next, eventType, id, resolvedX, resolvedY);
killedBy: GridLayout snapToGrid Should snap a drag within snapThreshold to align with another item's edge, landing somewhere other than the raw (unsnapped) position
statusReason: expected 2 to be 3 // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1302:8
 
     applyGroupMove(next, eventType, id, resolvedX, resolvedY);
 
-    if(eventType === `dragend`) {
+    if(eventType !== `dragend`) {
       clearGuidesAndIndicators();
     } else {
killedBy: GridLayout showAlignmentGuides Should render a guide line for each edge alignment found while dragging, and clear them on dragend
statusReason: expected  to have a length of 2 but got +0

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1315:63
     // `resolvedX`/`resolvedY` (post-snap, pre-collision-resolution) as
     // the "where is this drag currently heading" position — the same
     // value `moveElement` below is about to resolve against collisions.
-    if(eventType === `dragstart` || eventType === `dragmove`) {
-      setItemGesturePlaceholder({ h, w, x: resolvedX, y: resolvedY });
-    }
+    if(eventType === `dragstart` || eventType === `dragmove`) {}
 
     const preMoveX = item.x;
killedBy: GridLayout renderPlaceholder — regular in-grid drag/resize Should render the fallback .kdl-grid-placeholder box during a regular in-grid drag, when no renderPlaceholder is provided
statusReason: expected null to be truthy

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1315:8
     // `resolvedX`/`resolvedY` (post-snap, pre-collision-resolution) as
     // the "where is this drag currently heading" position — the same
     // value `moveElement` below is about to resolve against collisions.
-    if(eventType === `dragstart` || eventType === `dragmove`) {
+    if(eventType !== `dragstart` || eventType === `dragmove`) {
       setItemGesturePlaceholder({ h, w, x: resolvedX, y: resolvedY });
     }
killedBy: GridLayout renderPlaceholder — regular in-grid drag/resize Should render the fallback .kdl-grid-placeholder box during a regular in-grid drag, when no renderPlaceholder is provided
statusReason: expected null to be truthy

[Killed] ObjectLiteral
src/components/Grid/GridLayout.tsx:1316:33
     // the "where is this drag currently heading" position — the same
     // value `moveElement` below is about to resolve against collisions.
     if(eventType === `dragstart` || eventType === `dragmove`) {
-      setItemGesturePlaceholder({ h, w, x: resolvedX, y: resolvedY });
+      setItemGesturePlaceholder({});
     }
 
killedBy: GridLayout renderPlaceholder — regular in-grid drag/resize Should call renderPlaceholder with the live placeholder and isDragging:true during a regular in-grid drag, instead of the fallback box
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1334:9
     // otherwise look like a blocked move too). Matches the Vue
     // package's own `dragEvent`'s identical check.
     const movedItem = getLayoutItem(moved, id);
-    if((resolvedX !== preMoveX || resolvedY !== preMoveY) && movedItem?.x === preMoveX && movedItem?.y === preMoveY) {
+    if((true) && movedItem?.x === preMoveX && movedItem?.y === preMoveY) {
       onMoveBlockedByCollision?.(id);
     }
killedBy: GridLayout onMoveBlockedByCollision Should not fire when preventCollision is off (the collision is resolved by pushing, not blocking)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 2 times

Received:

  1st vi.fn() call:

    Array [
      "a",

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1334:8
     // otherwise look like a blocked move too). Matches the Vue
     // package's own `dragEvent`'s identical check.
     const movedItem = getLayoutItem(moved, id);
-    if((resolvedX !== preMoveX || resolvedY !== preMoveY) && movedItem?.x === preMoveX && movedItem?.y === preMoveY) {
+    if(false) {
       onMoveBlockedByCollision?.(id);
     }
killedBy: GridLayout onMoveBlockedByCollision Should fire when a drag is fully blocked by preventCollision
statusReason: expected "vi.fn()" to be called with arguments: [ 'a' ]

Number of calls: 0

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1339:33
     }
     const minPositionsForThisCommit = (eventType === `dragmove` || eventType === `dragend`) ? dragMinPositionsRef.current : undefined;
     commitLayout(moved, minPositionsForThisCommit);
-    if(eventType === `dragend`) {
-      dragMinPositionsRef.current = undefined;
-      setIsAnyItemDragging(false);
-      setItemGesturePlaceholder(null);
-    }
+    if(eventType === `dragend`) {}
 
killedBy: GridLayout renderPlaceholder — regular in-grid drag/resize Should render the fallback .kdl-grid-placeholder box during a regular in-grid drag, when no renderPlaceholder is provided
statusReason: expected <div …(2)></div> to be falsy
