[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1360:84
     let clampedW = w;
     let clampedH = h;
     if(preventCollision) {
-      const collisions = getAllCollisions(next, { ...item, h, w }).filter(other => other.i !== item.i);
+      const collisions = getAllCollisions(next, { ...item, h, w }).filter(other => other.i === item.i);
       if(collisions.length > 0) {
         let leastX = Infinity;
killedBy: GridLayout Should clamp the resized size when preventCollision is on and it would collide
statusReason: expected 12 to be 4 // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1361:10
     let clampedH = h;
     if(preventCollision) {
       const collisions = getAllCollisions(next, { ...item, h, w }).filter(other => other.i !== item.i);
-      if(collisions.length > 0) {
+      if(collisions.length <= 0) {
         let leastX = Infinity;
         let leastY = Infinity;
killedBy: GridLayout Should clamp the resized size when preventCollision is on and it would collide
statusReason: expected 12 to be 4 // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1365:32
         let leastX = Infinity;
         let leastY = Infinity;
         collisions.forEach(other => {
-          if(other.x > item.x) {
-            leastX = Math.min(leastX, other.x);
-          }
+          if(other.x > item.x) {}
           if(other.y > item.y) {
             leastY = Math.min(leastY, other.y);
killedBy: GridLayout Should clamp the resized size when preventCollision is on and it would collide
statusReason: expected 12 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1368:14
           if(other.x > item.x) {
             leastX = Math.min(leastX, other.x);
           }
-          if(other.y > item.y) {
+          if(false) {
             leastY = Math.min(leastY, other.y);
           }
killedBy: GridLayout Should clamp the resized height when preventCollision is on and it would collide vertically
statusReason: expected 47 to be 4 // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1368:32
           if(other.x > item.x) {
             leastX = Math.min(leastX, other.x);
           }
-          if(other.y > item.y) {
-            leastY = Math.min(leastY, other.y);
-          }
+          if(other.y > item.y) {}
         });
         if(Number.isFinite(leastX)) {
killedBy: GridLayout Should clamp the resized height when preventCollision is on and it would collide vertically
statusReason: expected 47 to be 4 // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1388:35
 
     applyGroupResize(next, eventType, id, clampedW, clampedH);
 
-    if(eventType === `resizeend`) {
-      clearGuidesAndIndicators();
-      setItemGesturePlaceholder(null);
-    } else {
+    if(eventType === `resizeend`) {} else {
       updateGuidesAndIndicators(id, x, y, clampedW, clampedH);
       // Regular in-grid resize placeholder — same rationale as
killedBy: GridLayout showAlignmentGuides Should also render guide lines while resizing, cleared on resizeend
statusReason: expected <div …(2)></div>
<div …(2)></div> to have a length of +0 but got 2

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1391:12
     if(eventType === `resizeend`) {
       clearGuidesAndIndicators();
       setItemGesturePlaceholder(null);
-    } else {
-      updateGuidesAndIndicators(id, x, y, clampedW, clampedH);
-      // Regular in-grid resize placeholder — same rationale as
-      // handleItemDrag's own identical addition above. Uses the
-      // resize's own in-progress x/y/w/h directly, matching the same
-      // "where is this gesture currently heading" semantics.
-      setItemGesturePlaceholder({ h: clampedH, w: clampedW, x, y });
-    }
+    } else {}
 
     item.w = clampedW;
killedBy: GridLayout showAlignmentGuides Should also render guide lines while resizing, cleared on resizeend
statusReason: expected 0 to be greater than 0

[Survived] ObjectLiteral
src/components/Grid/GridLayout.tsx:1397:33
       // handleItemDrag's own identical addition above. Uses the
       // resize's own in-progress x/y/w/h directly, matching the same
       // "where is this gesture currently heading" semantics.
-      setItemGesturePlaceholder({ h: clampedH, w: clampedW, x, y });
+      setItemGesturePlaceholder({});
     }
 

[Killed] ObjectLiteral
src/components/Grid/GridLayout.tsx:1466:12
     let y = Math.round((top - margin[1]) / (rowHeight + margin[1]));
     x = Math.max(Math.min(x, colNum - outsideDropWidth), 0);
     y = Math.max(Math.min(y, maxRows - outsideDropHeight), 0);
-    return { x, y };
+    return {};
   }, [effectiveContainerWidth, margin, colNum, rowHeight, maxRows, outsideDropWidth, outsideDropHeight]);
 
killedBy: GridLayout allowOutsideDrop Should compute the placeholder's exact pixel height/left/top/width, not just show something
statusReason: expected '' to be '110px' // Object.is equality

[Killed] LogicalOperator
src/components/Grid/GridLayout.tsx:1489:8
   }, [allowOutsideDrop, outsideDropAccepted]);
 
   const handleOutsideDragOver = useCallback((event: DragEvent<HTMLDivElement>): void => {
-    if(!allowOutsideDrop || !outsideDropAccepted(event.dataTransfer)) {
+    if(!allowOutsideDrop && !outsideDropAccepted(event.dataTransfer)) {
       return;
     }
killedBy: GridLayout allowOutsideDrop Should not show a placeholder or call onOutsideDrop when allowOutsideDrop is off (the default)
statusReason: expected <div …(2)></div> to be falsy

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1489:8
   }, [allowOutsideDrop, outsideDropAccepted]);
 
   const handleOutsideDragOver = useCallback((event: DragEvent<HTMLDivElement>): void => {
-    if(!allowOutsideDrop || !outsideDropAccepted(event.dataTransfer)) {
+    if(false) {
       return;
     }
killedBy: GridLayout allowOutsideDrop Should not show a placeholder or call onOutsideDrop when allowOutsideDrop is off (the default)
statusReason: expected <div …(2)></div> to be falsy

[Killed] ArrayDeclaration
src/components/Grid/GridLayout.tsx:1499:6
     const rect = event.currentTarget.getBoundingClientRect();
     const { x, y } = outsideDropPositionFromEvent(event.clientX, event.clientY, rect);
     setOutsideDropPlaceholder({ h: outsideDropHeight, w: outsideDropWidth, x, y });
-  }, [allowOutsideDrop, outsideDropAccepted, outsideDropPositionFromEvent, outsideDropWidth, outsideDropHeight]);
+  }, []);
 
   const handleOutsideDragLeave = useCallback((event: DragEvent<HTMLDivElement>): void => {
killedBy: GridLayout allowOutsideDrop Should compute the placeholder's exact pixel height/left/top/width, not just show something
statusReason: expected '1010px' to be '110px' // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1507:8
     }
     event.preventDefault();
     dragEnterCountRef.current = Math.max(0, dragEnterCountRef.current - 1);
-    if(dragEnterCountRef.current === 0) {
+    if(dragEnterCountRef.current !== 0) {
       setOutsideDropPlaceholder(null);
     }
killedBy: GridLayout allowOutsideDrop Should only clear the placeholder once the dragenter/dragleave count nets back to zero
statusReason: expected null to be truthy

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1513:71
   }, [allowOutsideDrop]);
 
   const handleOutsideDrop = useCallback((event: DragEvent<HTMLDivElement>): void => {
-    if(!allowOutsideDrop || !outsideDropAccepted(event.dataTransfer)) {
-      return;
-    }
+    if(!allowOutsideDrop || !outsideDropAccepted(event.dataTransfer)) {}
     event.preventDefault();
     dragEnterCountRef.current = 0;
killedBy: GridLayout allowOutsideDrop Should not call onOutsideDrop on an actual drop event when allowOutsideDrop is off (the default)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1525:33
   }, [allowOutsideDrop, outsideDropAccepted, outsideDropPositionFromEvent, outsideDropWidth, outsideDropHeight, onOutsideDrop]);
 
   const outsideDropPlaceholderStyle = useMemo((): CSSProperties | null => {
-    if(!outsideDropPlaceholder) {
-      return null;
-    }
+    if(!outsideDropPlaceholder) {}
     const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
     return {
killedBy: GridLayout allowOutsideDrop Should not show a placeholder or call onOutsideDrop when allowOutsideDrop is off (the default)
statusReason: Cannot read properties of null (reading 'h')

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1531:65
     const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
     return {
       height: `${Math.round(rowHeight * outsideDropPlaceholder.h + Math.max(0, outsideDropPlaceholder.h - 1) * margin[1])}px`,
-      left: `${Math.round(colWidth * outsideDropPlaceholder.x + (outsideDropPlaceholder.x + 1) * margin[0])}px`,
+      left: `${Math.round(colWidth * outsideDropPlaceholder.x + (outsideDropPlaceholder.x + 1) / margin[0])}px`,
       top: `${Math.round(rowHeight * outsideDropPlaceholder.y + (outsideDropPlaceholder.y + 1) * margin[1])}px`,
       width: `${Math.round(colWidth * outsideDropPlaceholder.w + Math.max(0, outsideDropPlaceholder.w - 1) * margin[0])}px`,
killedBy: GridLayout allowOutsideDrop Should compute the placeholder's exact pixel height/left/top/width, not just show something
statusReason: expected '90px' to be '110px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1532:66
     return {
       height: `${Math.round(rowHeight * outsideDropPlaceholder.h + Math.max(0, outsideDropPlaceholder.h - 1) * margin[1])}px`,
       left: `${Math.round(colWidth * outsideDropPlaceholder.x + (outsideDropPlaceholder.x + 1) * margin[0])}px`,
-      top: `${Math.round(rowHeight * outsideDropPlaceholder.y + (outsideDropPlaceholder.y + 1) * margin[1])}px`,
+      top: `${Math.round(rowHeight * outsideDropPlaceholder.y + (outsideDropPlaceholder.y - 1) * margin[1])}px`,
       width: `${Math.round(colWidth * outsideDropPlaceholder.w + Math.max(0, outsideDropPlaceholder.w - 1) * margin[0])}px`,
     };
killedBy: GridLayout allowOutsideDrop Should compute the placeholder's exact pixel height/left/top/width, not just show something
statusReason: expected '100px' to be '120px' // Object.is equality

[Killed] MethodExpression
src/components/Grid/GridLayout.tsx:1533:66
       height: `${Math.round(rowHeight * outsideDropPlaceholder.h + Math.max(0, outsideDropPlaceholder.h - 1) * margin[1])}px`,
       left: `${Math.round(colWidth * outsideDropPlaceholder.x + (outsideDropPlaceholder.x + 1) * margin[0])}px`,
       top: `${Math.round(rowHeight * outsideDropPlaceholder.y + (outsideDropPlaceholder.y + 1) * margin[1])}px`,
-      width: `${Math.round(colWidth * outsideDropPlaceholder.w + Math.max(0, outsideDropPlaceholder.w - 1) * margin[0])}px`,
+      width: `${Math.round(colWidth * outsideDropPlaceholder.w + Math.min(0, outsideDropPlaceholder.w - 1) * margin[0])}px`,
     };
   }, [outsideDropPlaceholder, effectiveContainerWidth, margin, colNum, rowHeight]);
killedBy: GridLayout allowOutsideDrop Should compute the placeholder's exact pixel height/left/top/width, not just show something
statusReason: expected '180px' to be '190px' // Object.is equality

[Killed] ArrayDeclaration
src/components/Grid/GridLayout.tsx:1535:6
       top: `${Math.round(rowHeight * outsideDropPlaceholder.y + (outsideDropPlaceholder.y + 1) * margin[1])}px`,
       width: `${Math.round(colWidth * outsideDropPlaceholder.w + Math.max(0, outsideDropPlaceholder.w - 1) * margin[0])}px`,
     };
-  }, [outsideDropPlaceholder, effectiveContainerWidth, margin, colNum, rowHeight]);
+  }, []);
 
   /** Same pixel-conversion formula as `outsideDropPlaceholderStyle` above, applied to the regular in-grid drag/resize tracker instead. */
killedBy: GridLayout allowOutsideDrop Should show a live placeholder on dragover
statusReason: expected null to be truthy

[Timeout] BlockStatement
src/components/Grid/GridLayout.tsx:1538:75
   }, [outsideDropPlaceholder, effectiveContainerWidth, margin, colNum, rowHeight]);
 
   /** Same pixel-conversion formula as `outsideDropPlaceholderStyle` above, applied to the regular in-grid drag/resize tracker instead. */
-  const itemGesturePlaceholderStyle = useMemo((): CSSProperties | null => {
-    if(!itemGesturePlaceholder) {
-      return null;
-    }
-    const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
-    return {
-      height: `${Math.round(rowHeight * itemGesturePlaceholder.h + Math.max(0, itemGesturePlaceholder.h - 1) * margin[1])}px`,
-      left: `${Math.round(colWidth * itemGesturePlaceholder.x + (itemGesturePlaceholder.x + 1) * margin[0])}px`,
-      top: `${Math.round(rowHeight * itemGesturePlaceholder.y + (itemGesturePlaceholder.y + 1) * margin[1])}px`,
-      width: `${Math.round(colWidth * itemGesturePlaceholder.w + Math.max(0, itemGesturePlaceholder.w - 1) * margin[0])}px`,
-    };
-  }, [itemGesturePlaceholder, effectiveContainerWidth, margin, colNum, rowHeight]);
+  const itemGesturePlaceholderStyle = useMemo((): CSSProperties | null => {}, [itemGesturePlaceholder, effectiveContainerWidth, margin, colNum, rowHeight]);
 
   /**

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:1539:8
 
   /** Same pixel-conversion formula as `outsideDropPlaceholderStyle` above, applied to the regular in-grid drag/resize tracker instead. */
   const itemGesturePlaceholderStyle = useMemo((): CSSProperties | null => {
-    if(!itemGesturePlaceholder) {
+    if(itemGesturePlaceholder) {
       return null;
     }
killedBy: GridLayout allowOutsideDrop Should not show a placeholder or call onOutsideDrop when allowOutsideDrop is off (the default)
statusReason: Cannot read properties of null (reading 'h')

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1539:33
 
   /** Same pixel-conversion formula as `outsideDropPlaceholderStyle` above, applied to the regular in-grid drag/resize tracker instead. */
   const itemGesturePlaceholderStyle = useMemo((): CSSProperties | null => {
-    if(!itemGesturePlaceholder) {
-      return null;
-    }
+    if(!itemGesturePlaceholder) {}
     const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
     return {
killedBy: GridLayout allowOutsideDrop Should not show a placeholder or call onOutsideDrop when allowOutsideDrop is off (the default)
statusReason: Cannot read properties of null (reading 'h')

[Timeout] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1544:29
     }
     const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
     return {
-      height: `${Math.round(rowHeight * itemGesturePlaceholder.h + Math.max(0, itemGesturePlaceholder.h - 1) * margin[1])}px`,
+      height: `${Math.round(rowHeight * itemGesturePlaceholder.h - Math.max(0, itemGesturePlaceholder.h - 1) * margin[1])}px`,
       left: `${Math.round(colWidth * itemGesturePlaceholder.x + (itemGesturePlaceholder.x + 1) * margin[0])}px`,
       top: `${Math.round(rowHeight * itemGesturePlaceholder.y + (itemGesturePlaceholder.y + 1) * margin[1])}px`,

[Timeout] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1544:80
     }
     const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
     return {
-      height: `${Math.round(rowHeight * itemGesturePlaceholder.h + Math.max(0, itemGesturePlaceholder.h - 1) * margin[1])}px`,
+      height: `${Math.round(rowHeight * itemGesturePlaceholder.h + Math.max(0, itemGesturePlaceholder.h + 1) * margin[1])}px`,
       left: `${Math.round(colWidth * itemGesturePlaceholder.x + (itemGesturePlaceholder.x + 1) * margin[0])}px`,
       top: `${Math.round(rowHeight * itemGesturePlaceholder.y + (itemGesturePlaceholder.y + 1) * margin[1])}px`,

[Timeout] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1545:65
     const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
     return {
       height: `${Math.round(rowHeight * itemGesturePlaceholder.h + Math.max(0, itemGesturePlaceholder.h - 1) * margin[1])}px`,
-      left: `${Math.round(colWidth * itemGesturePlaceholder.x + (itemGesturePlaceholder.x + 1) * margin[0])}px`,
+      left: `${Math.round(colWidth * itemGesturePlaceholder.x + (itemGesturePlaceholder.x + 1) / margin[0])}px`,
       top: `${Math.round(rowHeight * itemGesturePlaceholder.y + (itemGesturePlaceholder.y + 1) * margin[1])}px`,
       width: `${Math.round(colWidth * itemGesturePlaceholder.w + Math.max(0, itemGesturePlaceholder.w - 1) * margin[0])}px`,

[Timeout] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1545:66
     const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
     return {
       height: `${Math.round(rowHeight * itemGesturePlaceholder.h + Math.max(0, itemGesturePlaceholder.h - 1) * margin[1])}px`,
-      left: `${Math.round(colWidth * itemGesturePlaceholder.x + (itemGesturePlaceholder.x + 1) * margin[0])}px`,
+      left: `${Math.round(colWidth * itemGesturePlaceholder.x + (itemGesturePlaceholder.x - 1) * margin[0])}px`,
       top: `${Math.round(rowHeight * itemGesturePlaceholder.y + (itemGesturePlaceholder.y + 1) * margin[1])}px`,
       width: `${Math.round(colWidth * itemGesturePlaceholder.w + Math.max(0, itemGesturePlaceholder.w - 1) * margin[0])}px`,

[Timeout] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1546:65
     return {
       height: `${Math.round(rowHeight * itemGesturePlaceholder.h + Math.max(0, itemGesturePlaceholder.h - 1) * margin[1])}px`,
       left: `${Math.round(colWidth * itemGesturePlaceholder.x + (itemGesturePlaceholder.x + 1) * margin[0])}px`,
-      top: `${Math.round(rowHeight * itemGesturePlaceholder.y + (itemGesturePlaceholder.y + 1) * margin[1])}px`,
+      top: `${Math.round(rowHeight * itemGesturePlaceholder.y + (itemGesturePlaceholder.y + 1) / margin[1])}px`,
       width: `${Math.round(colWidth * itemGesturePlaceholder.w + Math.max(0, itemGesturePlaceholder.w - 1) * margin[0])}px`,
     };

[Timeout] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1546:66
     return {
       height: `${Math.round(rowHeight * itemGesturePlaceholder.h + Math.max(0, itemGesturePlaceholder.h - 1) * margin[1])}px`,
       left: `${Math.round(colWidth * itemGesturePlaceholder.x + (itemGesturePlaceholder.x + 1) * margin[0])}px`,
-      top: `${Math.round(rowHeight * itemGesturePlaceholder.y + (itemGesturePlaceholder.y + 1) * margin[1])}px`,
+      top: `${Math.round(rowHeight * itemGesturePlaceholder.y + (itemGesturePlaceholder.y - 1) * margin[1])}px`,
       width: `${Math.round(colWidth * itemGesturePlaceholder.w + Math.max(0, itemGesturePlaceholder.w - 1) * margin[0])}px`,
     };

[Timeout] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1547:78
       height: `${Math.round(rowHeight * itemGesturePlaceholder.h + Math.max(0, itemGesturePlaceholder.h - 1) * margin[1])}px`,
       left: `${Math.round(colWidth * itemGesturePlaceholder.x + (itemGesturePlaceholder.x + 1) * margin[0])}px`,
       top: `${Math.round(rowHeight * itemGesturePlaceholder.y + (itemGesturePlaceholder.y + 1) * margin[1])}px`,
-      width: `${Math.round(colWidth * itemGesturePlaceholder.w + Math.max(0, itemGesturePlaceholder.w - 1) * margin[0])}px`,
+      width: `${Math.round(colWidth * itemGesturePlaceholder.w + Math.max(0, itemGesturePlaceholder.w + 1) * margin[0])}px`,
     };
   }, [itemGesturePlaceholder, effectiveContainerWidth, margin, colNum, rowHeight]);

[Timeout] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1547:28
       height: `${Math.round(rowHeight * itemGesturePlaceholder.h + Math.max(0, itemGesturePlaceholder.h - 1) * margin[1])}px`,
       left: `${Math.round(colWidth * itemGesturePlaceholder.x + (itemGesturePlaceholder.x + 1) * margin[0])}px`,
       top: `${Math.round(rowHeight * itemGesturePlaceholder.y + (itemGesturePlaceholder.y + 1) * margin[1])}px`,
-      width: `${Math.round(colWidth * itemGesturePlaceholder.w + Math.max(0, itemGesturePlaceholder.w - 1) * margin[0])}px`,
+      width: `${Math.round(colWidth / itemGesturePlaceholder.w + Math.max(0, itemGesturePlaceholder.w - 1) * margin[0])}px`,
     };
   }, [itemGesturePlaceholder, effectiveContainerWidth, margin, colNum, rowHeight]);

[Timeout] LogicalOperator
src/components/Grid/GridLayout.tsx:1561:29
    * `(placeholder, isDragging)` shape regardless of which of the two
    * gesture types is actually active.
    */
-  const activePlaceholder = itemGesturePlaceholder ?? outsideDropPlaceholder;
+  const activePlaceholder = itemGesturePlaceholder && outsideDropPlaceholder;
   const activePlaceholderStyle = itemGesturePlaceholderStyle ?? outsideDropPlaceholderStyle;
 

[Timeout] LogicalOperator
src/components/Grid/GridLayout.tsx:1562:34
    * gesture types is actually active.
    */
   const activePlaceholder = itemGesturePlaceholder ?? outsideDropPlaceholder;
-  const activePlaceholderStyle = itemGesturePlaceholderStyle ?? outsideDropPlaceholderStyle;
+  const activePlaceholderStyle = itemGesturePlaceholderStyle && outsideDropPlaceholderStyle;
 
   /**

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1569:30
    * wins outright; `null` (its own default) defers entirely to
    * `autoSize` instead — see that prop's own doc comment.
    */
-  const resolvedHeightMode = heightMode !== null ? heightMode : (autoSize ? `auto` : `fixed`);
+  const resolvedHeightMode = heightMode === null ? heightMode : (autoSize ? `auto` : `fixed`);
 
   let containerHeight: string | undefined;
killedBy: GridLayout Should compute a pixel container height from the layout when autoSize is true (the default)
statusReason: expected '' to be '230px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1574:28
   let containerHeight: string | undefined;
   switch(resolvedHeightMode) {
     case `auto`: {
-      containerHeight = `${getBottomYCoordinate(workingLayout) * (rowHeight + margin[1]) + margin[1]}px`;
+      containerHeight = `${getBottomYCoordinate(workingLayout) / (rowHeight + margin[1]) + margin[1]}px`;
       break;
     }
killedBy: GridLayout Should compute a pixel container height from the layout when autoSize is true (the default)
statusReason: expected '10.018181818181818px' to be '230px' // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1586:29
       break;
     }
   }
-  const containerOverflow = resolvedHeightMode === `scroll` || resolvedHeightMode === `fit` ? `auto` : undefined;
+  const containerOverflow = true ? `auto` : undefined;
 
   const gridLinesStyle = useMemo(() => {
killedBy: GridLayout heightMode Should render with no explicit height when heightMode is 'fixed', matching autoSize: false's own prior behavior
statusReason: expected 'auto' to be '' // Object.is equality

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:1589:8
   const containerOverflow = resolvedHeightMode === `scroll` || resolvedHeightMode === `fit` ? `auto` : undefined;
 
   const gridLinesStyle = useMemo(() => {
-    if(!showGridLines || effectiveContainerWidth < 1) {
+    if(showGridLines || effectiveContainerWidth < 1) {
       return {};
     }
killedBy: GridLayout showGridLines Should apply the grid-lines class and size CSS custom properties from the actual colNum/rowHeight/margin when true
statusReason: expected '' to be '297.5px' // Object.is equality

[Killed] ArrayDeclaration
src/components/Grid/GridLayout.tsx:1614:22
     '--kdl-transition-timing': transitionTimingFunction,
   } as Record<string, string>), [transitionDurationMs, transitionTimingFunction]);
 
-  const classNames = [
-    `kdl-grid-layout`,
-    showGridLines && `kdl-grid-layout--grid-lines`,
-    isAnyItemDragging && `kdl-grid-layout--active-drag`,
-    className,
-  ].filter(Boolean).join(` `);
+  const classNames = [].filter(Boolean).join(` `);
 
   // When any item's own minW/maxW pushed `effectiveContainerWidth` away
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: Cannot set properties of undefined (setting 'getBoundingClientRect')

[Killed] StringLiteral
src/components/Grid/GridLayout.tsx:1615:5
   } as Record<string, string>), [transitionDurationMs, transitionTimingFunction]);
 
   const classNames = [
-    `kdl-grid-layout`,
+    ``,
     showGridLines && `kdl-grid-layout--grid-lines`,
     isAnyItemDragging && `kdl-grid-layout--active-drag`,
killedBy: GridLayout Should compute a pixel container height from the layout when autoSize is true (the default)
statusReason: Cannot read properties of null (reading 'style')

[Timeout] ConditionalExpression
src/components/Grid/GridLayout.tsx:1633:29
   // space (never for the narrower/maxW-driven case, which has nothing
   // to scroll to) turns that mismatch into a real horizontal scrollbar
   // instead of clipped or visually broken content.
-  const needsWidthWrapper = effectiveContainerWidth !== containerWidth;
+  const needsWidthWrapper = true;
   const needsHorizontalScroll = effectiveContainerWidth > containerWidth;
 

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1651:8
           {indicator.label}
         </div>
       ))}
-      {outsideDropPlaceholderStyle && !renderPlaceholder && (
+      {true && (
         <div className="kdl-grid-outside-drop-placeholder" style={outsideDropPlaceholderStyle} />
       )}
killedBy: GridLayout allowOutsideDrop Should not show a placeholder or call onOutsideDrop when allowOutsideDrop is off (the default)
statusReason: expected <div …(1)></div> to be falsy

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:1651:39
           {indicator.label}
         </div>
       ))}
-      {outsideDropPlaceholderStyle && !renderPlaceholder && (
+      {outsideDropPlaceholderStyle && renderPlaceholder && (
         <div className="kdl-grid-outside-drop-placeholder" style={outsideDropPlaceholderStyle} />
       )}
killedBy: GridLayout allowOutsideDrop Should show a live placeholder on dragover
statusReason: expected null to be truthy

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:1654:39
       {outsideDropPlaceholderStyle && !renderPlaceholder && (
         <div className="kdl-grid-outside-drop-placeholder" style={outsideDropPlaceholderStyle} />
       )}
-      {itemGesturePlaceholderStyle && !renderPlaceholder && (
+      {itemGesturePlaceholderStyle && renderPlaceholder && (
         <div className="kdl-grid-placeholder" style={itemGesturePlaceholderStyle} />
       )}
killedBy: GridLayout renderPlaceholder — regular in-grid drag/resize Should render the fallback .kdl-grid-placeholder box during a regular in-grid drag, when no renderPlaceholder is provided
statusReason: expected null to be truthy

[Timeout] LogicalOperator
src/components/Grid/GridLayout.tsx:1654:8
       {outsideDropPlaceholderStyle && !renderPlaceholder && (
         <div className="kdl-grid-outside-drop-placeholder" style={outsideDropPlaceholderStyle} />
       )}
-      {itemGesturePlaceholderStyle && !renderPlaceholder && (
+      {itemGesturePlaceholderStyle || !renderPlaceholder && (
         <div className="kdl-grid-placeholder" style={itemGesturePlaceholderStyle} />
       )}

[Killed] LogicalOperator
src/components/Grid/GridLayout.tsx:1657:8
       {itemGesturePlaceholderStyle && !renderPlaceholder && (
         <div className="kdl-grid-placeholder" style={itemGesturePlaceholderStyle} />
       )}
-      {renderPlaceholder && activePlaceholderStyle && (
-        <div style={activePlaceholderStyle}>
-          {renderPlaceholder(activePlaceholder, activePlaceholder !== null)}
-        </div>
-      )}
+      {renderPlaceholder && activePlaceholderStyle || <div style={activePlaceholderStyle}>
+          {renderPlaceholder(activePlaceholder, activePlaceholder !== null)}
+        </div>}
     </>
   );
killedBy: GridLayout allowOutsideDrop Should not show a placeholder or call onOutsideDrop when allowOutsideDrop is off (the default)
statusReason: renderPlaceholder is not a function

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1657:8
       {itemGesturePlaceholderStyle && !renderPlaceholder && (
         <div className="kdl-grid-placeholder" style={itemGesturePlaceholderStyle} />
       )}
-      {renderPlaceholder && activePlaceholderStyle && (
+      {true && (
         <div style={activePlaceholderStyle}>
           {renderPlaceholder(activePlaceholder, activePlaceholder !== null)}
killedBy: GridLayout allowOutsideDrop Should not show a placeholder or call onOutsideDrop when allowOutsideDrop is off (the default)
statusReason: renderPlaceholder is not a function

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1659:49
       )}
       {renderPlaceholder && activePlaceholderStyle && (
         <div style={activePlaceholderStyle}>
-          {renderPlaceholder(activePlaceholder, activePlaceholder !== null)}
+          {renderPlaceholder(activePlaceholder, activePlaceholder === null)}
         </div>
       )}
killedBy: GridLayout renderPlaceholder — regular in-grid drag/resize Should call renderPlaceholder with the live placeholder and isDragging:true during a regular in-grid drag, instead of the fallback box
statusReason: expected 'false' to be 'true' // Object.is equality
