[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1659:49
       )}
       {renderPlaceholder && activePlaceholderStyle && (
         <div style={activePlaceholderStyle}>
-          {renderPlaceholder(activePlaceholder, activePlaceholder !== null)}
+          {renderPlaceholder(activePlaceholder, false)}
         </div>
       )}
killedBy: GridLayout renderPlaceholder — regular in-grid drag/resize Should call renderPlaceholder with the live placeholder and isDragging:true during a regular in-grid drag, instead of the fallback box
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] ObjectLiteral
src/components/Grid/GridLayout.tsx:1674:14
       onDragLeave={handleOutsideDragLeave}
       onDragOver={handleOutsideDragOver}
       onDrop={handleOutsideDrop}
-      style={{ height: containerHeight, overflowX: needsHorizontalScroll ? `auto` : undefined, overflowY: containerOverflow, position: `relative`, ...gridLinesStyle, ...transitionStyle }}
+      style={{}}
     >
       {needsWidthWrapper ? (
killedBy: GridLayout Should compute a pixel container height from the layout when autoSize is true (the default)
statusReason: expected '' to be '230px' // Object.is equality

[Timeout] StringLiteral
src/components/Grid/GridLayout.tsx:1674:136
       onDragLeave={handleOutsideDragLeave}
       onDragOver={handleOutsideDragOver}
       onDrop={handleOutsideDrop}
-      style={{ height: containerHeight, overflowX: needsHorizontalScroll ? `auto` : undefined, overflowY: containerOverflow, position: `relative`, ...gridLinesStyle, ...transitionStyle }}
+      style={{ height: containerHeight, overflowX: needsHorizontalScroll ? `auto` : undefined, overflowY: containerOverflow, position: ``, ...gridLinesStyle, ...transitionStyle }}
     >
       {needsWidthWrapper ? (
