[Timeout] BooleanLiteral
components/Grid/hooks/useGridItemResize.ts:116:80
   const [resizing, setResizing] = useState<IGridItemPosition | undefined>(undefined);
 
   const resizingRef = useRef<IGridItemPosition | undefined>(undefined);
-  const edgesRef = useRef<IInteractEdges>({ bottom: false, left: false, right: false, top: false });
+  const edgesRef = useRef<IInteractEdges>({ bottom: false, left: false, right: true, top: false });
   const aspectRatioRef = useRef<number | undefined>(undefined);
   const lastW = useRef(NaN);

[Timeout] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:127:6
   // Same "lazy ref init" rationale as `useGridItemDrag.ts`'s own copy of
   // this pattern.
   const autoScrollRef = useRef<ReturnType<typeof createNativeAutoScroll> | null>(null);
-  if(!autoScrollRef.current) {
+  if(true) {
     autoScrollRef.current = createNativeAutoScroll();
   }

[Timeout] ArrayDeclaration
components/Grid/hooks/useGridItemResize.ts:153:7
     sw: swRef,
     w: wRef,
     // eslint-disable-next-line react-hooks/exhaustive-deps
-  }), []);
+  }), ["Stryker was here"]);
 
   const calcPosition = useCallback((x: number, y: number, w: number, h: number): IGridItemPosition => {

[Killed] EqualityOperator
components/Grid/hooks/useGridItemResize.ts:159:20
     const { containerWidth, margin, cols, rowHeight, isMirrored } = optionsRef.current;
     const colWidth = calcColWidth(containerWidth, margin[0], cols);
-    const height = h === Infinity ? h : Math.round(rowHeight * h + Math.max(0, h - 1) * margin[1]);
+    const height = h !== Infinity ? h : Math.round(rowHeight * h + Math.max(0, h - 1) * margin[1]);
     /* v8 ignore next -- same Infinity/cloneLayout limitation as `height` above — not adjacent to it, so needs its own ignore comment rather than one "next N" covering both. */
     const width = w === Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
killedBy: GridItem resizing Should move the item's own y when resizing from the top edge
statusReason: expected 1 to be greater than 4

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:161:19
     const height = h === Infinity ? h : Math.round(rowHeight * h + Math.max(0, h - 1) * margin[1]);
     /* v8 ignore next -- same Infinity/cloneLayout limitation as `height` above — not adjacent to it, so needs its own ignore comment rather than one "next N" covering both. */
-    const width = w === Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
+    const width = true ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
     const top = Math.round(rowHeight * y + (y + 1) * margin[1]);
     const horizontal = Math.round(colWidth * x + (x + 1) * margin[0]);
killedBy: GridItem resize minW/maxW/minH/maxH clamping (real gesture, not autoSize) Should leave w/h unclamped when they resolve within minW/maxW/minH/maxH — sanity check the clamps don't fire unnecessarily
statusReason: expected 1 to be 3 // Object.is equality

[Timeout] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:162:28
     const height = h === Infinity ? h : Math.round(rowHeight * h + Math.max(0, h - 1) * margin[1]);
     /* v8 ignore next -- same Infinity/cloneLayout limitation as `height` above — not adjacent to it, so needs its own ignore comment rather than one "next N" covering both. */
     const width = w === Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
-    const top = Math.round(rowHeight * y + (y + 1) * margin[1]);
+    const top = Math.round(rowHeight * y - (y + 1) * margin[1]);
     const horizontal = Math.round(colWidth * x + (x + 1) * margin[0]);
     return isMirrored

[Timeout] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:181:21
     // is unaffected either way (this prop is about height specifically).
     const h = autoSizeFlag
       ? Math.ceil((height + margin[1]) / (rowHeight + margin[1]))
-      : Math.round((height + margin[1]) / (rowHeight + margin[1]));
+      : Math.round((height - margin[1]) / (rowHeight + margin[1]));
     w = Math.max(Math.min(w, cols - innerX), 0);
     const clampedH = Math.max(Math.min(h, maxRows - innerY), 0);

[Killed] ObjectLiteral
components/Grid/hooks/useGridItemResize.ts:184:12
       : Math.round((height + margin[1]) / (rowHeight + margin[1]));
     w = Math.max(Math.min(w, cols - innerX), 0);
     const clampedH = Math.max(Math.min(h, maxRows - innerY), 0);
-    return { h: clampedH, w };
+    return {};
   }, []);
 
killedBy: GridLayout preserveAspectRatio Should derive height from width when only a horizontal edge drives the resize
statusReason: actual value must be number or bigint, received "undefined"

[Timeout] ArrayDeclaration
components/Grid/hooks/useGridItemResize.ts:185:6
     w = Math.max(Math.min(w, cols - innerX), 0);
     const clampedH = Math.max(Math.min(h, maxRows - innerY), 0);
     return { h: clampedH, w };
-  }, []);
+  }, ["Stryker was here"]);
 
   const pixelsToGridX = useCallback((leftPx: number, newW: number): number => {

[Survived] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:190:29
   const pixelsToGridX = useCallback((leftPx: number, newW: number): number => {
     const { containerWidth, margin, cols } = optionsRef.current;
     const colWidth = calcColWidth(containerWidth, margin[0], cols);
-    let gridX = Math.round((leftPx - margin[0]) / (colWidth + margin[0]));
+    let gridX = Math.round((leftPx + margin[0]) / (colWidth + margin[0]));
     gridX = Math.max(Math.min(gridX, cols - newW), 0);
     return gridX;

[Survived] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:197:51
 
   const pixelsToGridY = useCallback((topPx: number, newH: number): number => {
     const { margin, rowHeight, maxRows } = optionsRef.current;
-    let gridY = Math.round((topPx - margin[1]) / (rowHeight + margin[1]));
+    let gridY = Math.round((topPx - margin[1]) / (rowHeight - margin[1]));
     gridY = Math.max(Math.min(gridY, maxRows - newH), 0);
     return gridY;

[Survived] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:198:38
   const pixelsToGridY = useCallback((topPx: number, newH: number): number => {
     const { margin, rowHeight, maxRows } = optionsRef.current;
     let gridY = Math.round((topPx - margin[1]) / (rowHeight + margin[1]));
-    gridY = Math.max(Math.min(gridY, maxRows - newH), 0);
+    gridY = Math.max(Math.min(gridY, maxRows + newH), 0);
     return gridY;
   }, []);

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:225:8
     const measured = calcWH(rect.height, rect.width, true);
     let newW = measured.w;
     let newH = measured.h;
-    if(newW < minW) {
+    if(true) {
       newW = minW;
     }
killedBy: GridItem autoHeight Should commit a resizeend-style height change when the wrapper's content grows, rounding height *up* (not to the nearest unit)
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:228:8
     if(newW < minW) {
       newW = minW;
     }
-    if(newW > maxW) {
+    if(true) {
       newW = maxW;
     }
killedBy: GridItem autoHeight Should commit a resizeend-style height change when the wrapper's content grows, rounding height *up* (not to the nearest unit)
statusReason: expected Infinity to be 2 // Object.is equality

[Killed] BlockStatement
components/Grid/hooks/useGridItemResize.ts:228:21
     if(newW < minW) {
       newW = minW;
     }
-    if(newW > maxW) {
-      newW = maxW;
-    }
+    if(newW > maxW) {}
     if(newH < minH) {
       newH = minH;
killedBy: GridItem autoHeight Should clamp down to maxW when the measured width converts to more than it
statusReason: expected 10 to be 3 // Object.is equality

[Killed] BlockStatement
components/Grid/hooks/useGridItemResize.ts:231:21
     if(newW > maxW) {
       newW = maxW;
     }
-    if(newH < minH) {
-      newH = minH;
-    }
+    if(newH < minH) {}
     if(newH > maxH) {
       newH = maxH;
killedBy: GridItem autoHeight Should clamp up to minH when the measured height converts to less than it
statusReason: expected 1 to be 5 // Object.is equality

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:234:8
     if(newH < minH) {
       newH = minH;
     }
-    if(newH > maxH) {
+    if(true) {
       newH = maxH;
     }
killedBy: GridItem autoHeight Should commit a resizeend-style height change when the wrapper's content grows, rounding height *up* (not to the nearest unit)
statusReason: expected Infinity to be 3 // Object.is equality

[Killed] BlockStatement
components/Grid/hooks/useGridItemResize.ts:234:21
     if(newH < minH) {
       newH = minH;
     }
-    if(newH > maxH) {
-      newH = maxH;
-    }
+    if(newH > maxH) {}
     if(newH < 1) {
       newH = 1;
killedBy: GridItem autoHeight Should clamp the auto-measured height/width to minH/maxH/minW/maxW
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:240:8
     if(newH < 1) {
       newH = 1;
     }
-    if(newW < 1) {
+    if(false) {
       newW = 1;
     }
killedBy: GridItem autoHeight Should floor width to 1 when minW is explicitly set below 1 and the measurement would otherwise be non-positive
statusReason: expected +0 to be 1 // Object.is equality

[Timeout] ObjectLiteral
components/Grid/hooks/useGridItemResize.ts:260:31
     switch(event.type) {
       case `resizestart`: {
         pos = calcPosition(innerX, innerY, w, h);
-        resizingRef.current = { ...pos };
+        resizingRef.current = {};
         setResizing(resizingRef.current);
         setIsResizing(true);

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:264:34
         setResizing(resizingRef.current);
         setIsResizing(true);
         edgesRef.current = event.edges;
-        aspectRatioRef.current = pos.height > 0 ? pos.width / pos.height : undefined;
+        aspectRatioRef.current = false ? pos.width / pos.height : undefined;
         lastW.current = x;
         lastH.current = y;
killedBy: GridLayout preserveAspectRatio Should derive height from width when only a horizontal edge drives the resize
statusReason: expected 2 to be greater than 2

[Killed] BlockStatement
components/Grid/hooks/useGridItemResize.ts:301:27
         }
         if(edges.left) {
           newSize.width = prevWidth - dx;
-          if(!isMirrored) {
-            newSize.horizontal = prevHorizontal + dx;
-          }
+          if(!isMirrored) {}
         }
         if(edges.bottom) {
killedBy: GridItem resizing Should move the item's own x when resizing from the left edge
statusReason: expected 4 to be less than 4

[Killed] LogicalOperator
components/Grid/hooks/useGridItemResize.ts:317:12
         // directly driven by the edge(s) in this gesture from the one
         // that is, using the ratio captured at resizestart. Ported
         // line-for-line from Vue's own `handleResize`.
-        if(preserveAspectRatio && aspectRatioRef.current) {
+        if(preserveAspectRatio || aspectRatioRef.current) {
           const drivingWidth = edges.left || edges.right;
           const drivingHeight = edges.top || edges.bottom;
killedBy: GridItem resizing Should clamp the resized height to maxH
statusReason: expected 2 to be 3 // Object.is equality

[Killed] LogicalOperator
components/Grid/hooks/useGridItemResize.ts:318:32
         // that is, using the ratio captured at resizestart. Ported
         // line-for-line from Vue's own `handleResize`.
         if(preserveAspectRatio && aspectRatioRef.current) {
-          const drivingWidth = edges.left || edges.right;
+          const drivingWidth = edges.left && edges.right;
           const drivingHeight = edges.top || edges.bottom;
           if(drivingWidth && !drivingHeight) {
killedBy: GridLayout preserveAspectRatio Should derive height from width when only a horizontal edge drives the resize
statusReason: expected 2 to be greater than 2

[Killed] BooleanLiteral
components/Grid/hooks/useGridItemResize.ts:320:30
         if(preserveAspectRatio && aspectRatioRef.current) {
           const drivingWidth = edges.left || edges.right;
           const drivingHeight = edges.top || edges.bottom;
-          if(drivingWidth && !drivingHeight) {
+          if(drivingWidth && drivingHeight) {
             newSize.height = newSize.width / aspectRatioRef.current;
           } else if(drivingHeight && !drivingWidth) {
killedBy: GridLayout preserveAspectRatio Should derive height from width when only a horizontal edge drives the resize
statusReason: expected 2 to be greater than 2

[Killed] BlockStatement
components/Grid/hooks/useGridItemResize.ts:320:46
         if(preserveAspectRatio && aspectRatioRef.current) {
           const drivingWidth = edges.left || edges.right;
           const drivingHeight = edges.top || edges.bottom;
-          if(drivingWidth && !drivingHeight) {
-            newSize.height = newSize.width / aspectRatioRef.current;
-          } else if(drivingHeight && !drivingWidth) {
+          if(drivingWidth && !drivingHeight) {} else if(drivingHeight && !drivingWidth) {
             newSize.width = newSize.height * aspectRatioRef.current;
           } else if(drivingWidth && drivingHeight) {
killedBy: GridLayout preserveAspectRatio Should derive height from width when only a horizontal edge drives the resize
statusReason: expected 2 to be greater than 2

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:322:21
           const drivingHeight = edges.top || edges.bottom;
           if(drivingWidth && !drivingHeight) {
             newSize.height = newSize.width / aspectRatioRef.current;
-          } else if(drivingHeight && !drivingWidth) {
+          } else if(true) {
             newSize.width = newSize.height * aspectRatioRef.current;
           } else if(drivingWidth && drivingHeight) {
killedBy: GridLayout preserveAspectRatio Should derive height from width (not the other way around) when a corner drives both axes at once, adjusting the anchor's own top when the top edge is included
statusReason: expected 2 to be greater than 2

[Survived] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:324:21
             newSize.height = newSize.width / aspectRatioRef.current;
           } else if(drivingHeight && !drivingWidth) {
             newSize.width = newSize.height * aspectRatioRef.current;
-          } else if(drivingWidth && drivingHeight) {
+          } else if(true) {
             const derivedHeight = newSize.width / aspectRatioRef.current;
             if(edges.top) {

[Killed] EqualityOperator
components/Grid/hooks/useGridItemResize.ts:365:8
     }
 
     pos = calcWH(newSize.height, newSize.width);
-    if(pos.w < minW) {
+    if(pos.w >= minW) {
       pos.w = minW;
     }
killedBy: GridLayout preserveAspectRatio Should derive height from width when only a horizontal edge drives the resize
statusReason: expected 1 to be greater than 2

[Killed] BlockStatement
components/Grid/hooks/useGridItemResize.ts:368:22
     if(pos.w < minW) {
       pos.w = minW;
     }
-    if(pos.w > maxW) {
-      pos.w = maxW;
-    }
+    if(pos.w > maxW) {}
     if(pos.h < minH) {
       pos.h = minH;
killedBy: GridItem resizing Should clamp the resized width to maxW
statusReason: expected 12 to be 3 // Object.is equality

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:368:8
     if(pos.w < minW) {
       pos.w = minW;
     }
-    if(pos.w > maxW) {
+    if(false) {
       pos.w = maxW;
     }
killedBy: GridItem resizing Should clamp the resized width to maxW
statusReason: expected 12 to be 3 // Object.is equality

[Killed] BlockStatement
components/Grid/hooks/useGridItemResize.ts:374:22
     if(pos.h < minH) {
       pos.h = minH;
     }
-    if(pos.h > maxH) {
-      pos.h = maxH;
-    }
+    if(pos.h > maxH) {}
     if(pos.h < 1) {
       pos.h = 1;
killedBy: GridItem resizing Should clamp the resized height to maxH
statusReason: expected 47 to be 3 // Object.is equality

[Killed] BlockStatement
components/Grid/hooks/useGridItemResize.ts:380:19
     if(pos.h < 1) {
       pos.h = 1;
     }
-    if(pos.w < 1) {
-      pos.w = 1;
-    }
+    if(pos.w < 1) {}
 
     let newX = innerX;
killedBy: GridItem resize minW/maxW/minH/maxH clamping (real gesture, not autoSize) Should floor width to 1 (not minW) when minW itself is 0 and the resize would otherwise compute non-positive
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:388:8
     let newY = innerY;
     const edges = edgesRef.current;
     const horizontalAnchorEdge = isMirrored ? edges.right : edges.left;
-    if(horizontalAnchorEdge && newSize.horizontal !== undefined) {
+    if(false) {
       newX = pixelsToGridX(newSize.horizontal, pos.w);
     }
killedBy: GridLayout isMirrored (RTL) Should move the anchor under RTL when resizing from the "right" edge specifically
statusReason: expected 4 not to be 4 // Object.is equality

[Killed] EqualityOperator
components/Grid/hooks/useGridItemResize.ts:391:21
     if(horizontalAnchorEdge && newSize.horizontal !== undefined) {
       newX = pixelsToGridX(newSize.horizontal, pos.w);
     }
-    if(edges.top && newSize.top !== undefined) {
+    if(edges.top && newSize.top === undefined) {
       newY = pixelsToGridY(newSize.top, pos.h);
     }
killedBy: GridLayout preserveAspectRatio Should derive height from width (not the other way around) when a corner drives both axes at once, adjusting the anchor's own top when the top edge is included
statusReason: expected 4 to be less than 4

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:398:8
     lastW.current = x;
     lastH.current = y;
 
-    if(event.type === `resizeend`) {
+    if(false) {
       onItemResized?.({ h: pos.h, height: newSize.height, i, w: pos.w, width: newSize.width });
     }
killedBy: GridItem onItemResized Should call onItemResized with this item's own final grid-unit h/w and pixel height/width on resizeend, and not before
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] OptionalChaining
components/Grid/hooks/useGridItemResize.ts:399:7
     lastH.current = y;
 
     if(event.type === `resizeend`) {
-      onItemResized?.({ h: pos.h, height: newSize.height, i, w: pos.w, width: newSize.width });
+      onItemResized({
+  h: pos.h,
+  height: newSize.height,
+  i,
+  w: pos.w,
+  width: newSize.width
+});
     }
 
killedBy: GridItem onItemResized Should not throw, and should not call onItemResized, when GridItem doesn't provide it at all
statusReason: expected [Function] to not throw an error but 'TypeError: onItemResized is not a fun…' was thrown

[Timeout] ArrayDeclaration
components/Grid/hooks/useGridItemResize.ts:403:6
     }
 
     onResize(i, event.type, newX, newY, pos.w, pos.h);
-  }, [calcPosition, calcWH, pixelsToGridX, pixelsToGridY]);
+  }, []);
 
   useEffect(() => {

[Killed] ObjectLiteral
components/Grid/hooks/useGridItemResize.ts:426:14
     const native = createNativeResizable(
       root,
       handleEls,
-      () => ({ enabled: optionsRef.current.enabled, ignoreFrom: optionsRef.current.ignoreFrom }),
+      () => ({}),
       handleResize,
     );
killedBy: GridItem resizing Should resize via a real pointerdown/move/up sequence on an actual resize handle (exercising the native engine's own getOptions callback, not just the backdoor)
statusReason: expected "vi.fn()" to be called at least once
