[Killed] StringLiteral
src/components/Grid/GridLayout.tsx:36:82
 const DEFAULT_MARGIN: [number, number] = [10, 10];
 
 /** Same reference-stability rationale as `DEFAULT_MARGIN` above. */
-const DEFAULT_RESIZE_HANDLES: TResizeHandle[] = [`n`, `s`, `e`, `w`, `ne`, `nw`, `se`, `sw`];
+const DEFAULT_RESIZE_HANDLES: TResizeHandle[] = [`n`, `s`, `e`, `w`, `ne`, `nw`, ``, `sw`];
 
 /** `showResizeHandles`'s own default color — matches Vue's own default exactly (a semi-transparent gray). */
killedBy: GridItem resizing Should resize via a real pointerdown/move/up sequence on an actual resize handle (exercising the native engine's own getOptions callback, not just the backdoor)
statusReason: Cannot read properties of null (reading 'dispatchEvent')

[Survived] StringLiteral
src/components/Grid/GridLayout.tsx:36:76
 const DEFAULT_MARGIN: [number, number] = [10, 10];
 
 /** Same reference-stability rationale as `DEFAULT_MARGIN` above. */
-const DEFAULT_RESIZE_HANDLES: TResizeHandle[] = [`n`, `s`, `e`, `w`, `ne`, `nw`, `se`, `sw`];
+const DEFAULT_RESIZE_HANDLES: TResizeHandle[] = [`n`, `s`, `e`, `w`, `ne`, ``, `se`, `sw`];
 
 /** `showResizeHandles`'s own default color — matches Vue's own default exactly (a semi-transparent gray). */

[Killed] StringLiteral
src/components/Grid/GridLayout.tsx:39:37
 const DEFAULT_RESIZE_HANDLES: TResizeHandle[] = [`n`, `s`, `e`, `w`, `ne`, `nw`, `se`, `sw`];
 
 /** `showResizeHandles`'s own default color — matches Vue's own default exactly (a semi-transparent gray). */
-const DEFAULT_RESIZE_HANDLE_COLOR = `rgb(94 94 94 / 45%)`;
+const DEFAULT_RESIZE_HANDLE_COLOR = ``;
 
killedBy: GridLayout/GridItem showResizeHandles/resizeHandleColor Should render the visible-handle class and default color when turned on grid-wide
statusReason: expected '' to be 'rgb(94 94 94 / 45%)' // Object.is equality

[Killed] ObjectLiteral
src/components/Grid/GridLayout.tsx:42:43
 const DEFAULT_RESIZE_HANDLE_COLOR = `rgb(94 94 94 / 45%)`;
 
-const DEFAULT_BREAKPOINTS: IBreakpoints = { lg: 1200, md: 996, sm: 768, xl: 1400, xs: 480, xxl: 1600, xxs: 0 };
+const DEFAULT_BREAKPOINTS: IBreakpoints = {};
 
 /** `responsive`'s own default column counts per breakpoint — matches `IColumns`'s own documented defaults exactly. Same reference-stability rationale as `DEFAULT_MARGIN` above. */
killedBy: GridLayout responsive Should resolve the active breakpoint from the measured container width and call onBreakpointChange
statusReason: Invalid parameter breakpoint

[Killed] ObjectLiteral
src/components/Grid/GridLayout.tsx:45:32
 const DEFAULT_BREAKPOINTS: IBreakpoints = { lg: 1200, md: 996, sm: 768, xl: 1400, xs: 480, xxl: 1600, xxs: 0 };
 
 /** `responsive`'s own default column counts per breakpoint — matches `IColumns`'s own documented defaults exactly. Same reference-stability rationale as `DEFAULT_MARGIN` above. */
-const DEFAULT_COLS: IColumns = { lg: 12, md: 10, sm: 6, xl: 12, xs: 4, xxl: 12, xxs: 2 };
+const DEFAULT_COLS: IColumns = {};
 
 /** Same reference-stability rationale as `DEFAULT_MARGIN` above. */
killedBy: GridLayout responsive Should resolve the active breakpoint from the measured container width and call onBreakpointChange
statusReason: Breakpoint not found

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:106:17
   rowHeight = 150,
   margin = DEFAULT_MARGIN,
   maxRows = Infinity,
-  isDraggable = true,
+  isDraggable = false,
   isResizable = true,
   isBounded = false,
killedBy: GridItem keyboard accessibility Should move the item by one grid unit on ArrowRight
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:107:17
   margin = DEFAULT_MARGIN,
   maxRows = Infinity,
   isDraggable = true,
-  isResizable = true,
+  isResizable = false,
   isBounded = false,
   preventCollision = false,
killedBy: GridItem Should render all 8 resize-hint spans when resizable
statusReason: expected  to have a length of 8 but got +0

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:108:15
   maxRows = Infinity,
   isDraggable = true,
   isResizable = true,
-  isBounded = false,
+  isBounded = true,
   preventCollision = false,
   enableEditMode = true,
killedBy: GridLayout Should never mutate the layout array/items passed in as props
statusReason: Invalid colOrRowSize parameter passed

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:109:22
   isDraggable = true,
   isResizable = true,
   isBounded = false,
-  preventCollision = false,
+  preventCollision = true,
   enableEditMode = true,
   autoSize = true,
killedBy: GridItem resizing Should call onLayoutChange with the grown size on resizeend
statusReason: expected 2 to be greater than 2

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:110:20
   isResizable = true,
   isBounded = false,
   preventCollision = false,
-  enableEditMode = true,
+  enableEditMode = false,
   autoSize = true,
   heightMode = null,
killedBy: GridItem keyboard accessibility Should move the item by one grid unit on ArrowRight
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:111:14
   isBounded = false,
   preventCollision = false,
   enableEditMode = true,
-  autoSize = true,
+  autoSize = false,
   heightMode = null,
   useCssTransforms = true,
killedBy: GridLayout Should compute a pixel container height from the layout when autoSize is true (the default)
statusReason: expected '' to be '230px' // Object.is equality

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:113:22
   enableEditMode = true,
   autoSize = true,
   heightMode = null,
-  useCssTransforms = true,
+  useCssTransforms = false,
   transformScale = 1,
   transitionDurationMs = 200,
killedBy: GridLayout isMirrored (RTL) Should position via CSS right (not left) when isMirrored is on
statusReason: expected '' to contain 'translate3d'

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:118:19
   transitionDurationMs = 200,
   transitionTimingFunction = `ease`,
   compactType = ECompactType.VERTICAL,
-  restoreOnDrag = false,
+  restoreOnDrag = true,
   distributeEvenly = false,
   horizontalShift = false,
killedBy: GridItem keyboard accessibility Should move by one grid unit on ArrowLeft/Up/Down too
statusReason: expected 5 to be 4 // Object.is equality

[Timeout] BooleanLiteral
src/components/Grid/GridLayout.tsx:119:22
   transitionTimingFunction = `ease`,
   compactType = ECompactType.VERTICAL,
   restoreOnDrag = false,
-  distributeEvenly = false,
+  distributeEvenly = true,
   horizontalShift = false,
   compactor = null,

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:120:21
   compactType = ECompactType.VERTICAL,
   restoreOnDrag = false,
   distributeEvenly = false,
-  horizontalShift = false,
+  horizontalShift = true,
   compactor = null,
   resizeHandles = DEFAULT_RESIZE_HANDLES,
killedBy: GridLayout horizontalShift Should push the collided-with item straight down by default (horizontalShift off)
statusReason: expected +0 to be 2 // Object.is equality

[Timeout] BooleanLiteral
src/components/Grid/GridLayout.tsx:123:23
   horizontalShift = false,
   compactor = null,
   resizeHandles = DEFAULT_RESIZE_HANDLES,
-  showResizeHandles = false,
+  showResizeHandles = true,
   resizeHandleColor = DEFAULT_RESIZE_HANDLE_COLOR,
   showGridLines = false,

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:125:19
   resizeHandles = DEFAULT_RESIZE_HANDLES,
   showResizeHandles = false,
   resizeHandleColor = DEFAULT_RESIZE_HANDLE_COLOR,
-  showGridLines = false,
+  showGridLines = true,
   showCloseButton = false,
   snapToGrid = false,
killedBy: GridLayout showGridLines Should not apply the grid-lines class by default
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:126:21
   showResizeHandles = false,
   resizeHandleColor = DEFAULT_RESIZE_HANDLE_COLOR,
   showGridLines = false,
-  showCloseButton = false,
+  showCloseButton = true,
   snapToGrid = false,
   snapThreshold = 1,
killedBy: GridItem showCloseButton Should not render a close button by default
statusReason: expected <button aria-label="Close" …(2)></button> to be falsy

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:127:16
   resizeHandleColor = DEFAULT_RESIZE_HANDLE_COLOR,
   showGridLines = false,
   showCloseButton = false,
-  snapToGrid = false,
+  snapToGrid = true,
   snapThreshold = 1,
   showAlignmentGuides = false,
killedBy: GridLayout snapToGrid Should not snap at all when snapToGrid is off (the default) — the raw grid position is used unchanged
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:129:25
   showCloseButton = false,
   snapToGrid = false,
   snapThreshold = 1,
-  showAlignmentGuides = false,
+  showAlignmentGuides = true,
   showSpacingGuides = false,
   multiSelect = false,
killedBy: GridLayout showAlignmentGuides Should not render any guide lines by default
statusReason: expected <div …(2)></div>
<div …(2)></div>
…(1) to have a length of +0 but got 3

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:130:23
   snapToGrid = false,
   snapThreshold = 1,
   showAlignmentGuides = false,
-  showSpacingGuides = false,
+  showSpacingGuides = true,
   multiSelect = false,
   enableUndoRedo = false,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should not render any indicator at all when showSpacingGuides is off (the default), even where one would otherwise fire
statusReason: expected <div …(2)></div> to be falsy

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:131:17
   snapThreshold = 1,
   showAlignmentGuides = false,
   showSpacingGuides = false,
-  multiSelect = false,
+  multiSelect = true,
   enableUndoRedo = false,
   undoHistoryLimit = 50,
killedBy: GridLayout multiSelect Should not react to any clicks at all when multiSelect is off (the default)
statusReason: expected [ '0' ] to strictly equal []

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:132:20
   showAlignmentGuides = false,
   showSpacingGuides = false,
   multiSelect = false,
-  enableUndoRedo = false,
+  enableUndoRedo = true,
   undoHistoryLimit = 50,
   responsive = false,
killedBy: GridLayout undo/redo Should be permanent no-ops when enableUndoRedo is off (the default)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:134:16
   multiSelect = false,
   enableUndoRedo = false,
   undoHistoryLimit = 50,
-  responsive = false,
+  responsive = true,
   breakpoints = DEFAULT_BREAKPOINTS,
   cols = DEFAULT_COLS,
killedBy: GridLayout showGridLines Should apply the grid-lines class and size CSS custom properties from the actual colNum/rowHeight/margin when true
statusReason: expected '119px' to be '297.5px' // Object.is equality

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:138:16
   breakpoints = DEFAULT_BREAKPOINTS,
   cols = DEFAULT_COLS,
   responsiveLayouts = DEFAULT_RESPONSIVE_LAYOUTS,
-  isMirrored = false,
+  isMirrored = true,
   autoScroll = false,
   preserveAspectRatio = false,
killedBy: GridLayout Should push a colliding item out of the way when preventCollision is off (the default)
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:139:16
   cols = DEFAULT_COLS,
   responsiveLayouts = DEFAULT_RESPONSIVE_LAYOUTS,
   isMirrored = false,
-  autoScroll = false,
+  autoScroll = true,
   preserveAspectRatio = false,
   borderRadiusPx = 10,
killedBy: GridLayout autoScroll Should not call start/update at all when autoScroll is off (the default) — stop() itself is still called defensively regardless, matching Vue's own unconditional "safe no-op if n
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      <div

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:140:25
   responsiveLayouts = DEFAULT_RESPONSIVE_LAYOUTS,
   isMirrored = false,
   autoScroll = false,
-  preserveAspectRatio = false,
+  preserveAspectRatio = true,
   borderRadiusPx = 10,
   useBorderRadius = false,
killedBy: GridLayout Should clamp the resized height when preventCollision is on and it would collide vertically
statusReason: expected 2 to be 4 // Object.is equality

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:142:21
   autoScroll = false,
   preserveAspectRatio = false,
   borderRadiusPx = 10,
-  useBorderRadius = false,
+  useBorderRadius = true,
   ariaLabels,
   allowCrossGridDrag = false,
killedBy: GridItem borderRadiusPx/useBorderRadius Should not apply a border radius by default (useBorderRadius off)
statusReason: expected '10px' to be '' // Object.is equality

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:144:24
   borderRadiusPx = 10,
   useBorderRadius = false,
   ariaLabels,
-  allowCrossGridDrag = false,
+  allowCrossGridDrag = true,
   disableExternalDrop = false,
   layoutId: layoutIdProp,
killedBy: GridLayout allowCrossGridDrag Should not attempt any cross-grid lookup at all when allowCrossGridDrag is off (the default)
statusReason: GridItem: no layout entry found for i="0".

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:145:25
   useBorderRadius = false,
   ariaLabels,
   allowCrossGridDrag = false,
-  disableExternalDrop = false,
+  disableExternalDrop = true,
   layoutId: layoutIdProp,
   onCrossGridItemDropped,
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:149:22
   layoutId: layoutIdProp,
   onCrossGridItemDropped,
   onCrossGridDropRejected,
-  allowOutsideDrop = false,
+  allowOutsideDrop = true,
   outsideDropWidth = 2,
   outsideDropHeight = 2,
killedBy: GridLayout allowOutsideDrop Should not show a placeholder or call onOutsideDrop when allowOutsideDrop is off (the default)
statusReason: expected <div …(2)></div> to be falsy

[Killed] LogicalOperator
src/components/Grid/GridLayout.tsx:163:20
   // provided — only meaningfully used at all when `allowCrossGridDrag`
   // is on, but cheap enough to compute regardless.
   const generatedLayoutId = useId();
-  const layoutId = layoutIdProp ?? generatedLayoutId;
+  const layoutId = layoutIdProp && generatedLayoutId;
   const [containerWidth, setContainerWidth] = useState(100);
   /**
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected '_r_0_' to be 'grid-a' // Object.is equality

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:187:60
    * those apart, since a real container could legitimately be under
    * 480px wide too.
    */
-  const [hasMeasuredWidth, setHasMeasuredWidth] = useState(false);
+  const [hasMeasuredWidth, setHasMeasuredWidth] = useState(true);
   const [workingLayout, setWorkingLayout] = useState<TLayout>(() => cloneLayout(layout));
   const [alignmentGuideStyles, setAlignmentGuideStyles] = useState<IAlignmentGuideStyle[]>([]);
killedBy: GridLayout distributeEvenly Should clamp an out-of-bounds item to the right edge on a breakpoint change by default (distributeEvenly off)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:188:63
    * 480px wide too.
    */
   const [hasMeasuredWidth, setHasMeasuredWidth] = useState(false);
-  const [workingLayout, setWorkingLayout] = useState<TLayout>(() => cloneLayout(layout));
+  const [workingLayout, setWorkingLayout] = useState<TLayout>(() => undefined);
   const [alignmentGuideStyles, setAlignmentGuideStyles] = useState<IAlignmentGuideStyle[]>([]);
   const [spacingIndicatorStyles, setSpacingIndicatorStyles] = useState<ISpacingIndicatorStyle[]>([]);
killedBy: GridLayout distributeEvenly Should clamp an out-of-bounds item to the right edge on a breakpoint change by default (distributeEvenly off)
statusReason: Invalid parameter layout passed

[Killed] ArrayDeclaration
src/components/Grid/GridLayout.tsx:189:92
    */
   const [hasMeasuredWidth, setHasMeasuredWidth] = useState(false);
   const [workingLayout, setWorkingLayout] = useState<TLayout>(() => cloneLayout(layout));
-  const [alignmentGuideStyles, setAlignmentGuideStyles] = useState<IAlignmentGuideStyle[]>([]);
+  const [alignmentGuideStyles, setAlignmentGuideStyles] = useState<IAlignmentGuideStyle[]>(["Stryker was here"]);
   const [spacingIndicatorStyles, setSpacingIndicatorStyles] = useState<ISpacingIndicatorStyle[]>([]);
   const [selectedItemIds, setSelectedItemIds] = useState<Set<string | number>>(() => new Set());
killedBy: GridLayout undo/redo Should default canUndo/canRedo to false
statusReason: The `style` prop expects a mapping from style properties to values, not a string. For example, style={{marginRight: spacing + 'em'}} when using JSX.

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:191:80
   const [workingLayout, setWorkingLayout] = useState<TLayout>(() => cloneLayout(layout));
   const [alignmentGuideStyles, setAlignmentGuideStyles] = useState<IAlignmentGuideStyle[]>([]);
   const [spacingIndicatorStyles, setSpacingIndicatorStyles] = useState<ISpacingIndicatorStyle[]>([]);
-  const [selectedItemIds, setSelectedItemIds] = useState<Set<string | number>>(() => new Set());
+  const [selectedItemIds, setSelectedItemIds] = useState<Set<string | number>>(() => undefined);
   const [currentBreakpoint, setCurrentBreakpoint] = useState<TBreakpoint | null>(null);
   /**
killedBy: GridItem ariaLabels Should use the built-in English default for the close button when nothing is overridden
statusReason: Cannot read properties of undefined (reading 'has')

[Timeout] BooleanLiteral
src/components/Grid/GridLayout.tsx:210:62
    * happens to render later in the DOM (confirmed directly via a fresh
    * `elementFromPoint` check, not theorized).
    */
-  const [isAnyItemDragging, setIsAnyItemDragging] = useState(false);
+  const [isAnyItemDragging, setIsAnyItemDragging] = useState(true);
   // Not state: which breakpoint a layout belongs to has no bearing on
   // this component's own visual output beyond `workingLayout`/

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:230:38
    * The per-item layer (merging in `ILayoutItem.ariaLabels`) happens in
    * `GridItem.tsx` itself, one level further down.
    */
-  const resolvedAriaLabels = useMemo(() => resolveAriaLabels(ariaLabels, undefined), [ariaLabels]);
+  const resolvedAriaLabels = useMemo(() => undefined, [ariaLabels]);
   /**
    * `colNum`'s own resolved value — `responsive` on with a breakpoint
killedBy: GridItem ariaLabels Should use a grid-wide ariaLabels override for the close button
statusReason: expected 'Close' to be 'Dismiss widget' // Object.is equality

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:230:86
    * The per-item layer (merging in `ILayoutItem.ariaLabels`) happens in
    * `GridItem.tsx` itself, one level further down.
    */
-  const resolvedAriaLabels = useMemo(() => resolveAriaLabels(ariaLabels, undefined), [ariaLabels]);
+  const resolvedAriaLabels = useMemo(() => resolveAriaLabels(ariaLabels, undefined), []);
   /**
    * `colNum`'s own resolved value — `responsive` on with a breakpoint

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:240:18
    * written before `responsive` existed — keeps working unchanged
    * against the resolved value, without needing to touch each call site.
    */
-  const colNum = responsive && currentBreakpoint ? getColsFromBreakpoint(currentBreakpoint, cols) : colNumProp;
+  const colNum = false ? getColsFromBreakpoint(currentBreakpoint, cols) : colNumProp;
   /**
    * This grid's own actually-used width for every colWidth-derived
killedBy: GridLayout responsive Should drive drag math off the resolved (breakpoint) colNum, not the plain colNum prop, once responsive is on
statusReason: expected 18 to be less than or equal to 8

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:240:18
    * written before `responsive` existed — keeps working unchanged
    * against the resolved value, without needing to touch each call site.
    */
-  const colNum = responsive && currentBreakpoint ? getColsFromBreakpoint(currentBreakpoint, cols) : colNumProp;
+  const colNum = true ? getColsFromBreakpoint(currentBreakpoint, cols) : colNumProp;
   /**
    * This grid's own actually-used width for every colWidth-derived
killedBy: GridItem ariaLabels Should use the built-in English default for the close button when nothing is overridden
statusReason: Invalid parameter breakpoint

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:303:49
    * `maxW` was 3, corrupting the resulting colWidth math for a
    * measurement that had nothing to do with that item's own bound.
    */
-  const effectiveContainerWidth = useMemo(() => {
-    if(!hasMeasuredWidth) {
-      return containerWidth;
-    }
-    let minFloorPx = 0;
-    workingLayout.forEach(item => {
-      if(item.minW !== undefined && item.minW !== null) {
-        minFloorPx = Math.max(minFloorPx, item.minW * rowHeight + Math.max(0, item.minW - 1) * margin[0]);
-      }
-    });
-    return Math.max(containerWidth, minFloorPx);
-  }, [hasMeasuredWidth, workingLayout, containerWidth, rowHeight, margin]);
+  const effectiveContainerWidth = useMemo(() => {}, [hasMeasuredWidth, workingLayout, containerWidth, rowHeight, margin]);
   // Bumped on every undo-history-affecting action (see `commitUndoPoint`/
   // `undo`/`redo` below) purely to force `useImperativeHandle`'s factory
killedBy: GridLayout minW-driven container width expansion Should apply overflowX: auto on the root when an item's own minW pushes effectiveContainerWidth past the real measured width — confirmed gap via a fres
statusReason: expected '' to be 'auto' // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:304:27
    * measurement that had nothing to do with that item's own bound.
    */
   const effectiveContainerWidth = useMemo(() => {
-    if(!hasMeasuredWidth) {
-      return containerWidth;
-    }
+    if(!hasMeasuredWidth) {}
     let minFloorPx = 0;
     workingLayout.forEach(item => {
killedBy: GridItem autoHeight Should clamp up to minW when the measured width converts to less than it
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:304:8
    * measurement that had nothing to do with that item's own bound.
    */
   const effectiveContainerWidth = useMemo(() => {
-    if(!hasMeasuredWidth) {
+    if(true) {
       return containerWidth;
     }
killedBy: GridLayout minW-driven container width expansion Should apply overflowX: auto on the root when an item's own minW pushes effectiveContainerWidth past the real measured width — confirmed gap via a fres
statusReason: expected '' to be 'auto' // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:308:35
       return containerWidth;
     }
     let minFloorPx = 0;
-    workingLayout.forEach(item => {
-      if(item.minW !== undefined && item.minW !== null) {
-        minFloorPx = Math.max(minFloorPx, item.minW * rowHeight + Math.max(0, item.minW - 1) * margin[0]);
-      }
-    });
+    workingLayout.forEach(item => {});
     return Math.max(containerWidth, minFloorPx);
   }, [hasMeasuredWidth, workingLayout, containerWidth, rowHeight, margin]);
killedBy: GridLayout minW-driven container width expansion Should apply overflowX: auto on the root when an item's own minW pushes effectiveContainerWidth past the real measured width — confirmed gap via a fres
statusReason: expected '' to be 'auto' // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:309:10
     }
     let minFloorPx = 0;
     workingLayout.forEach(item => {
-      if(item.minW !== undefined && item.minW !== null) {
+      if(true) {
         minFloorPx = Math.max(minFloorPx, item.minW * rowHeight + Math.max(0, item.minW - 1) * margin[0]);
       }
killedBy: GridLayout multiSelect group move Should move every other selected item by the same delta as the dragged anchor
statusReason: expected NaN to be 2 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:309:10
     }
     let minFloorPx = 0;
     workingLayout.forEach(item => {
-      if(item.minW !== undefined && item.minW !== null) {
+      if(true && item.minW !== null) {
         minFloorPx = Math.max(minFloorPx, item.minW * rowHeight + Math.max(0, item.minW - 1) * margin[0]);
       }
killedBy: GridLayout showGridLines Should apply the grid-lines class and size CSS custom properties from the actual colNum/rowHeight/margin when true
statusReason: expected 'NaNpx' to be '297.5px' // Object.is equality

[Killed] MethodExpression
src/components/Grid/GridLayout.tsx:310:22
     let minFloorPx = 0;
     workingLayout.forEach(item => {
       if(item.minW !== undefined && item.minW !== null) {
-        minFloorPx = Math.max(minFloorPx, item.minW * rowHeight + Math.max(0, item.minW - 1) * margin[0]);
+        minFloorPx = Math.min(minFloorPx, item.minW * rowHeight + Math.max(0, item.minW - 1) * margin[0]);
       }
     });
killedBy: GridLayout minW-driven container width expansion Should apply overflowX: auto on the root when an item's own minW pushes effectiveContainerWidth past the real measured width — confirmed gap via a fres
statusReason: expected '' to be 'auto' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:310:43
     let minFloorPx = 0;
     workingLayout.forEach(item => {
       if(item.minW !== undefined && item.minW !== null) {
-        minFloorPx = Math.max(minFloorPx, item.minW * rowHeight + Math.max(0, item.minW - 1) * margin[0]);
+        minFloorPx = Math.max(minFloorPx, item.minW / rowHeight + Math.max(0, item.minW - 1) * margin[0]);
       }
     });
killedBy: GridLayout minW-driven container width expansion Should apply overflowX: auto on the root when an item's own minW pushes effectiveContainerWidth past the real measured width — confirmed gap via a fres
statusReason: expected '' to be 'auto' // Object.is equality

[Killed] MethodExpression
src/components/Grid/GridLayout.tsx:313:12
         minFloorPx = Math.max(minFloorPx, item.minW * rowHeight + Math.max(0, item.minW - 1) * margin[0]);
       }
     });
-    return Math.max(containerWidth, minFloorPx);
+    return Math.min(containerWidth, minFloorPx);
   }, [hasMeasuredWidth, workingLayout, containerWidth, rowHeight, margin]);
   // Bumped on every undo-history-affecting action (see `commitUndoPoint`/
killedBy: GridLayout minW-driven container width expansion Should apply overflowX: auto on the root when an item's own minW pushes effectiveContainerWidth past the real measured width — confirmed gap via a fres
statusReason: expected '' to be 'auto' // Object.is equality

[Killed] ArrayDeclaration
src/components/Grid/GridLayout.tsx:314:6
       }
     });
     return Math.max(containerWidth, minFloorPx);
-  }, [hasMeasuredWidth, workingLayout, containerWidth, rowHeight, margin]);
+  }, []);
   // Bumped on every undo-history-affecting action (see `commitUndoPoint`/
   // `undo`/`redo` below) purely to force `useImperativeHandle`'s factory
killedBy: GridLayout Should block a move entirely when preventCollision is on and the target position collides
statusReason: expected 10 to be +0 // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:374:66
    * an effect even though the *data* sync no longer does) — the same
    * set of trigger points the Vue package's own version uses.
    */
-  const commitUndoPoint = useCallback((before: TLayout): void => {
-    if(!enableUndoRedo) {
-      return;
-    }
-    historyRef.current.push(cloneLayout(before));
-    if(historyRef.current.length > undoHistoryLimit) {
-      historyRef.current.shift();
-    }
-    futureRef.current = [];
-    setUndoRedoVersion(version => version + 1);
-  }, [enableUndoRedo, undoHistoryLimit]);
+  const commitUndoPoint = useCallback((before: TLayout): void => {}, [enableUndoRedo, undoHistoryLimit]);
 
   // Controlled-component sync: re-mirror the incoming `layout` prop
killedBy: GridLayout undo/redo Should undo a drag back to its pre-drag position
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:375:8
    * set of trigger points the Vue package's own version uses.
    */
   const commitUndoPoint = useCallback((before: TLayout): void => {
-    if(!enableUndoRedo) {
+    if(false) {
       return;
     }
killedBy: GridLayout undo/redo Should be permanent no-ops when enableUndoRedo is off (the default)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:375:25
    * set of trigger points the Vue package's own version uses.
    */
   const commitUndoPoint = useCallback((before: TLayout): void => {
-    if(!enableUndoRedo) {
-      return;
-    }
+    if(!enableUndoRedo) {}
     historyRef.current.push(cloneLayout(before));
     if(historyRef.current.length > undoHistoryLimit) {
killedBy: GridLayout undo/redo Should be permanent no-ops when enableUndoRedo is off (the default)
statusReason: expected true to be false // Object.is equality
