[Killed] LogicalOperator
src/components/Grid/GridLayout.tsx:631:24
   }, [responsive, hasMeasuredWidth, containerWidth, breakpoints, cols, currentBreakpoint, compactType, distributeEvenly, onLayoutChange, onBreakpointChange]);
 
   const commitLayout = useCallback((next: TLayout, minPositions?: Record<string | number, { x?: number; y?: number }>): void => {
-    const compacted = (compactor ?? getCompactor(compactType)).compact(next, colNum, { compactType, minPositions });
+    const compacted = (compactor && getCompactor(compactType)).compact(next, colNum, { compactType, minPositions });
     workingLayoutRef.current = compacted;
     setWorkingLayout(compacted);
killedBy: GridLayout multiSelect group move Should move every other selected item by the same delta as the dragged anchor
statusReason: Cannot read properties of null (reading 'compact')

[Killed] ObjectLiteral
src/components/Grid/GridLayout.tsx:631:86
   }, [responsive, hasMeasuredWidth, containerWidth, breakpoints, cols, currentBreakpoint, compactType, distributeEvenly, onLayoutChange, onBreakpointChange]);
 
   const commitLayout = useCallback((next: TLayout, minPositions?: Record<string | number, { x?: number; y?: number }>): void => {
-    const compacted = (compactor ?? getCompactor(compactType)).compact(next, colNum, { compactType, minPositions });
+    const compacted = (compactor ?? getCompactor(compactType)).compact(next, colNum, {});
     workingLayoutRef.current = compacted;
     setWorkingLayout(compacted);
killedBy: GridLayout restoreOnDrag Should not let another item compact past its own pre-drag position while a drag is in progress
statusReason: expected +0 to be 2 // Object.is equality

[Killed] OptionalChaining
src/components/Grid/GridLayout.tsx:634:5
     const compacted = (compactor ?? getCompactor(compactType)).compact(next, colNum, { compactType, minPositions });
     workingLayoutRef.current = compacted;
     setWorkingLayout(compacted);
-    onLayoutChange?.(compacted);
+    onLayoutChange(compacted);
   }, [compactor, compactType, colNum, onLayoutChange]);
 
killedBy: GridItem dragging Should report a moved position and add the dragging class while a drag is in progress
statusReason: onLayoutChange is not a function

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:647:80
    * whatever `x`/`y` the item had in its *source* grid, which has no
    * necessary relationship to a free spot in this one.
    */
-  const acceptExternalCrossGridItem = useCallback((item: ILayoutItem): void => {
-    const next = cloneLayout(workingLayoutRef.current);
-    const slot = findFirstFitSlot(next, colNum, item.w, item.h);
-    const { moved: _unusedMoved, ...rest } = item;
-    next.push({ ...rest, x: slot.x, y: slot.y });
-    commitLayout(next);
-  }, [colNum, commitLayout]);
+  const acceptExternalCrossGridItem = useCallback((item: ILayoutItem): void => {}, [colNum, commitLayout]);
 
   const crossGridDrag = useCrossGridDrag({
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:674:71
    * behavior — the `compactType === NONE` override below only applies
    * to the *built-in* strategies `compactor` being unset falls back to.
    */
-  const commitForcedCompaction = useCallback((next: TLayout): void => {
-    const forcedType = compactType === ECompactType.NONE ? ECompactType.VERTICAL : compactType;
-    const compacted = (compactor ?? getCompactor(forcedType)).compact(next, colNum, { compactType: forcedType });
-    workingLayoutRef.current = compacted;
-    setWorkingLayout(compacted);
-    onLayoutChange?.(compacted);
-  }, [compactor, compactType, colNum, onLayoutChange]);
+  const commitForcedCompaction = useCallback((next: TLayout): void => {}, [compactor, compactType, colNum, onLayoutChange]);
 
   const compactNow = useCallback((): void => {
killedBy: GridLayout undo/redo Should treat compactNow() as an undo-tracked action
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:675:24
    * to the *built-in* strategies `compactor` being unset falls back to.
    */
   const commitForcedCompaction = useCallback((next: TLayout): void => {
-    const forcedType = compactType === ECompactType.NONE ? ECompactType.VERTICAL : compactType;
+    const forcedType = false ? ECompactType.VERTICAL : compactType;
     const compacted = (compactor ?? getCompactor(forcedType)).compact(next, colNum, { compactType: forcedType });
     workingLayoutRef.current = compacted;
killedBy: GridLayout undo/redo Should treat compactNow() as an undo-tracked action
statusReason: expected 5 to be 2 // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:675:24
    * to the *built-in* strategies `compactor` being unset falls back to.
    */
   const commitForcedCompaction = useCallback((next: TLayout): void => {
-    const forcedType = compactType === ECompactType.NONE ? ECompactType.VERTICAL : compactType;
+    const forcedType = compactType !== ECompactType.NONE ? ECompactType.VERTICAL : compactType;
     const compacted = (compactor ?? getCompactor(forcedType)).compact(next, colNum, { compactType: forcedType });
     workingLayoutRef.current = compacted;
killedBy: GridLayout undo/redo Should treat compactNow() as an undo-tracked action
statusReason: expected 5 to be 2 // Object.is equality

[Killed] LogicalOperator
src/components/Grid/GridLayout.tsx:676:24
    */
   const commitForcedCompaction = useCallback((next: TLayout): void => {
     const forcedType = compactType === ECompactType.NONE ? ECompactType.VERTICAL : compactType;
-    const compacted = (compactor ?? getCompactor(forcedType)).compact(next, colNum, { compactType: forcedType });
+    const compacted = (compactor && getCompactor(forcedType)).compact(next, colNum, { compactType: forcedType });
     workingLayoutRef.current = compacted;
     setWorkingLayout(compacted);
killedBy: GridLayout undo/redo Should treat compactNow() as an undo-tracked action
statusReason: Cannot read properties of null (reading 'compact')

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:680:6
     workingLayoutRef.current = compacted;
     setWorkingLayout(compacted);
     onLayoutChange?.(compacted);
-  }, [compactor, compactType, colNum, onLayoutChange]);
+  }, []);
 
   const compactNow = useCallback((): void => {

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:682:46
     onLayoutChange?.(compacted);
   }, [compactor, compactType, colNum, onLayoutChange]);
 
-  const compactNow = useCallback((): void => {
-    commitUndoPoint(workingLayoutRef.current);
-    commitForcedCompaction(cloneLayout(workingLayoutRef.current));
-  }, [commitUndoPoint, commitForcedCompaction]);
+  const compactNow = useCallback((): void => {}, [commitUndoPoint, commitForcedCompaction]);
 
   const rearrange = useCallback((): void => {
killedBy: GridLayout undo/redo Should treat compactNow() as an undo-tracked action
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:687:45
     commitForcedCompaction(cloneLayout(workingLayoutRef.current));
   }, [commitUndoPoint, commitForcedCompaction]);
 
-  const rearrange = useCallback((): void => {
-    compactNow();
-  }, [compactNow]);
+  const rearrange = useCallback((): void => {}, [compactNow]);
 
   const duplicateItem = useCallback((id: string | number): string | number | null => {
killedBy: GridLayout imperative handle compactNow / rearrange rearrange() should be an alias for compactNow()
statusReason: Cannot read properties of undefined (reading '0')

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:689:6
 
   const rearrange = useCallback((): void => {
     compactNow();
-  }, [compactNow]);
+  }, []);
 
   const duplicateItem = useCallback((id: string | number): string | number | null => {

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:691:86
     compactNow();
   }, [compactNow]);
 
-  const duplicateItem = useCallback((id: string | number): string | number | null => {
-    const next = cloneLayout(workingLayoutRef.current);
-    const source = getLayoutItem(next, id);
-    if(!source) {
-      return null;
-    }
-
-    let suffix = 1;
-    let newId = `${id}-copy`;
-    const existingIds = new Set(next.map(item => String(item.i)));
-    while(existingIds.has(newId)) {
-      suffix += 1;
-      newId = `${id}-copy-${suffix}`;
-    }
-
-    commitUndoPoint(workingLayoutRef.current);
-    const { i: _unusedId, moved: _unusedMoved, ...rest } = source;
-    next.push({ ...rest, i: newId, y: source.y + source.h });
-    commitForcedCompaction(next);
-
-    return newId;
-  }, [commitUndoPoint, commitForcedCompaction]);
+  const duplicateItem = useCallback((id: string | number): string | number | null => {}, [commitUndoPoint, commitForcedCompaction]);
 
   /**
killedBy: GridLayout undo/redo Should treat duplicateItem() as an undo-tracked action
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:694:8
   const duplicateItem = useCallback((id: string | number): string | number | null => {
     const next = cloneLayout(workingLayoutRef.current);
     const source = getLayoutItem(next, id);
-    if(!source) {
+    if(false) {
       return null;
     }
killedBy: GridLayout imperative handle duplicateItem Should return null when the id doesn't match any item currently in the layout
statusReason: Cannot destructure property 'i' of 'source' as it is undefined.

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:694:8
   const duplicateItem = useCallback((id: string | number): string | number | null => {
     const next = cloneLayout(workingLayoutRef.current);
     const source = getLayoutItem(next, id);
-    if(!source) {
+    if(true) {
       return null;
     }
killedBy: GridLayout undo/redo Should treat duplicateItem() as an undo-tracked action
statusReason: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
src/components/Grid/GridLayout.tsx:699:17
     }
 
     let suffix = 1;
-    let newId = `${id}-copy`;
+    let newId = ``;
     const existingIds = new Set(next.map(item => String(item.i)));
     while(existingIds.has(newId)) {
killedBy: GridLayout imperative handle duplicateItem Should clone the item with a new, collision-safe id, placed below the source
statusReason: expected '' to be '0-copy' // Object.is equality

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:700:42
 
     let suffix = 1;
     let newId = `${id}-copy`;
-    const existingIds = new Set(next.map(item => String(item.i)));
+    const existingIds = new Set(next.map(() => undefined));
     while(existingIds.has(newId)) {
       suffix += 1;
killedBy: GridLayout imperative handle duplicateItem Should generate a further-suffixed id when a previous copy already exists
statusReason: expected '0-copy' to be '0-copy-2' // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:701:11
     let suffix = 1;
     let newId = `${id}-copy`;
     const existingIds = new Set(next.map(item => String(item.i)));
-    while(existingIds.has(newId)) {
+    while(false) {
       suffix += 1;
       newId = `${id}-copy-${suffix}`;
killedBy: GridLayout imperative handle duplicateItem Should generate a further-suffixed id when a previous copy already exists
statusReason: expected '0-copy' to be '0-copy-2' // Object.is equality

[Timeout] BlockStatement
src/components/Grid/GridLayout.tsx:701:35
     let suffix = 1;
     let newId = `${id}-copy`;
     const existingIds = new Set(next.map(item => String(item.i)));
-    while(existingIds.has(newId)) {
-      suffix += 1;
-      newId = `${id}-copy-${suffix}`;
-    }
+    while(existingIds.has(newId)) {}
 
     commitUndoPoint(workingLayoutRef.current);

[Killed] AssignmentOperator
src/components/Grid/GridLayout.tsx:702:7
     let newId = `${id}-copy`;
     const existingIds = new Set(next.map(item => String(item.i)));
     while(existingIds.has(newId)) {
-      suffix += 1;
+      suffix -= 1;
       newId = `${id}-copy-${suffix}`;
     }
killedBy: GridLayout imperative handle duplicateItem Should generate a further-suffixed id when a previous copy already exists
statusReason: expected '0-copy-0' to be '0-copy-2' // Object.is equality

[Killed] StringLiteral
src/components/Grid/GridLayout.tsx:703:15
     const existingIds = new Set(next.map(item => String(item.i)));
     while(existingIds.has(newId)) {
       suffix += 1;
-      newId = `${id}-copy-${suffix}`;
+      newId = ``;
     }
 
killedBy: GridLayout imperative handle duplicateItem Should generate a further-suffixed id when a previous copy already exists
statusReason: expected '' to be '0-copy-2' // Object.is equality

[Survived] ArithmeticOperator
src/components/Grid/GridLayout.tsx:708:39
 
     commitUndoPoint(workingLayoutRef.current);
     const { i: _unusedId, moved: _unusedMoved, ...rest } = source;
-    next.push({ ...rest, i: newId, y: source.y + source.h });
+    next.push({ ...rest, i: newId, y: source.y - source.h });
     commitForcedCompaction(next);
 

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:733:8
     adjustments: Map<string | number, { x?: number; y?: number }>,
     selectedIds: (string | number)[],
   ): void => {
-    if(adjustments.size === 0) {
+    if(adjustments.size !== 0) {
       return;
     }
killedBy: GridLayout align/distribute alignSelected Should align every other selected item's left edge to the anchor's, without moving the anchor itself
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:733:32
     adjustments: Map<string | number, { x?: number; y?: number }>,
     selectedIds: (string | number)[],
   ): void => {
-    if(adjustments.size === 0) {
-      return;
-    }
+    if(adjustments.size === 0) {}
 
     const next = cloneLayout(workingLayoutRef.current);
killedBy: GridLayout align/distribute alignSelected Should be a no-op when fewer than 2 items are selected
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:745:10
     adjustments.forEach((adjustment, id) => {
       const item = getLayoutItem(next, id);
-      if(!item) {
+      if(true) {
         return;
       }
killedBy: GridLayout align/distribute alignSelected Should align every other selected item's left edge to the anchor's, without moving the anchor itself
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:745:10
     adjustments.forEach((adjustment, id) => {
       const item = getLayoutItem(next, id);
-      if(!item) {
+      if(item) {
         return;
       }
killedBy: GridLayout align/distribute alignSelected Should align every other selected item's left edge to the anchor's, without moving the anchor itself
statusReason: expected +0 to be 5 // Object.is equality

[Survived] ObjectLiteral
src/components/Grid/GridLayout.tsx:748:25
       if(!item) {
         return;
       }
-      const candidate = { ...item, ...adjustment };
+      const candidate = {};
       if(preventCollision) {
         const collisions = getAllCollisions(next, candidate)

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:749:28
         return;
       }
       const candidate = { ...item, ...adjustment };
-      if(preventCollision) {
-        const collisions = getAllCollisions(next, candidate)
-          .filter(layoutItem => layoutItem.i !== item.i && !selectedIdSet.has(layoutItem.i));
-        if(collisions.length > 0) {
-          return;
-        }
-      }
+      if(preventCollision) {}
       if(adjustment.x !== undefined) {
         item.x = adjustment.x;
killedBy: GridLayout align/distribute alignSelected Should skip an adjustment that would collide with a non-selected item when preventCollision is on
statusReason: expected 5 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:749:10
         return;
       }
       const candidate = { ...item, ...adjustment };
-      if(preventCollision) {
+      if(false) {
         const collisions = getAllCollisions(next, candidate)
           .filter(layoutItem => layoutItem.i !== item.i && !selectedIdSet.has(layoutItem.i));
killedBy: GridLayout align/distribute alignSelected Should skip an adjustment that would collide with a non-selected item when preventCollision is on
statusReason: expected 5 to be +0 // Object.is equality

[Survived] MethodExpression
src/components/Grid/GridLayout.tsx:750:28
       }
       const candidate = { ...item, ...adjustment };
       if(preventCollision) {
-        const collisions = getAllCollisions(next, candidate)
-          .filter(layoutItem => layoutItem.i !== item.i && !selectedIdSet.has(layoutItem.i));
+        const collisions = getAllCollisions(next, candidate);
         if(collisions.length > 0) {
           return;

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:751:33
       const candidate = { ...item, ...adjustment };
       if(preventCollision) {
         const collisions = getAllCollisions(next, candidate)
-          .filter(layoutItem => layoutItem.i !== item.i && !selectedIdSet.has(layoutItem.i));
+          .filter(layoutItem => false);
         if(collisions.length > 0) {
           return;
killedBy: GridLayout align/distribute alignSelected Should skip an adjustment that would collide with a non-selected item when preventCollision is on
statusReason: expected 5 to be +0 // Object.is equality

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:751:19
       const candidate = { ...item, ...adjustment };
       if(preventCollision) {
         const collisions = getAllCollisions(next, candidate)
-          .filter(layoutItem => layoutItem.i !== item.i && !selectedIdSet.has(layoutItem.i));
+          .filter(() => undefined);
         if(collisions.length > 0) {
           return;
killedBy: GridLayout align/distribute alignSelected Should skip an adjustment that would collide with a non-selected item when preventCollision is on
statusReason: expected 5 to be +0 // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:752:12
       if(preventCollision) {
         const collisions = getAllCollisions(next, candidate)
           .filter(layoutItem => layoutItem.i !== item.i && !selectedIdSet.has(layoutItem.i));
-        if(collisions.length > 0) {
+        if(collisions.length <= 0) {
           return;
         }
killedBy: GridLayout align/distribute alignSelected Should skip an adjustment that would collide with a non-selected item when preventCollision is on
statusReason: expected 5 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:752:12
       if(preventCollision) {
         const collisions = getAllCollisions(next, candidate)
           .filter(layoutItem => layoutItem.i !== item.i && !selectedIdSet.has(layoutItem.i));
-        if(collisions.length > 0) {
+        if(true) {
           return;
         }
killedBy: GridLayout align/distribute alignSelected Should apply an adjustment normally when preventCollision is on but that specific adjustment doesn't actually collide with anything — confirmed gap via a fres
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:756:38
           return;
         }
       }
-      if(adjustment.x !== undefined) {
-        item.x = adjustment.x;
-      }
+      if(adjustment.x !== undefined) {}
       if(adjustment.y !== undefined) {
         item.y = adjustment.y;
killedBy: GridLayout align/distribute alignSelected Should align every other selected item's left edge to the anchor's, without moving the anchor itself
statusReason: expected +0 to be 5 // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:756:10
           return;
         }
       }
-      if(adjustment.x !== undefined) {
+      if(adjustment.x === undefined) {
         item.x = adjustment.x;
       }
killedBy: GridLayout align/distribute alignSelected Should align every other selected item's left edge to the anchor's, without moving the anchor itself
statusReason: expected +0 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:759:10
       if(adjustment.x !== undefined) {
         item.x = adjustment.x;
       }
-      if(adjustment.y !== undefined) {
+      if(false) {
         item.y = adjustment.y;
       }
killedBy: GridLayout align/distribute alignSelected Should align to the top edge
statusReason: expected 10 to be +0 // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:759:38
       if(adjustment.x !== undefined) {
         item.x = adjustment.x;
       }
-      if(adjustment.y !== undefined) {
-        item.y = adjustment.y;
-      }
+      if(adjustment.y !== undefined) {}
     });
 
killedBy: GridLayout align/distribute alignSelected Should align to the top edge
statusReason: expected 10 to be +0 // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:778:65
    * math — identical to the Vue package's own `alignSelected`, which
    * calls the same function.
    */
-  const alignSelected = useCallback((edge: TAlignEdge): void => {
-    const selectedIds = Array.from(selectedItemIds);
-    const adjustments = computeAlignAdjustments(workingLayoutRef.current, selectedIds, edge);
-    applyAlignDistributeAdjustments(adjustments, selectedIds);
-  }, [selectedItemIds, applyAlignDistributeAdjustments]);
+  const alignSelected = useCallback((edge: TAlignEdge): void => {}, [selectedItemIds, applyAlignDistributeAdjustments]);
 
   /**
killedBy: GridLayout align/distribute alignSelected Should align every other selected item's left edge to the anchor's, without moving the anchor itself
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:794:75
    * spacing math — identical to the Vue package's own
    * `distributeSelected`.
    */
-  const distributeSelected = useCallback((axis: TDistributeAxis): void => {
-    const selectedIds = Array.from(selectedItemIds);
-    const adjustments = computeDistributeAdjustments(workingLayoutRef.current, selectedIds, axis);
-    applyAlignDistributeAdjustments(adjustments, selectedIds);
-  }, [selectedItemIds, applyAlignDistributeAdjustments]);
+  const distributeSelected = useCallback((axis: TDistributeAxis): void => {}, [selectedItemIds, applyAlignDistributeAdjustments]);
 
   /**
killedBy: GridLayout align/distribute distributeSelected Should distribute the middle selected item evenly between the two outermost selected items
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:807:90
    * need to re-supply values already known here; any field in
    * `options` still overrides the corresponding pre-filled one.
    */
-  const exportLayoutAsSvg = useCallback((options?: IExportLayoutAsSvgOptions): string => {
-    return coreExportLayoutAsSvg(workingLayoutRef.current, {
-      colNum,
-      containerWidth: effectiveContainerWidth,
-      margin,
-      rowHeight,
-      ...options,
-    });
-  }, [colNum, effectiveContainerWidth, margin, rowHeight]);
+  const exportLayoutAsSvg = useCallback((options?: IExportLayoutAsSvgOptions): string => {}, [colNum, effectiveContainerWidth, margin, rowHeight]);
 
   /**
killedBy: GridLayout exportLayoutAsSvg Should render the current layout as an SVG string, pre-filled with this grid's own dimensions
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:830:8
    */
   const findItemElement = useCallback((id: string | number): HTMLElement | null => {
-    if(!containerRef.current) {
+    if(true) {
       return null;
     }
killedBy: GridLayout scrollToItem/focusItem Should scroll the matching item's own element into view
statusReason: expected "vi.fn()" to be called with arguments: [ { behavior: 'smooth', …(2) } ]

Number of calls: 0

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:830:8
    */
   const findItemElement = useCallback((id: string | number): HTMLElement | null => {
-    if(!containerRef.current) {
+    if(containerRef.current) {
       return null;
     }
killedBy: GridLayout scrollToItem/focusItem Should scroll the matching item's own element into view
statusReason: expected "vi.fn()" to be called with arguments: [ { behavior: 'smooth', …(2) } ]

Number of calls: 0

[Killed] StringLiteral
src/components/Grid/GridLayout.tsx:834:75
       return null;
     }
     const idAsString = String(id);
-    const candidates = containerRef.current.querySelectorAll<HTMLElement>(`[data-grid-item-id]`);
+    const candidates = containerRef.current.querySelectorAll<HTMLElement>(``);
     return Array.from(candidates).find(el => el.getAttribute(`data-grid-item-id`) === idAsString) ?? null;
   }, []);
killedBy: GridLayout scrollToItem/focusItem Should scroll the matching item's own element into view
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:835:46
     }
     const idAsString = String(id);
     const candidates = containerRef.current.querySelectorAll<HTMLElement>(`[data-grid-item-id]`);
-    return Array.from(candidates).find(el => el.getAttribute(`data-grid-item-id`) === idAsString) ?? null;
+    return Array.from(candidates).find(el => true) ?? null;
   }, []);
 
killedBy: GridLayout scrollToItem/focusItem Should scroll the matching item's own element into view
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:835:40
     }
     const idAsString = String(id);
     const candidates = containerRef.current.querySelectorAll<HTMLElement>(`[data-grid-item-id]`);
-    return Array.from(candidates).find(el => el.getAttribute(`data-grid-item-id`) === idAsString) ?? null;
+    return Array.from(candidates).find(() => undefined) ?? null;
   }, []);
 
killedBy: GridLayout scrollToItem/focusItem Should scroll the matching item's own element into view
statusReason: expected "vi.fn()" to be called with arguments: [ { behavior: 'smooth', …(2) } ]

Number of calls: 0

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:836:6
     const idAsString = String(id);
     const candidates = containerRef.current.querySelectorAll<HTMLElement>(`[data-grid-item-id]`);
     return Array.from(candidates).find(el => el.getAttribute(`data-grid-item-id`) === idAsString) ?? null;
-  }, []);
+  }, ["Stryker was here"]);
 
   /**

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:849:36
    * yet. A no-op (not a throw) when the id doesn't match any rendered
    * item.
    */
-  const scrollToItem = useCallback((id: string | number): Promise<void> => (
-    new Promise(resolve => {
-      setTimeout(() => {
-        findItemElement(id)?.scrollIntoView({ behavior: `smooth`, block: `nearest`, inline: `nearest` });
-        resolve();
-      }, 0);
-    })
-  ), [findItemElement]);
+  const scrollToItem = useCallback(() => undefined, [findItemElement]);
 
   /** Moves keyboard focus to the item with the given id, if it's currently rendered and focusable — the React port of Vue's own `focusItem`. Same deferral/no-op rationale as `scrollToItem` above. */
killedBy: GridLayout scrollToItem/focusItem Should scroll the matching item's own element into view
statusReason: expected "vi.fn()" to be called with arguments: [ { behavior: 'smooth', …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:850:28
    * item.
    */
   const scrollToItem = useCallback((id: string | number): Promise<void> => (
-    new Promise(resolve => {
-      setTimeout(() => {
-        findItemElement(id)?.scrollIntoView({ behavior: `smooth`, block: `nearest`, inline: `nearest` });
-        resolve();
-      }, 0);
-    })
+    new Promise(resolve => {})
   ), [findItemElement]);
 
killedBy: GridLayout scrollToItem/focusItem Should scroll the matching item's own element into view
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:851:24
    */
   const scrollToItem = useCallback((id: string | number): Promise<void> => (
     new Promise(resolve => {
-      setTimeout(() => {
-        findItemElement(id)?.scrollIntoView({ behavior: `smooth`, block: `nearest`, inline: `nearest` });
-        resolve();
-      }, 0);
+      setTimeout(() => {}, 0);
     })
   ), [findItemElement]);
killedBy: GridLayout scrollToItem/focusItem Should scroll the matching item's own element into view
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
