[Killed] OptionalChaining
src/components/Grid/GridLayout.tsx:852:9
   const scrollToItem = useCallback((id: string | number): Promise<void> => (
     new Promise(resolve => {
       setTimeout(() => {
-        findItemElement(id)?.scrollIntoView({ behavior: `smooth`, block: `nearest`, inline: `nearest` });
+        findItemElement(id).scrollIntoView({ behavior: `smooth`, block: `nearest`, inline: `nearest` });
         resolve();
       }, 0);
killedBy: GridLayout scrollToItem/focusItem Should be a no-op (not throw) when scrollToItem is called with an id that doesn't match any rendered item
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/components/Grid/GridLayout.tsx:852:45
   const scrollToItem = useCallback((id: string | number): Promise<void> => (
     new Promise(resolve => {
       setTimeout(() => {
-        findItemElement(id)?.scrollIntoView({ behavior: `smooth`, block: `nearest`, inline: `nearest` });
+        findItemElement(id)?.scrollIntoView({});
         resolve();
       }, 0);
killedBy: GridLayout scrollToItem/focusItem Should scroll the matching item's own element into view
statusReason: expected "vi.fn()" to be called with arguments: [ { behavior: 'smooth', …(2) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:859:33
   ), [findItemElement]);
 
   /** Moves keyboard focus to the item with the given id, if it's currently rendered and focusable — the React port of Vue's own `focusItem`. Same deferral/no-op rationale as `scrollToItem` above. */
-  const focusItem = useCallback((id: string | number): Promise<void> => (
-    new Promise(resolve => {
-      setTimeout(() => {
-        findItemElement(id)?.focus();
-        resolve();
-      }, 0);
-    })
-  ), [findItemElement]);
+  const focusItem = useCallback(() => undefined, [findItemElement]);
 
   const undo = useCallback((): void => {
killedBy: GridLayout scrollToItem/focusItem Should move keyboard focus to the matching item's own element
statusReason: expected <body><div>…(1)</div></body> to be <div aria-describedby="_r_8_" …(6)>…(9)</div> // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:860:28
 
   /** Moves keyboard focus to the item with the given id, if it's currently rendered and focusable — the React port of Vue's own `focusItem`. Same deferral/no-op rationale as `scrollToItem` above. */
   const focusItem = useCallback((id: string | number): Promise<void> => (
-    new Promise(resolve => {
-      setTimeout(() => {
-        findItemElement(id)?.focus();
-        resolve();
-      }, 0);
-    })
+    new Promise(resolve => {})
   ), [findItemElement]);
 
killedBy: GridLayout scrollToItem/focusItem Should move keyboard focus to the matching item's own element
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:861:24
   /** Moves keyboard focus to the item with the given id, if it's currently rendered and focusable — the React port of Vue's own `focusItem`. Same deferral/no-op rationale as `scrollToItem` above. */
   const focusItem = useCallback((id: string | number): Promise<void> => (
     new Promise(resolve => {
-      setTimeout(() => {
-        findItemElement(id)?.focus();
-        resolve();
-      }, 0);
+      setTimeout(() => {}, 0);
     })
   ), [findItemElement]);
killedBy: GridLayout scrollToItem/focusItem Should move keyboard focus to the matching item's own element
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/components/Grid/GridLayout.tsx:862:9
   const focusItem = useCallback((id: string | number): Promise<void> => (
     new Promise(resolve => {
       setTimeout(() => {
-        findItemElement(id)?.focus();
+        findItemElement(id).focus();
         resolve();
       }, 0);
killedBy: GridLayout scrollToItem/focusItem Should be a no-op (not throw) when focusItem is called with an id that doesn't match any rendered item
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:868:40
     })
   ), [findItemElement]);
 
-  const undo = useCallback((): void => {
-    if(historyRef.current.length === 0) {
-      return;
-    }
-    const previous = historyRef.current.pop()!;
-    futureRef.current.push(cloneLayout(workingLayoutRef.current));
-    workingLayoutRef.current = previous;
-    setWorkingLayout(previous);
-    onLayoutChange?.(previous);
-    setUndoRedoVersion(version => version + 1);
-  }, [onLayoutChange]);
+  const undo = useCallback((): void => {}, [onLayoutChange]);
 
   const redo = useCallback((): void => {
killedBy: GridLayout align/distribute alignSelected Should be undo-able
statusReason: expected 5 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:869:8
   ), [findItemElement]);
 
   const undo = useCallback((): void => {
-    if(historyRef.current.length === 0) {
+    if(false) {
       return;
     }
killedBy: GridLayout undo/redo Should be permanent no-ops when enableUndoRedo is off (the default)
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:869:8
   ), [findItemElement]);
 
   const undo = useCallback((): void => {
-    if(historyRef.current.length === 0) {
+    if(true) {
       return;
     }
killedBy: GridLayout align/distribute alignSelected Should be undo-able
statusReason: expected 5 to be +0 // Object.is equality

[Killed] OptionalChaining
src/components/Grid/GridLayout.tsx:876:5
     futureRef.current.push(cloneLayout(workingLayoutRef.current));
     workingLayoutRef.current = previous;
     setWorkingLayout(previous);
-    onLayoutChange?.(previous);
+    onLayoutChange(previous);
     setUndoRedoVersion(version => version + 1);
   }, [onLayoutChange]);
killedBy: GridLayout undo/redo Should clear the redo stack once a fresh action is committed after an undo
statusReason: onLayoutChange is not a function

[Survived] ArithmeticOperator
src/components/Grid/GridLayout.tsx:877:35
     workingLayoutRef.current = previous;
     setWorkingLayout(previous);
     onLayoutChange?.(previous);
-    setUndoRedoVersion(version => version + 1);
+    setUndoRedoVersion(version => version - 1);
   }, [onLayoutChange]);
 

[Survived] ArrowFunction
src/components/Grid/GridLayout.tsx:877:24
     workingLayoutRef.current = previous;
     setWorkingLayout(previous);
     onLayoutChange?.(previous);
-    setUndoRedoVersion(version => version + 1);
+    setUndoRedoVersion(() => undefined);
   }, [onLayoutChange]);
 

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:880:40
     setUndoRedoVersion(version => version + 1);
   }, [onLayoutChange]);
 
-  const redo = useCallback((): void => {
-    if(futureRef.current.length === 0) {
-      return;
-    }
-    const next = futureRef.current.pop()!;
-    historyRef.current.push(cloneLayout(workingLayoutRef.current));
-    workingLayoutRef.current = next;
-    setWorkingLayout(next);
-    onLayoutChange?.(next);
-    setUndoRedoVersion(version => version + 1);
-  }, [onLayoutChange]);
+  const redo = useCallback((): void => {}, [onLayoutChange]);
 
   const selectItem = useCallback((id: string | number): void => {
killedBy: GridLayout undo/redo Should redo after an undo
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:881:8
   }, [onLayoutChange]);
 
   const redo = useCallback((): void => {
-    if(futureRef.current.length === 0) {
+    if(false) {
       return;
     }
killedBy: GridLayout undo/redo Should be a no-op to redo when there's nothing to redo
statusReason: expected [Function] to not throw an error but 'Error: Invalid parameter layout passed' was thrown

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:881:8
   }, [onLayoutChange]);
 
   const redo = useCallback((): void => {
-    if(futureRef.current.length === 0) {
+    if(true) {
       return;
     }
killedBy: GridLayout undo/redo Should redo after an undo
statusReason: expected +0 to be 2 // Object.is equality

[Survived] OptionalChaining
src/components/Grid/GridLayout.tsx:888:5
     historyRef.current.push(cloneLayout(workingLayoutRef.current));
     workingLayoutRef.current = next;
     setWorkingLayout(next);
-    onLayoutChange?.(next);
+    onLayoutChange(next);
     setUndoRedoVersion(version => version + 1);
   }, [onLayoutChange]);

[Survived] ArrowFunction
src/components/Grid/GridLayout.tsx:889:24
     workingLayoutRef.current = next;
     setWorkingLayout(next);
     onLayoutChange?.(next);
-    setUndoRedoVersion(version => version + 1);
+    setUndoRedoVersion(() => undefined);
   }, [onLayoutChange]);
 

[Survived] ArithmeticOperator
src/components/Grid/GridLayout.tsx:889:35
     workingLayoutRef.current = next;
     setWorkingLayout(next);
     onLayoutChange?.(next);
-    setUndoRedoVersion(version => version + 1);
+    setUndoRedoVersion(version => version - 1);
   }, [onLayoutChange]);
 

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:890:6
     setWorkingLayout(next);
     onLayoutChange?.(next);
     setUndoRedoVersion(version => version + 1);
-  }, [onLayoutChange]);
+  }, []);
 
   const selectItem = useCallback((id: string | number): void => {

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:892:65
     setUndoRedoVersion(version => version + 1);
   }, [onLayoutChange]);
 
-  const selectItem = useCallback((id: string | number): void => {
-    setSelectedItemIds(prev => (prev.has(id) ? prev : new Set(prev).add(id)));
-  }, []);
+  const selectItem = useCallback((id: string | number): void => {}, []);
 
   const deselectItem = useCallback((id: string | number): void => {
killedBy: GridLayout multiSelect Should apply the selected class to a currently-selected item
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:893:24
   }, [onLayoutChange]);
 
   const selectItem = useCallback((id: string | number): void => {
-    setSelectedItemIds(prev => (prev.has(id) ? prev : new Set(prev).add(id)));
+    setSelectedItemIds(() => undefined);
   }, []);
 
killedBy: GridLayout multiSelect Should apply the selected class to a currently-selected item
statusReason: Cannot read properties of undefined (reading 'has')

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:894:6
 
   const selectItem = useCallback((id: string | number): void => {
     setSelectedItemIds(prev => (prev.has(id) ? prev : new Set(prev).add(id)));
-  }, []);
+  }, ["Stryker was here"]);
 
   const deselectItem = useCallback((id: string | number): void => {

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:896:67
     setSelectedItemIds(prev => (prev.has(id) ? prev : new Set(prev).add(id)));
   }, []);
 
-  const deselectItem = useCallback((id: string | number): void => {
-    setSelectedItemIds(prev => {
-      if(!prev.has(id)) {
-        return prev;
-      }
-      const next = new Set(prev);
-      next.delete(id);
-      return next;
-    });
-  }, []);
+  const deselectItem = useCallback((id: string | number): void => {}, []);
 
   const toggleItemSelection = useCallback((id: string | number): void => {
killedBy: GridLayout multiSelect Should expose selectItem/deselectItem/toggleItemSelection/clearSelection directly via the handle
statusReason: expected [ '0', '1' ] to strictly equal [ '1' ]

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:897:32
   }, []);
 
   const deselectItem = useCallback((id: string | number): void => {
-    setSelectedItemIds(prev => {
-      if(!prev.has(id)) {
-        return prev;
-      }
-      const next = new Set(prev);
-      next.delete(id);
-      return next;
-    });
+    setSelectedItemIds(prev => {});
   }, []);
 
killedBy: GridLayout multiSelect Should expose selectItem/deselectItem/toggleItemSelection/clearSelection directly via the handle
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:898:10
 
   const deselectItem = useCallback((id: string | number): void => {
     setSelectedItemIds(prev => {
-      if(!prev.has(id)) {
+      if(prev.has(id)) {
         return prev;
       }
killedBy: GridLayout multiSelect Should expose selectItem/deselectItem/toggleItemSelection/clearSelection directly via the handle
statusReason: expected [ '0', '1' ] to strictly equal [ '1' ]

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:898:10
 
   const deselectItem = useCallback((id: string | number): void => {
     setSelectedItemIds(prev => {
-      if(!prev.has(id)) {
+      if(true) {
         return prev;
       }
killedBy: GridLayout multiSelect Should expose selectItem/deselectItem/toggleItemSelection/clearSelection directly via the handle
statusReason: expected [ '0', '1' ] to strictly equal [ '1' ]

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:907:74
     });
   }, []);
 
-  const toggleItemSelection = useCallback((id: string | number): void => {
-    setSelectedItemIds(prev => {
-      const next = new Set(prev);
-      if(next.has(id)) {
-        next.delete(id);
-      } else {
-        next.add(id);
-      }
-      return next;
-    });
-  }, []);
+  const toggleItemSelection = useCallback((id: string | number): void => {}, []);
 
   const clearSelection = useCallback((): void => {
killedBy: GridLayout multiSelect Should toggle an item into the selection with a Ctrl+click, preserving the rest
statusReason: expected [ '0' ] to strictly equal [ '0', '1' ]

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:908:32
   }, []);
 
   const toggleItemSelection = useCallback((id: string | number): void => {
-    setSelectedItemIds(prev => {
-      const next = new Set(prev);
-      if(next.has(id)) {
-        next.delete(id);
-      } else {
-        next.add(id);
-      }
-      return next;
-    });
+    setSelectedItemIds(prev => {});
   }, []);
 
killedBy: GridLayout multiSelect Should toggle an item into the selection with a Ctrl+click, preserving the rest
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:910:10
   const toggleItemSelection = useCallback((id: string | number): void => {
     setSelectedItemIds(prev => {
       const next = new Set(prev);
-      if(next.has(id)) {
+      if(true) {
         next.delete(id);
       } else {
killedBy: GridLayout multiSelect Should toggle an item into the selection with a Ctrl+click, preserving the rest
statusReason: expected [ '0' ] to strictly equal [ '0', '1' ]

[Survived] ConditionalExpression
src/components/Grid/GridLayout.tsx:910:10
   const toggleItemSelection = useCallback((id: string | number): void => {
     setSelectedItemIds(prev => {
       const next = new Set(prev);
-      if(next.has(id)) {
+      if(false) {
         next.delete(id);
       } else {

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:919:50
     });
   }, []);
 
-  const clearSelection = useCallback((): void => {
-    lastAnchorIdRef.current = null;
-    setSelectedItemIds(prev => (prev.size === 0 ? prev : new Set()));
-  }, []);
+  const clearSelection = useCallback((): void => {}, []);
 
   /**
killedBy: GridLayout multiSelect Should clear the selection when clicking the grid's own empty background
statusReason: expected [ '0' ] to strictly equal []

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:921:24
 
   const clearSelection = useCallback((): void => {
     lastAnchorIdRef.current = null;
-    setSelectedItemIds(prev => (prev.size === 0 ? prev : new Set()));
+    setSelectedItemIds(() => undefined);
   }, []);
 
killedBy: GridLayout multiSelect Should clear the selection when clicking the grid's own empty background
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:921:33
 
   const clearSelection = useCallback((): void => {
     lastAnchorIdRef.current = null;
-    setSelectedItemIds(prev => (prev.size === 0 ? prev : new Set()));
+    setSelectedItemIds(prev => (true ? prev : new Set()));
   }, []);
 
killedBy: GridLayout multiSelect Should clear the selection when clicking the grid's own empty background
statusReason: expected [ '0' ] to strictly equal []

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:940:140
    * Shift-clicks keep re-anchoring to the same fixed point rather than
    * compounding from the previous Shift-click target.
    */
-  const handleItemClick = useCallback((id: string | number, modifiers: { ctrlKey: boolean; metaKey: boolean; shiftKey: boolean }): void => {
-    // Confirmed unreachable through any real click, not assumed:
-    // GridItem.tsx's own handleClick already checks context.multiSelect
-    // and returns early before ever calling context.onItemClick (this
-    // function), so this can never actually run with multiSelect false
-    // via a real interaction. Not exposed via ref either, so there's no
-    // other call path to reach it through. Kept as a defensive guard —
-    // same category as this file's own container-ref checks.
-    /* v8 ignore next 3 -- see the comment above: unreachable since GridItem's own click handler already gates on multiSelect before ever calling this. */
-    if(!multiSelect) {
-      return;
-    }
-    if(modifiers.shiftKey && lastAnchorIdRef.current !== null) {
-      const range = computeRangeSelection(workingLayoutRef.current, lastAnchorIdRef.current, id);
-      setSelectedItemIds(new Set(range));
-      return;
-    }
-    if(modifiers.shiftKey || modifiers.ctrlKey || modifiers.metaKey) {
-      toggleItemSelection(id);
-    } else {
-      setSelectedItemIds(new Set([id]));
-    }
-    lastAnchorIdRef.current = id;
-  }, [multiSelect, toggleItemSelection]);
+  const handleItemClick = useCallback((id: string | number, modifiers: { ctrlKey: boolean; metaKey: boolean; shiftKey: boolean }): void => {}, [multiSelect, toggleItemSelection]);
 
killedBy: GridLayout multiSelect Should select an item exclusively on a plain click
statusReason: expected [] to strictly equal [ '0' ]

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:949:8
     // other call path to reach it through. Kept as a defensive guard —
     // same category as this file's own container-ref checks.
     /* v8 ignore next 3 -- see the comment above: unreachable since GridItem's own click handler already gates on multiSelect before ever calling this. */
-    if(!multiSelect) {
+    if(true) {
       return;
     }
killedBy: GridLayout multiSelect Should select an item exclusively on a plain click
statusReason: expected [] to strictly equal [ '0' ]

[Killed] BooleanLiteral
src/components/Grid/GridLayout.tsx:949:8
     // other call path to reach it through. Kept as a defensive guard —
     // same category as this file's own container-ref checks.
     /* v8 ignore next 3 -- see the comment above: unreachable since GridItem's own click handler already gates on multiSelect before ever calling this. */
-    if(!multiSelect) {
+    if(multiSelect) {
       return;
     }
killedBy: GridLayout multiSelect Should select an item exclusively on a plain click
statusReason: expected [] to strictly equal [ '0' ]

[Killed] LogicalOperator
src/components/Grid/GridLayout.tsx:952:8
     if(!multiSelect) {
       return;
     }
-    if(modifiers.shiftKey && lastAnchorIdRef.current !== null) {
+    if(modifiers.shiftKey || lastAnchorIdRef.current !== null) {
       const range = computeRangeSelection(workingLayoutRef.current, lastAnchorIdRef.current, id);
       setSelectedItemIds(new Set(range));
killedBy: GridLayout multiSelect Should replace the prior exclusive selection on a second plain click
statusReason: expected [ '0', '1' ] to strictly equal [ '1' ]

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:952:8
     if(!multiSelect) {
       return;
     }
-    if(modifiers.shiftKey && lastAnchorIdRef.current !== null) {
+    if(true) {
       const range = computeRangeSelection(workingLayoutRef.current, lastAnchorIdRef.current, id);
       setSelectedItemIds(new Set(range));
killedBy: GridLayout multiSelect Should toggle an item into the selection with a Ctrl+click, preserving the rest
statusReason: expected [ '1' ] to strictly equal [ '0', '1' ]

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:957:70
       setSelectedItemIds(new Set(range));
       return;
     }
-    if(modifiers.shiftKey || modifiers.ctrlKey || modifiers.metaKey) {
-      toggleItemSelection(id);
-    } else {
+    if(modifiers.shiftKey || modifiers.ctrlKey || modifiers.metaKey) {} else {
       setSelectedItemIds(new Set([id]));
     }
killedBy: GridLayout multiSelect Should toggle an item into the selection with a Ctrl+click, preserving the rest
statusReason: expected [ '0' ] to strictly equal [ '0', '1' ]

[Killed] LogicalOperator
src/components/Grid/GridLayout.tsx:957:8
       setSelectedItemIds(new Set(range));
       return;
     }
-    if(modifiers.shiftKey || modifiers.ctrlKey || modifiers.metaKey) {
+    if((modifiers.shiftKey || modifiers.ctrlKey) && modifiers.metaKey) {
       toggleItemSelection(id);
     } else {
killedBy: GridLayout multiSelect Should toggle an item into the selection with a Ctrl+click, preserving the rest
statusReason: expected [ '1' ] to strictly equal [ '0', '1' ]

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:959:12
     }
     if(modifiers.shiftKey || modifiers.ctrlKey || modifiers.metaKey) {
       toggleItemSelection(id);
-    } else {
-      setSelectedItemIds(new Set([id]));
-    }
+    } else {}
     lastAnchorIdRef.current = id;
   }, [multiSelect, toggleItemSelection]);
killedBy: GridLayout multiSelect Should select an item exclusively on a plain click
statusReason: expected [] to strictly equal [ '0' ]

[Timeout] ArrayDeclaration
src/components/Grid/GridLayout.tsx:963:6
       setSelectedItemIds(new Set([id]));
     }
     lastAnchorIdRef.current = id;
-  }, [multiSelect, toggleItemSelection]);
+  }, []);
 

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:966:90
   }, [multiSelect, toggleItemSelection]);
 
-  const handleBackgroundClick = useCallback((event: MouseEvent<HTMLDivElement>): void => {
-    if(event.target === event.currentTarget) {
-      clearSelection();
-    }
-  }, [clearSelection]);
+  const handleBackgroundClick = useCallback((event: MouseEvent<HTMLDivElement>): void => {}, [clearSelection]);
 
   useImperativeHandle(ref, () => ({
killedBy: GridLayout multiSelect Should clear the selection when clicking the grid's own empty background
statusReason: expected [ '0' ] to strictly equal []

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:967:8
 
   const handleBackgroundClick = useCallback((event: MouseEvent<HTMLDivElement>): void => {
-    if(event.target === event.currentTarget) {
+    if(false) {
       clearSelection();
     }
killedBy: GridLayout multiSelect Should clear the selection when clicking the grid's own empty background
statusReason: expected [ '0' ] to strictly equal []

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:967:8
 
   const handleBackgroundClick = useCallback((event: MouseEvent<HTMLDivElement>): void => {
-    if(event.target === event.currentTarget) {
+    if(event.target !== event.currentTarget) {
       clearSelection();
     }
killedBy: GridLayout multiSelect Should clear the selection when clicking the grid's own empty background
statusReason: expected [ '0' ] to strictly equal []

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:974:14
 
   useImperativeHandle(ref, () => ({
     alignSelected,
-    canRedo: futureRef.current.length > 0,
+    canRedo: false,
     canUndo: historyRef.current.length > 0,
     clearSelection,
killedBy: GridLayout undo/redo Should redo after an undo
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:974:14
 
   useImperativeHandle(ref, () => ({
     alignSelected,
-    canRedo: futureRef.current.length > 0,
+    canRedo: futureRef.current.length >= 0,
     canUndo: historyRef.current.length > 0,
     clearSelection,
killedBy: GridLayout undo/redo Should default canUndo/canRedo to false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:975:14
   useImperativeHandle(ref, () => ({
     alignSelected,
     canRedo: futureRef.current.length > 0,
-    canUndo: historyRef.current.length > 0,
+    canUndo: true,
     clearSelection,
     compactNow,
killedBy: GridLayout undo/redo Should default canUndo/canRedo to false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:975:14
   useImperativeHandle(ref, () => ({
     alignSelected,
     canRedo: futureRef.current.length > 0,
-    canUndo: historyRef.current.length > 0,
+    canUndo: historyRef.current.length <= 0,
     clearSelection,
     compactNow,
killedBy: GridLayout undo/redo Should default canUndo/canRedo to false
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1018:29
   const updateGuidesAndIndicators = useCallback((id: string | number, x: number, y: number, w: number, h: number): void => {
     const activeItem = { h, i: id, w, x, y };
 
-    if(showAlignmentGuides) {
-      const guides = findAlignmentGuides(workingLayoutRef.current, activeItem);
-      if(guides.length === 0 || effectiveContainerWidth < 1) {
-        setAlignmentGuideStyles([]);
-      } else {
-        const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
-        setAlignmentGuideStyles(guides.map(guide => (guide.axis === `x`
-          ? { height: `100%`, left: `${guide.position * (colWidth + margin[0]) + margin[0]}px`, top: `0`, width: `1px` }
-          : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight + margin[1]) + margin[1]}px`, width: `100%` }
-        )));
-      }
-    }
+    if(showAlignmentGuides) {}
 
     if(showSpacingGuides) {
killedBy: GridLayout showAlignmentGuides Should render a guide line for each edge alignment found while dragging, and clear them on dragend
statusReason: expected  to have a length of 2 but got +0

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1018:8
   const updateGuidesAndIndicators = useCallback((id: string | number, x: number, y: number, w: number, h: number): void => {
     const activeItem = { h, i: id, w, x, y };
 
-    if(showAlignmentGuides) {
+    if(false) {
       const guides = findAlignmentGuides(workingLayoutRef.current, activeItem);
       if(guides.length === 0 || effectiveContainerWidth < 1) {
killedBy: GridLayout showAlignmentGuides Should render a guide line for each edge alignment found while dragging, and clear them on dragend
statusReason: expected  to have a length of 2 but got +0

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1020:10
 
     if(showAlignmentGuides) {
       const guides = findAlignmentGuides(workingLayoutRef.current, activeItem);
-      if(guides.length === 0 || effectiveContainerWidth < 1) {
+      if(guides.length !== 0 || effectiveContainerWidth < 1) {
         setAlignmentGuideStyles([]);
       } else {
killedBy: GridLayout showAlignmentGuides Should render a guide line for each edge alignment found while dragging, and clear them on dragend
statusReason: expected  to have a length of 2 but got +0

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1020:10
 
     if(showAlignmentGuides) {
       const guides = findAlignmentGuides(workingLayoutRef.current, activeItem);
-      if(guides.length === 0 || effectiveContainerWidth < 1) {
+      if(true) {
         setAlignmentGuideStyles([]);
       } else {
killedBy: GridLayout showAlignmentGuides Should render a guide line for each edge alignment found while dragging, and clear them on dragend
statusReason: expected  to have a length of 2 but got +0

[Killed] ArrayDeclaration
src/components/Grid/GridLayout.tsx:1021:33
     if(showAlignmentGuides) {
       const guides = findAlignmentGuides(workingLayoutRef.current, activeItem);
       if(guides.length === 0 || effectiveContainerWidth < 1) {
-        setAlignmentGuideStyles([]);
+        setAlignmentGuideStyles(["Stryker was here"]);
       } else {
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render no guide when the feature is on but nothing actually aligns
statusReason: The `style` prop expects a mapping from style properties to values, not a string. For example, style={{marginRight: spacing + 'em'}} when using JSX.
