[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1022:14
       const guides = findAlignmentGuides(workingLayoutRef.current, activeItem);
       if(guides.length === 0 || effectiveContainerWidth < 1) {
         setAlignmentGuideStyles([]);
-      } else {
-        const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
-        setAlignmentGuideStyles(guides.map(guide => (guide.axis === `x`
-          ? { height: `100%`, left: `${guide.position * (colWidth + margin[0]) + margin[0]}px`, top: `0`, width: `1px` }
-          : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight + margin[1]) + margin[1]}px`, width: `100%` }
-        )));
-      }
+      } else {}
     }
 
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a vertical (x-axis) guide line at the exact pixel position where two edges align
statusReason: expected null to be truthy

[Killed] ArrowFunction
src/components/Grid/GridLayout.tsx:1024:44
         setAlignmentGuideStyles([]);
       } else {
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
-        setAlignmentGuideStyles(guides.map(guide => (guide.axis === `x`
-          ? { height: `100%`, left: `${guide.position * (colWidth + margin[0]) + margin[0]}px`, top: `0`, width: `1px` }
-          : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight + margin[1]) + margin[1]}px`, width: `100%` }
-        )));
+        setAlignmentGuideStyles(guides.map(() => undefined));
       }
     }
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a vertical (x-axis) guide line at the exact pixel position where two edges align
statusReason: expected '' to be '410px' // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1024:54
         setAlignmentGuideStyles([]);
       } else {
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
-        setAlignmentGuideStyles(guides.map(guide => (guide.axis === `x`
+        setAlignmentGuideStyles(guides.map(guide => (false
           ? { height: `100%`, left: `${guide.position * (colWidth + margin[0]) + margin[0]}px`, top: `0`, width: `1px` }
           : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight + margin[1]) + margin[1]}px`, width: `100%` }
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a vertical (x-axis) guide line at the exact pixel position where two edges align
statusReason: expected '0px' to be '410px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1025:40
       } else {
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
         setAlignmentGuideStyles(guides.map(guide => (guide.axis === `x`
-          ? { height: `100%`, left: `${guide.position * (colWidth + margin[0]) + margin[0]}px`, top: `0`, width: `1px` }
+          ? { height: `100%`, left: `${guide.position * (colWidth + margin[0]) - margin[0]}px`, top: `0`, width: `1px` }
           : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight + margin[1]) + margin[1]}px`, width: `100%` }
         )));
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a vertical (x-axis) guide line at the exact pixel position where two edges align
statusReason: expected '390px' to be '410px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1025:58
       } else {
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
         setAlignmentGuideStyles(guides.map(guide => (guide.axis === `x`
-          ? { height: `100%`, left: `${guide.position * (colWidth + margin[0]) + margin[0]}px`, top: `0`, width: `1px` }
+          ? { height: `100%`, left: `${guide.position * (colWidth - margin[0]) + margin[0]}px`, top: `0`, width: `1px` }
           : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight + margin[1]) + margin[1]}px`, width: `100%` }
         )));
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a vertical (x-axis) guide line at the exact pixel position where two edges align
statusReason: expected '330px' to be '410px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1026:49
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
         setAlignmentGuideStyles(guides.map(guide => (guide.axis === `x`
           ? { height: `100%`, left: `${guide.position * (colWidth + margin[0]) + margin[0]}px`, top: `0`, width: `1px` }
-          : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight + margin[1]) + margin[1]}px`, width: `100%` }
+          : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight + margin[1]) - margin[1]}px`, width: `100%` }
         )));
       }
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a horizontal (y-axis) guide line at the exact pixel position where two edges align
statusReason: expected '210px' to be '230px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1026:49
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
         setAlignmentGuideStyles(guides.map(guide => (guide.axis === `x`
           ? { height: `100%`, left: `${guide.position * (colWidth + margin[0]) + margin[0]}px`, top: `0`, width: `1px` }
-          : { height: `1px`, left: `0`, top: `${guide.position * (rowHeight + margin[1]) + margin[1]}px`, width: `100%` }
+          : { height: `1px`, left: `0`, top: `${guide.position / (rowHeight + margin[1]) + margin[1]}px`, width: `100%` }
         )));
       }
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a horizontal (y-axis) guide line at the exact pixel position where two edges align
statusReason: expected '10.018181818181818px' to be '230px' // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1031:8
       }
     }
 
-    if(showSpacingGuides) {
+    if(false) {
       const indicators = findSpacingIndicators(workingLayoutRef.current, activeItem);
       if(indicators.length === 0 || effectiveContainerWidth < 1) {
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected null to be truthy

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1031:8
       }
     }
 
-    if(showSpacingGuides) {
+    if(true) {
       const indicators = findSpacingIndicators(workingLayoutRef.current, activeItem);
       if(indicators.length === 0 || effectiveContainerWidth < 1) {
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should not render any indicator at all when showSpacingGuides is off (the default), even where one would otherwise fire
statusReason: expected <div …(2)></div> to be falsy

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1033:10
 
     if(showSpacingGuides) {
       const indicators = findSpacingIndicators(workingLayoutRef.current, activeItem);
-      if(indicators.length === 0 || effectiveContainerWidth < 1) {
+      if(indicators.length !== 0 || effectiveContainerWidth < 1) {
         setSpacingIndicatorStyles([]);
       } else {
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected null to be truthy

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1033:37
 
     if(showSpacingGuides) {
       const indicators = findSpacingIndicators(workingLayoutRef.current, activeItem);
-      if(indicators.length === 0 || effectiveContainerWidth < 1) {
+      if(indicators.length === 0 || effectiveContainerWidth >= 1) {
         setSpacingIndicatorStyles([]);
       } else {
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected null to be truthy

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1035:14
       const indicators = findSpacingIndicators(workingLayoutRef.current, activeItem);
       if(indicators.length === 0 || effectiveContainerWidth < 1) {
         setSpacingIndicatorStyles([]);
-      } else {
-        const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
-        setSpacingIndicatorStyles(indicators.map(indicator => {
-          if(indicator.axis === `x`) {
-            const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
-            const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
-            const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
-            return {
-              label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
-              left: `${(startPx + endPx) / 2}px`,
-              top: `${centerY}px`,
-            };
-          }
-          const startPxY = indicator.gapStart * (rowHeight + margin[1]) + margin[1];
-          const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
-          const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
-          return {
-            label: `${indicator.distance} row${indicator.distance === 1 ? `` : `s`}`,
-            left: `${centerX}px`,
-            top: `${(startPxY + endPxY) / 2}px`,
-          };
-        }));
-      }
+      } else {}
     }
   }, [showAlignmentGuides, showSpacingGuides, effectiveContainerWidth, margin, colNum, rowHeight]);
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected null to be truthy

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1037:63
         setSpacingIndicatorStyles([]);
       } else {
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
-        setSpacingIndicatorStyles(indicators.map(indicator => {
-          if(indicator.axis === `x`) {
-            const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
-            const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
-            const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
-            return {
-              label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
-              left: `${(startPx + endPx) / 2}px`,
-              top: `${centerY}px`,
-            };
-          }
-          const startPxY = indicator.gapStart * (rowHeight + margin[1]) + margin[1];
-          const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
-          const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
-          return {
-            label: `${indicator.distance} row${indicator.distance === 1 ? `` : `s`}`,
-            left: `${centerX}px`,
-            top: `${(startPxY + endPxY) / 2}px`,
-          };
-        }));
+        setSpacingIndicatorStyles(indicators.map(indicator => {}));
       }
     }
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: Cannot read properties of undefined (reading 'left')

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1038:38
       } else {
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
         setSpacingIndicatorStyles(indicators.map(indicator => {
-          if(indicator.axis === `x`) {
-            const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
-            const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
-            const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
-            return {
-              label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
-              left: `${(startPx + endPx) / 2}px`,
-              top: `${centerY}px`,
-            };
-          }
+          if(indicator.axis === `x`) {}
           const startPxY = indicator.gapStart * (rowHeight + margin[1]) + margin[1];
           const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '2 rows' to be '2 cols' // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1038:14
       } else {
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
         setSpacingIndicatorStyles(indicators.map(indicator => {
-          if(indicator.axis === `x`) {
+          if(indicator.axis !== `x`) {
             const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '2 rows' to be '2 cols' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1039:29
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
         setSpacingIndicatorStyles(indicators.map(indicator => {
           if(indicator.axis === `x`) {
-            const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
+            const startPx = indicator.gapStart / (colWidth + margin[0]) + margin[0];
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '310.02px' to be '510px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1039:51
         const colWidth = calcColWidth(effectiveContainerWidth, margin[0], colNum);
         setSpacingIndicatorStyles(indicators.map(indicator => {
           if(indicator.axis === `x`) {
-            const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
+            const startPx = indicator.gapStart * (colWidth - margin[0]) + margin[0];
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '470px' to be '510px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1040:47
         setSpacingIndicatorStyles(indicators.map(indicator => {
           if(indicator.axis === `x`) {
             const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
-            const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
+            const endPx = indicator.gapEnd * (colWidth - margin[0]) + margin[0];
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
             return {
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '450px' to be '510px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1040:27
         setSpacingIndicatorStyles(indicators.map(indicator => {
           if(indicator.axis === `x`) {
             const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
-            const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
+            const endPx = indicator.gapEnd * (colWidth + margin[0]) - margin[0];
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
             return {
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '500px' to be '510px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1041:44
           if(indicator.axis === `x`) {
             const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
-            const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
+            const centerY = (y + h / 2) * (rowHeight - margin[1]) + margin[1];
             return {
               label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '100px' to be '120px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1041:29
           if(indicator.axis === `x`) {
             const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
-            const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
+            const centerY = (y + h / 2) / (rowHeight + margin[1]) + margin[1];
             return {
               label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '10.00909090909091px' to be '120px' // Object.is equality

[Killed] ObjectLiteral
src/components/Grid/GridLayout.tsx:1042:20
             const startPx = indicator.gapStart * (colWidth + margin[0]) + margin[0];
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
-            return {
-              label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
-              left: `${(startPx + endPx) / 2}px`,
-              top: `${centerY}px`,
-            };
+            return {};
           }
           const startPxY = indicator.gapStart * (rowHeight + margin[1]) + margin[1];
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '' to be '2 cols' // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1043:50
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
             return {
-              label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
+              label: `${indicator.distance} col${indicator.distance !== 1 ? `` : `s`}`,
               left: `${(startPx + endPx) / 2}px`,
               top: `${centerY}px`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '2 col' to be '2 cols' // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1043:50
             const endPx = indicator.gapEnd * (colWidth + margin[0]) + margin[0];
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
             return {
-              label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
+              label: `${indicator.distance} col${false ? `` : `s`}`,
               left: `${(startPx + endPx) / 2}px`,
               top: `${centerY}px`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should use the singular label for an exact 1-unit gap
statusReason: expected '1 cols' to be '1 col' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1044:25
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
             return {
               label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
-              left: `${(startPx + endPx) / 2}px`,
+              left: `${(startPx - endPx) / 2}px`,
               top: `${centerY}px`,
             };
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '-100px' to be '510px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1044:24
             const centerY = (y + h / 2) * (rowHeight + margin[1]) + margin[1];
             return {
               label: `${indicator.distance} col${indicator.distance === 1 ? `` : `s`}`,
-              left: `${(startPx + endPx) / 2}px`,
+              left: `${(startPx + endPx) * 2}px`,
               top: `${centerY}px`,
             };
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position
statusReason: expected '2040px' to be '510px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1048:50
               top: `${centerY}px`,
             };
           }
-          const startPxY = indicator.gapStart * (rowHeight + margin[1]) + margin[1];
+          const startPxY = indicator.gapStart * (rowHeight - margin[1]) + margin[1];
           const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
           const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position for a vertical (row) gap — confirmed gap via a fresh coverage 
statusReason: expected '630px' to be '670px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1048:28
               top: `${centerY}px`,
             };
           }
-          const startPxY = indicator.gapStart * (rowHeight + margin[1]) + margin[1];
+          const startPxY = indicator.gapStart * (rowHeight + margin[1]) - margin[1];
           const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
           const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position for a vertical (row) gap — confirmed gap via a fresh coverage 
statusReason: expected '660px' to be '670px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1049:26
             };
           }
           const startPxY = indicator.gapStart * (rowHeight + margin[1]) + margin[1];
-          const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
+          const endPxY = indicator.gapEnd / (rowHeight + margin[1]) + margin[1];
           const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
           return {
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position for a vertical (row) gap — confirmed gap via a fresh coverage 
statusReason: expected '230.03636363636363px' to be '670px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1049:46
             };
           }
           const startPxY = indicator.gapStart * (rowHeight + margin[1]) + margin[1];
-          const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
+          const endPxY = indicator.gapEnd * (rowHeight - margin[1]) + margin[1];
           const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
           return {
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position for a vertical (row) gap — confirmed gap via a fresh coverage 
statusReason: expected '590px' to be '670px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1050:32
           }
           const startPxY = indicator.gapStart * (rowHeight + margin[1]) + margin[1];
           const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
-          const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
+          const centerX = (x + w * 2) * (colWidth + margin[0]) + margin[0];
           return {
             label: `${indicator.distance} row${indicator.distance === 1 ? `` : `s`}`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position for a vertical (row) gap — confirmed gap via a fresh coverage 
statusReason: expected '410px' to be '110px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1050:42
           }
           const startPxY = indicator.gapStart * (rowHeight + margin[1]) + margin[1];
           const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
-          const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
+          const centerX = (x + w / 2) * (colWidth - margin[0]) + margin[0];
           return {
             label: `${indicator.distance} row${indicator.distance === 1 ? `` : `s`}`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position for a vertical (row) gap — confirmed gap via a fresh coverage 
statusReason: expected '90px' to be '110px' // Object.is equality

[Killed] EqualityOperator
src/components/Grid/GridLayout.tsx:1052:48
           const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
           const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
           return {
-            label: `${indicator.distance} row${indicator.distance === 1 ? `` : `s`}`,
+            label: `${indicator.distance} row${indicator.distance !== 1 ? `` : `s`}`,
             left: `${centerX}px`,
             top: `${(startPxY + endPxY) / 2}px`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position for a vertical (row) gap — confirmed gap via a fresh coverage 
statusReason: expected '4 row' to be '4 rows' // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/GridLayout.tsx:1052:48
           const endPxY = indicator.gapEnd * (rowHeight + margin[1]) + margin[1];
           const centerX = (x + w / 2) * (colWidth + margin[0]) + margin[0];
           return {
-            label: `${indicator.distance} row${indicator.distance === 1 ? `` : `s`}`,
+            label: `${indicator.distance} row${false ? `` : `s`}`,
             left: `${centerX}px`,
             top: `${(startPxY + endPxY) / 2}px`,
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should use the singular label for an exact 1-row gap — confirmed gap via a fresh coverage report
statusReason: expected '1 rows' to be '1 row' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1054:21
           return {
             label: `${indicator.distance} row${indicator.distance === 1 ? `` : `s`}`,
             left: `${centerX}px`,
-            top: `${(startPxY + endPxY) / 2}px`,
+            top: `${(startPxY + endPxY) * 2}px`,
           };
         }));
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position for a vertical (row) gap — confirmed gap via a fresh coverage 
statusReason: expected '2680px' to be '670px' // Object.is equality

[Killed] ArithmeticOperator
src/components/Grid/GridLayout.tsx:1054:22
           return {
             label: `${indicator.distance} row${indicator.distance === 1 ? `` : `s`}`,
             left: `${centerX}px`,
-            top: `${(startPxY + endPxY) / 2}px`,
+            top: `${(startPxY - endPxY) / 2}px`,
           };
         }));
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should render a labeled spacing indicator with the exact gap distance and pixel position for a vertical (row) gap — confirmed gap via a fresh coverage 
statusReason: expected '-220px' to be '670px' // Object.is equality

[Killed] BlockStatement
src/components/Grid/GridLayout.tsx:1061:60
     }
   }, [showAlignmentGuides, showSpacingGuides, effectiveContainerWidth, margin, colNum, rowHeight]);
 
-  const clearGuidesAndIndicators = useCallback((): void => {
-    setAlignmentGuideStyles([]);
-    setSpacingIndicatorStyles([]);
-  }, []);
+  const clearGuidesAndIndicators = useCallback((): void => {}, []);
 
   /**
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should clear any rendered guide once the drag ends
statusReason: expected <div …(2)></div> to be falsy

[Killed] ArrayDeclaration
src/components/Grid/GridLayout.tsx:1062:29
   }, [showAlignmentGuides, showSpacingGuides, effectiveContainerWidth, margin, colNum, rowHeight]);
 
   const clearGuidesAndIndicators = useCallback((): void => {
-    setAlignmentGuideStyles([]);
+    setAlignmentGuideStyles(["Stryker was here"]);
     setSpacingIndicatorStyles([]);
   }, []);
killedBy: GridLayout showAlignmentGuides/showSpacingGuides Should clear any rendered guide once the drag ends
statusReason: The `style` prop expects a mapping from style properties to values, not a string. For example, style={{marginRight: spacing + 'em'}} when using JSX.
