[Timeout] BooleanLiteral
components/Grid/hooks/useGridItemResize.ts:103:48
  * only) — see `packages/react/README.md` for the full scope note.
  */
 export function useGridItemResize(rootRef: RefObject<HTMLDivElement | null>, options: IUseGridItemResizeOptions): IUseGridItemResizeReturn {
-  const [isResizing, setIsResizing] = useState(false);
+  const [isResizing, setIsResizing] = useState(true);
   const [resizing, setResizing] = useState<IGridItemPosition | undefined>(undefined);
 

[Timeout] BooleanLiteral
components/Grid/hooks/useGridItemResize.ts:107:92
   const [resizing, setResizing] = useState<IGridItemPosition | undefined>(undefined);
 
   const resizingRef = useRef<IGridItemPosition | undefined>(undefined);
-  const edgesRef = useRef<IInteractEdges>({ bottom: false, left: false, right: false, top: false });
+  const edgesRef = useRef<IInteractEdges>({ bottom: false, left: false, right: false, top: true });
   const aspectRatioRef = useRef<number | undefined>(undefined);
   const lastW = useRef(NaN);

[Timeout] BooleanLiteral
components/Grid/hooks/useGridItemResize.ts:107:66
   const [resizing, setResizing] = useState<IGridItemPosition | undefined>(undefined);
 
   const resizingRef = useRef<IGridItemPosition | undefined>(undefined);
-  const edgesRef = useRef<IInteractEdges>({ bottom: false, left: false, right: false, top: false });
+  const edgesRef = useRef<IInteractEdges>({ bottom: false, left: true, right: false, top: false });
   const aspectRatioRef = useRef<number | undefined>(undefined);
   const lastW = useRef(NaN);

[Timeout] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:118:6
   // Same "lazy ref init" rationale as `useGridItemDrag.ts`'s own copy of
   // this pattern.
   const autoScrollRef = useRef<ReturnType<typeof createNativeAutoScroll> | null>(null);
-  if(!autoScrollRef.current) {
+  if(false) {
     autoScrollRef.current = createNativeAutoScroll();
   }

[Killed] ArrowFunction
components/Grid/hooks/useGridItemResize.ts:134:88
   const nwRef = useRef<HTMLSpanElement>(null);
   const seRef = useRef<HTMLSpanElement>(null);
   const swRef = useRef<HTMLSpanElement>(null);
-  const handleRefs = useMemo<Record<TResizeHandle, RefObject<HTMLSpanElement | null>>>(() => ({
-    e: eRef,
-    n: nRef,
-    ne: neRef,
-    nw: nwRef,
-    s: sRef,
-    se: seRef,
-    sw: swRef,
-    w: wRef,
-    // eslint-disable-next-line react-hooks/exhaustive-deps
-  }), []);
+  const handleRefs = useMemo<Record<TResizeHandle, RefObject<HTMLSpanElement | null>>>(() => undefined, []);
 
   const calcPosition = useCallback((x: number, y: number, w: number, h: number): IGridItemPosition => {
killedBy: GridLayout horizontalShift Should push the collided-with item straight down by default (horizontalShift off)
statusReason: Cannot read properties of undefined (reading 'n')

[Killed] ObjectLiteral
components/Grid/hooks/useGridItemResize.ts:134:95
   const nwRef = useRef<HTMLSpanElement>(null);
   const seRef = useRef<HTMLSpanElement>(null);
   const swRef = useRef<HTMLSpanElement>(null);
-  const handleRefs = useMemo<Record<TResizeHandle, RefObject<HTMLSpanElement | null>>>(() => ({
-    e: eRef,
-    n: nRef,
-    ne: neRef,
-    nw: nwRef,
-    s: sRef,
-    se: seRef,
-    sw: swRef,
-    w: wRef,
-    // eslint-disable-next-line react-hooks/exhaustive-deps
-  }), []);
+  const handleRefs = useMemo<Record<TResizeHandle, RefObject<HTMLSpanElement | null>>>(() => ({}), []);
 
   const calcPosition = useCallback((x: number, y: number, w: number, h: number): IGridItemPosition => {
killedBy: GridLayout horizontalShift Should push the collided-with item straight down by default (horizontalShift off)
statusReason: Cannot read properties of undefined (reading 'current')

[Killed] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:150:52
     const { containerWidth, margin, cols, rowHeight, isMirrored } = optionsRef.current;
     const colWidth = calcColWidth(containerWidth, margin[0], cols);
-    const height = h === Infinity ? h : Math.round(rowHeight * h + Math.max(0, h - 1) * margin[1]);
+    const height = h === Infinity ? h : Math.round(rowHeight / h + Math.max(0, h - 1) * margin[1]);
     /* v8 ignore next -- same Infinity/cloneLayout limitation as `height` above — not adjacent to it, so needs its own ignore comment rather than one "next N" covering both. */
     const width = w === Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
killedBy: GridItem resizing Should move the item's own y when resizing from the top edge
statusReason: expected 2 to be greater than 4

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:150:20
     const { containerWidth, margin, cols, rowHeight, isMirrored } = optionsRef.current;
     const colWidth = calcColWidth(containerWidth, margin[0], cols);
-    const height = h === Infinity ? h : Math.round(rowHeight * h + Math.max(0, h - 1) * margin[1]);
+    const height = true ? h : Math.round(rowHeight * h + Math.max(0, h - 1) * margin[1]);
     /* v8 ignore next -- same Infinity/cloneLayout limitation as `height` above — not adjacent to it, so needs its own ignore comment rather than one "next N" covering both. */
     const width = w === Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
killedBy: GridLayout preserveAspectRatio Should derive height from width when only a horizontal edge drives the resize
statusReason: expected 1 to be greater than 2

[Killed] EqualityOperator
components/Grid/hooks/useGridItemResize.ts:152:19
     const height = h === Infinity ? h : Math.round(rowHeight * h + Math.max(0, h - 1) * margin[1]);
     /* v8 ignore next -- same Infinity/cloneLayout limitation as `height` above — not adjacent to it, so needs its own ignore comment rather than one "next N" covering both. */
-    const width = w === Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
+    const width = w !== Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
     const top = Math.round(rowHeight * y + (y + 1) * margin[1]);
     const horizontal = Math.round(colWidth * x + (x + 1) * margin[0]);
killedBy: GridLayout multiSelect group resize Should resize every other selected item by the same delta as the resized anchor
statusReason: expected 0 to be greater than 0

[Killed] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:152:51
     const height = h === Infinity ? h : Math.round(rowHeight * h + Math.max(0, h - 1) * margin[1]);
     /* v8 ignore next -- same Infinity/cloneLayout limitation as `height` above — not adjacent to it, so needs its own ignore comment rather than one "next N" covering both. */
-    const width = w === Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
+    const width = w === Infinity ? w : Math.round(colWidth / w + Math.max(0, w - 1) * margin[0]);
     const top = Math.round(rowHeight * y + (y + 1) * margin[1]);
     const horizontal = Math.round(colWidth * x + (x + 1) * margin[0]);
killedBy: GridLayout preserveAspectRatio Should derive width from height when only a vertical edge drives the resize
statusReason: expected 1 to be greater than 2

[Killed] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:153:28
     const height = h === Infinity ? h : Math.round(rowHeight * h + Math.max(0, h - 1) * margin[1]);
     /* v8 ignore next -- same Infinity/cloneLayout limitation as `height` above — not adjacent to it, so needs its own ignore comment rather than one "next N" covering both. */
     const width = w === Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
-    const top = Math.round(rowHeight * y + (y + 1) * margin[1]);
+    const top = Math.round(rowHeight / y + (y + 1) * margin[1]);
     const horizontal = Math.round(colWidth * x + (x + 1) * margin[0]);
     return isMirrored
killedBy: GridItem Should position itself via a CSS transform by default (useCssTransforms)
statusReason: expected '' to contain 'translate3d'

[Timeout] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:153:44
     const height = h === Infinity ? h : Math.round(rowHeight * h + Math.max(0, h - 1) * margin[1]);
     /* v8 ignore next -- same Infinity/cloneLayout limitation as `height` above — not adjacent to it, so needs its own ignore comment rather than one "next N" covering both. */
     const width = w === Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
-    const top = Math.round(rowHeight * y + (y + 1) * margin[1]);
+    const top = Math.round(rowHeight * y + (y + 1) / margin[1]);
     const horizontal = Math.round(colWidth * x + (x + 1) * margin[0]);
     return isMirrored

[Killed] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:154:35
     /* v8 ignore next -- same Infinity/cloneLayout limitation as `height` above — not adjacent to it, so needs its own ignore comment rather than one "next N" covering both. */
     const width = w === Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
     const top = Math.round(rowHeight * y + (y + 1) * margin[1]);
-    const horizontal = Math.round(colWidth * x + (x + 1) * margin[0]);
+    const horizontal = Math.round(colWidth * x - (x + 1) * margin[0]);
     return isMirrored
       ? { height, right: horizontal, top, width }
killedBy: GridLayout isMirrored (RTL) Should move the anchor under RTL when resizing from the "right" edge specifically
statusReason: expected 4 not to be 4 // Object.is equality

[Killed] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:154:35
     /* v8 ignore next -- same Infinity/cloneLayout limitation as `height` above — not adjacent to it, so needs its own ignore comment rather than one "next N" covering both. */
     const width = w === Infinity ? w : Math.round(colWidth * w + Math.max(0, w - 1) * margin[0]);
     const top = Math.round(rowHeight * y + (y + 1) * margin[1]);
-    const horizontal = Math.round(colWidth * x + (x + 1) * margin[0]);
+    const horizontal = Math.round(colWidth / x + (x + 1) * margin[0]);
     return isMirrored
       ? { height, right: horizontal, top, width }
killedBy: GridLayout isMirrored (RTL) Should position via CSS right (not left) when isMirrored is on
statusReason: expected '' to contain 'translate3d'

[Killed] ObjectLiteral
components/Grid/hooks/useGridItemResize.ts:156:9
     const top = Math.round(rowHeight * y + (y + 1) * margin[1]);
     const horizontal = Math.round(colWidth * x + (x + 1) * margin[0]);
     return isMirrored
-      ? { height, right: horizontal, top, width }
+      ? {}
       : { height, left: horizontal, top, width };
   }, []);
killedBy: GridLayout isMirrored (RTL) Should position via CSS right (not left) when isMirrored is on
statusReason: expected '' to contain 'translate3d'

[Timeout] ArrayDeclaration
components/Grid/hooks/useGridItemResize.ts:158:6
     return isMirrored
       ? { height, right: horizontal, top, width }
       : { height, left: horizontal, top, width };
-  }, []);
+  }, ["Stryker was here"]);
 
   const calcWH = useCallback((height: number, width: number, autoSizeFlag: boolean = false): ICalcWh => {

[Killed] BlockStatement
components/Grid/hooks/useGridItemResize.ts:160:105
       : { height, left: horizontal, top, width };
   }, []);
 
-  const calcWH = useCallback((height: number, width: number, autoSizeFlag: boolean = false): ICalcWh => {
-    const { containerWidth, margin, cols, rowHeight, innerX, innerY, maxRows } = optionsRef.current;
-    const colWidth = calcColWidth(containerWidth, margin[0], cols);
-    let w = Math.round((width + margin[0]) / (colWidth + margin[0]));
-    // `autoHeight`'s own `autoSize()` (Phase 19) passes `autoSizeFlag`,
-    // rounding height *up* instead of to the nearest unit — matching
-    // Vue's own `calcWH` exactly, so a content element that's grown
-    // slightly taller than an exact row-height multiple lands on the
-    // next full row rather than getting rounded down and clipped. Width
-    // is unaffected either way (this prop is about height specifically).
-    const h = autoSizeFlag
-      ? Math.ceil((height + margin[1]) / (rowHeight + margin[1]))
-      : Math.round((height + margin[1]) / (rowHeight + margin[1]));
-    w = Math.max(Math.min(w, cols - innerX), 0);
-    const clampedH = Math.max(Math.min(h, maxRows - innerY), 0);
-    return { h: clampedH, w };
-  }, []);
+  const calcWH = useCallback((height: number, width: number, autoSizeFlag: boolean = false): ICalcWh => {}, []);
 
   const pixelsToGridX = useCallback((leftPx: number, newW: number): number => {
killedBy: GridLayout isMirrored (RTL) Should swap which edge anchors a resize under RTL — dragging the "left" edge doesn't move x, dragging "right" does
statusReason: Cannot read properties of undefined (reading 'w')

[Survived] BooleanLiteral
components/Grid/hooks/useGridItemResize.ts:160:86
       : { height, left: horizontal, top, width };
   }, []);
 
-  const calcWH = useCallback((height: number, width: number, autoSizeFlag: boolean = false): ICalcWh => {
+  const calcWH = useCallback((height: number, width: number, autoSizeFlag: boolean = true): ICalcWh => {
     const { containerWidth, margin, cols, rowHeight, innerX, innerY, maxRows } = optionsRef.current;
     const colWidth = calcColWidth(containerWidth, margin[0], cols);

[Killed] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:163:24
   const calcWH = useCallback((height: number, width: number, autoSizeFlag: boolean = false): ICalcWh => {
     const { containerWidth, margin, cols, rowHeight, innerX, innerY, maxRows } = optionsRef.current;
     const colWidth = calcColWidth(containerWidth, margin[0], cols);
-    let w = Math.round((width + margin[0]) / (colWidth + margin[0]));
+    let w = Math.round((width + margin[0]) * (colWidth + margin[0]));
     // `autoHeight`'s own `autoSize()` (Phase 19) passes `autoSizeFlag`,
     // rounding height *up* instead of to the nearest unit — matching
killedBy: GridLayout isMirrored (RTL) Should move the anchor under RTL when resizing from the "right" edge specifically
statusReason: expected 4 not to be 4 // Object.is equality

[Killed] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:163:47
   const calcWH = useCallback((height: number, width: number, autoSizeFlag: boolean = false): ICalcWh => {
     const { containerWidth, margin, cols, rowHeight, innerX, innerY, maxRows } = optionsRef.current;
     const colWidth = calcColWidth(containerWidth, margin[0], cols);
-    let w = Math.round((width + margin[0]) / (colWidth + margin[0]));
+    let w = Math.round((width + margin[0]) / (colWidth - margin[0]));
     // `autoHeight`'s own `autoSize()` (Phase 19) passes `autoSizeFlag`,
     // rounding height *up* instead of to the nearest unit — matching
killedBy: GridItem autoHeight Should commit a resizeend-style height change when the wrapper's content grows, rounding height *up* (not to the nearest unit)
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:171:19
     // next full row rather than getting rounded down and clipped. Width
     // is unaffected either way (this prop is about height specifically).
     const h = autoSizeFlag
-      ? Math.ceil((height + margin[1]) / (rowHeight + margin[1]))
+      ? Math.ceil((height + margin[1]) * (rowHeight + margin[1]))
       : Math.round((height + margin[1]) / (rowHeight + margin[1]));
     w = Math.max(Math.min(w, cols - innerX), 0);
killedBy: GridItem autoHeight Should commit a resizeend-style height change when the wrapper's content grows, rounding height *up* (not to the nearest unit)
statusReason: expected 28600 to be 3 // Object.is equality

[Killed] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:171:43
     // next full row rather than getting rounded down and clipped. Width
     // is unaffected either way (this prop is about height specifically).
     const h = autoSizeFlag
-      ? Math.ceil((height + margin[1]) / (rowHeight + margin[1]))
+      ? Math.ceil((height + margin[1]) / (rowHeight - margin[1]))
       : Math.round((height + margin[1]) / (rowHeight + margin[1]));
     w = Math.max(Math.min(w, cols - innerX), 0);
killedBy: GridItem autoHeight Should not commit anything when the measured size converts to the same grid units the item already has
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [

[Killed] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:172:20
     // is unaffected either way (this prop is about height specifically).
     const h = autoSizeFlag
       ? Math.ceil((height + margin[1]) / (rowHeight + margin[1]))
-      : Math.round((height + margin[1]) / (rowHeight + margin[1]));
+      : Math.round((height + margin[1]) * (rowHeight + margin[1]));
     w = Math.max(Math.min(w, cols - innerX), 0);
     const clampedH = Math.max(Math.min(h, maxRows - innerY), 0);
killedBy: GridLayout preserveAspectRatio Should not derive height at all when preserveAspectRatio is off (the default) — sanity check
statusReason: expected 24200 to be 2 // Object.is equality

[Survived] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:172:44
     // is unaffected either way (this prop is about height specifically).
     const h = autoSizeFlag
       ? Math.ceil((height + margin[1]) / (rowHeight + margin[1]))
-      : Math.round((height + margin[1]) / (rowHeight + margin[1]));
+      : Math.round((height + margin[1]) / (rowHeight - margin[1]));
     w = Math.max(Math.min(w, cols - innerX), 0);
     const clampedH = Math.max(Math.min(h, maxRows - innerY), 0);

[Killed] MethodExpression
components/Grid/hooks/useGridItemResize.ts:173:9
     const h = autoSizeFlag
       ? Math.ceil((height + margin[1]) / (rowHeight + margin[1]))
       : Math.round((height + margin[1]) / (rowHeight + margin[1]));
-    w = Math.max(Math.min(w, cols - innerX), 0);
+    w = Math.min(Math.min(w, cols - innerX), 0);
     const clampedH = Math.max(Math.min(h, maxRows - innerY), 0);
     return { h: clampedH, w };
killedBy: GridLayout Should clamp the resized size when preventCollision is on and it would collide
statusReason: expected 1 to be 4 // Object.is equality

[Killed] MethodExpression
components/Grid/hooks/useGridItemResize.ts:173:18
     const h = autoSizeFlag
       ? Math.ceil((height + margin[1]) / (rowHeight + margin[1]))
       : Math.round((height + margin[1]) / (rowHeight + margin[1]));
-    w = Math.max(Math.min(w, cols - innerX), 0);
+    w = Math.max(Math.max(w, cols - innerX), 0);
     const clampedH = Math.max(Math.min(h, maxRows - innerY), 0);
     return { h: clampedH, w };
killedBy: GridLayout transformScale Should scale resize deltas the same way
statusReason: expected 20 to be 7 // Object.is equality

[Killed] MethodExpression
components/Grid/hooks/useGridItemResize.ts:174:31
       ? Math.ceil((height + margin[1]) / (rowHeight + margin[1]))
       : Math.round((height + margin[1]) / (rowHeight + margin[1]));
     w = Math.max(Math.min(w, cols - innerX), 0);
-    const clampedH = Math.max(Math.min(h, maxRows - innerY), 0);
+    const clampedH = Math.max(Math.max(h, maxRows - innerY), 0);
     return { h: clampedH, w };
   }, []);
killedBy: GridItem autoHeight Should commit a resizeend-style height change when the wrapper's content grows, rounding height *up* (not to the nearest unit)
statusReason: expected Infinity to be 3 // Object.is equality

[Killed] MethodExpression
components/Grid/hooks/useGridItemResize.ts:174:22
       ? Math.ceil((height + margin[1]) / (rowHeight + margin[1]))
       : Math.round((height + margin[1]) / (rowHeight + margin[1]));
     w = Math.max(Math.min(w, cols - innerX), 0);
-    const clampedH = Math.max(Math.min(h, maxRows - innerY), 0);
+    const clampedH = Math.min(Math.min(h, maxRows - innerY), 0);
     return { h: clampedH, w };
   }, []);
killedBy: GridLayout Should clamp the resized height when preventCollision is on and it would collide vertically
statusReason: expected 1 to be 4 // Object.is equality

[Killed] BlockStatement
components/Grid/hooks/useGridItemResize.ts:178:79
     return { h: clampedH, w };
   }, []);
 
-  const pixelsToGridX = useCallback((leftPx: number, newW: number): number => {
-    const { containerWidth, margin, cols } = optionsRef.current;
-    const colWidth = calcColWidth(containerWidth, margin[0], cols);
-    let gridX = Math.round((leftPx - margin[0]) / (colWidth + margin[0]));
-    gridX = Math.max(Math.min(gridX, cols - newW), 0);
-    return gridX;
-  }, []);
+  const pixelsToGridX = useCallback((leftPx: number, newW: number): number => {}, []);
 
   const pixelsToGridY = useCallback((topPx: number, newH: number): number => {
killedBy: GridItem resizing Should move the item's own x when resizing from the left edge
statusReason: expected NaN to be greater than 2

[Killed] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:181:52
   const pixelsToGridX = useCallback((leftPx: number, newW: number): number => {
     const { containerWidth, margin, cols } = optionsRef.current;
     const colWidth = calcColWidth(containerWidth, margin[0], cols);
-    let gridX = Math.round((leftPx - margin[0]) / (colWidth + margin[0]));
+    let gridX = Math.round((leftPx - margin[0]) / (colWidth - margin[0]));
     gridX = Math.max(Math.min(gridX, cols - newW), 0);
     return gridX;
killedBy: GridItem resizing Should move the item's own x when resizing from the left edge
statusReason: expected 4 to be less than 4

[Survived] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:181:28
   const pixelsToGridX = useCallback((leftPx: number, newW: number): number => {
     const { containerWidth, margin, cols } = optionsRef.current;
     const colWidth = calcColWidth(containerWidth, margin[0], cols);
-    let gridX = Math.round((leftPx - margin[0]) / (colWidth + margin[0]));
+    let gridX = Math.round((leftPx - margin[0]) * (colWidth + margin[0]));
     gridX = Math.max(Math.min(gridX, cols - newW), 0);
     return gridX;

[Killed] MethodExpression
components/Grid/hooks/useGridItemResize.ts:182:22
     const { containerWidth, margin, cols } = optionsRef.current;
     const colWidth = calcColWidth(containerWidth, margin[0], cols);
     let gridX = Math.round((leftPx - margin[0]) / (colWidth + margin[0]));
-    gridX = Math.max(Math.min(gridX, cols - newW), 0);
+    gridX = Math.max(Math.max(gridX, cols - newW), 0);
     return gridX;
   }, []);
killedBy: GridItem resizing Should move the item's own x when resizing from the left edge
statusReason: expected 4 to be less than 4

[Survived] MethodExpression
components/Grid/hooks/useGridItemResize.ts:182:13
     const { containerWidth, margin, cols } = optionsRef.current;
     const colWidth = calcColWidth(containerWidth, margin[0], cols);
     let gridX = Math.round((leftPx - margin[0]) / (colWidth + margin[0]));
-    gridX = Math.max(Math.min(gridX, cols - newW), 0);
+    gridX = Math.min(Math.min(gridX, cols - newW), 0);
     return gridX;
   }, []);

[Timeout] ArrayDeclaration
components/Grid/hooks/useGridItemResize.ts:184:6
     let gridX = Math.round((leftPx - margin[0]) / (colWidth + margin[0]));
     gridX = Math.max(Math.min(gridX, cols - newW), 0);
     return gridX;
-  }, []);
+  }, ["Stryker was here"]);
 
   const pixelsToGridY = useCallback((topPx: number, newH: number): number => {

[Survived] BlockStatement
components/Grid/hooks/useGridItemResize.ts:186:78
     return gridX;
   }, []);
 
-  const pixelsToGridY = useCallback((topPx: number, newH: number): number => {
-    const { margin, rowHeight, maxRows } = optionsRef.current;
-    let gridY = Math.round((topPx - margin[1]) / (rowHeight + margin[1]));
-    gridY = Math.max(Math.min(gridY, maxRows - newH), 0);
-    return gridY;
-  }, []);
+  const pixelsToGridY = useCallback((topPx: number, newH: number): number => {}, []);
 
   /**

[Survived] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:188:28
 
   const pixelsToGridY = useCallback((topPx: number, newH: number): number => {
     const { margin, rowHeight, maxRows } = optionsRef.current;
-    let gridY = Math.round((topPx - margin[1]) / (rowHeight + margin[1]));
+    let gridY = Math.round((topPx - margin[1]) * (rowHeight + margin[1]));
     gridY = Math.max(Math.min(gridY, maxRows - newH), 0);
     return gridY;

[Survived] ArithmeticOperator
components/Grid/hooks/useGridItemResize.ts:188:29
 
   const pixelsToGridY = useCallback((topPx: number, newH: number): number => {
     const { margin, rowHeight, maxRows } = optionsRef.current;
-    let gridY = Math.round((topPx - margin[1]) / (rowHeight + margin[1]));
+    let gridY = Math.round((topPx + margin[1]) / (rowHeight + margin[1]));
     gridY = Math.max(Math.min(gridY, maxRows - newH), 0);
     return gridY;

[Survived] MethodExpression
components/Grid/hooks/useGridItemResize.ts:189:13
   const pixelsToGridY = useCallback((topPx: number, newH: number): number => {
     const { margin, rowHeight, maxRows } = optionsRef.current;
     let gridY = Math.round((topPx - margin[1]) / (rowHeight + margin[1]));
-    gridY = Math.max(Math.min(gridY, maxRows - newH), 0);
+    gridY = Math.min(Math.min(gridY, maxRows - newH), 0);
     return gridY;
   }, []);

[Survived] MethodExpression
components/Grid/hooks/useGridItemResize.ts:189:22
   const pixelsToGridY = useCallback((topPx: number, newH: number): number => {
     const { margin, rowHeight, maxRows } = optionsRef.current;
     let gridY = Math.round((topPx - margin[1]) / (rowHeight + margin[1]));
-    gridY = Math.max(Math.min(gridY, maxRows - newH), 0);
+    gridY = Math.max(Math.max(gridY, maxRows - newH), 0);
     return gridY;
   }, []);

[Timeout] ArrayDeclaration
components/Grid/hooks/useGridItemResize.ts:191:6
     let gridY = Math.round((topPx - margin[1]) / (rowHeight + margin[1]));
     gridY = Math.max(Math.min(gridY, maxRows - newH), 0);
     return gridY;
-  }, []);
+  }, ["Stryker was here"]);
 
   /**

[Killed] BooleanLiteral
components/Grid/hooks/useGridItemResize.ts:213:54
   const autoSize = useCallback((wrapperElement: HTMLElement): void => {
     const { i, innerX, innerY, minW, maxW, minH, maxH, onResize, w: currentW, h: currentH } = optionsRef.current;
     const rect = wrapperElement.getBoundingClientRect();
-    const measured = calcWH(rect.height, rect.width, true);
+    const measured = calcWH(rect.height, rect.width, false);
     let newW = measured.w;
     let newH = measured.h;
killedBy: GridItem autoHeight Should commit a resizeend-style height change when the wrapper's content grows, rounding height *up* (not to the nearest unit)
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
components/Grid/hooks/useGridItemResize.ts:216:8
     const measured = calcWH(rect.height, rect.width, true);
     let newW = measured.w;
     let newH = measured.h;
-    if(newW < minW) {
+    if(newW >= minW) {
       newW = minW;
     }
killedBy: GridItem autoHeight Should commit a resizeend-style height change when the wrapper's content grows, rounding height *up* (not to the nearest unit)
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:216:8
     const measured = calcWH(rect.height, rect.width, true);
     let newW = measured.w;
     let newH = measured.h;
-    if(newW < minW) {
+    if(false) {
       newW = minW;
     }
killedBy: GridItem autoHeight Should clamp up to minW when the measured width converts to less than it
statusReason: expected 1 to be 5 // Object.is equality

[Killed] EqualityOperator
components/Grid/hooks/useGridItemResize.ts:219:8
     if(newW < minW) {
       newW = minW;
     }
-    if(newW > maxW) {
+    if(newW <= maxW) {
       newW = maxW;
     }
killedBy: GridItem autoHeight Should commit a resizeend-style height change when the wrapper's content grows, rounding height *up* (not to the nearest unit)
statusReason: expected Infinity to be 2 // Object.is equality

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:219:8
     if(newW < minW) {
       newW = minW;
     }
-    if(newW > maxW) {
+    if(false) {
       newW = maxW;
     }
killedBy: GridItem autoHeight Should clamp down to maxW when the measured width converts to more than it
statusReason: expected 10 to be 3 // Object.is equality

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:222:8
     if(newW > maxW) {
       newW = maxW;
     }
-    if(newH < minH) {
+    if(true) {
       newH = minH;
     }
killedBy: GridItem autoHeight Should commit a resizeend-style height change when the wrapper's content grows, rounding height *up* (not to the nearest unit)
statusReason: expected 1 to be 3 // Object.is equality

[Killed] EqualityOperator
components/Grid/hooks/useGridItemResize.ts:222:8
     if(newW > maxW) {
       newW = maxW;
     }
-    if(newH < minH) {
+    if(newH >= minH) {
       newH = minH;
     }
killedBy: GridItem autoHeight Should commit a resizeend-style height change when the wrapper's content grows, rounding height *up* (not to the nearest unit)
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
components/Grid/hooks/useGridItemResize.ts:225:8
     if(newH < minH) {
       newH = minH;
     }
-    if(newH > maxH) {
+    if(false) {
       newH = maxH;
     }
killedBy: GridItem autoHeight Should clamp the auto-measured height/width to minH/maxH/minW/maxW
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [
