[Killed] BooleanLiteral
components/Grid/hooks/useCrossGridDrag.ts:86:8
   const draggedIdRef = useRef<string | number | null>(null);
 
   useEffect(() => {
-    if(!options.allowCrossGridDrag) {
+    if(options.allowCrossGridDrag) {
       return undefined;
     }
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] ConditionalExpression
components/Grid/hooks/useCrossGridDrag.ts:86:8
   const draggedIdRef = useRef<string | number | null>(null);
 
   useEffect(() => {
-    if(!options.allowCrossGridDrag) {
+    if(true) {
       return undefined;
     }
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] BlockStatement
components/Grid/hooks/useCrossGridDrag.ts:90:45
       return undefined;
     }
     const zone: ICrossGridZone = {
-      acceptDrop: (item, sourceLayoutId) => {
-        optionsRef.current.onAcceptExternalItem(item);
-        optionsRef.current.onCrossGridItemDropped?.({ item, sourceLayoutId });
-      },
+      acceptDrop: (item, sourceLayoutId) => {},
       getRect: () => optionsRef.current.containerRef.current?.getBoundingClientRect() ?? null,
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: Cannot read properties of undefined (reading '0')

[Survived] OptionalChaining
components/Grid/hooks/useCrossGridDrag.ts:92:9
     const zone: ICrossGridZone = {
       acceptDrop: (item, sourceLayoutId) => {
         optionsRef.current.onAcceptExternalItem(item);
-        optionsRef.current.onCrossGridItemDropped?.({ item, sourceLayoutId });
+        optionsRef.current.onCrossGridItemDropped({
+  item,
+  sourceLayoutId
+});
       },

[Killed] LogicalOperator
components/Grid/hooks/useCrossGridDrag.ts:95:22
         optionsRef.current.onCrossGridItemDropped?.({ item, sourceLayoutId });
       },
-      getRect: () => optionsRef.current.containerRef.current?.getBoundingClientRect() ?? null,
+      getRect: () => optionsRef.current.containerRef.current?.getBoundingClientRect() && null,
       isExternalDropDisabled: () => optionsRef.current.disableExternalDrop,
       layoutId: options.layoutId,
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] ArrowFunction
components/Grid/hooks/useCrossGridDrag.ts:95:16
         optionsRef.current.onCrossGridItemDropped?.({ item, sourceLayoutId });
       },
-      getRect: () => optionsRef.current.containerRef.current?.getBoundingClientRect() ?? null,
+      getRect: () => undefined,
       isExternalDropDisabled: () => optionsRef.current.disableExternalDrop,
       layoutId: options.layoutId,
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] ArrowFunction
components/Grid/hooks/useCrossGridDrag.ts:96:31
       },
       getRect: () => optionsRef.current.containerRef.current?.getBoundingClientRect() ?? null,
-      isExternalDropDisabled: () => optionsRef.current.disableExternalDrop,
+      isExternalDropDisabled: () => undefined,
       layoutId: options.layoutId,
       rejectDrop: (itemId, sourceLayoutId) => {
killedBy: GridLayout allowCrossGridDrag Should reject the drop and leave the source item exactly where it was when the target has disableExternalDrop
statusReason: GridItem: no layout entry found for i="shared-item".

[Killed] BlockStatement
components/Grid/hooks/useCrossGridDrag.ts:98:47
       getRect: () => optionsRef.current.containerRef.current?.getBoundingClientRect() ?? null,
       isExternalDropDisabled: () => optionsRef.current.disableExternalDrop,
       layoutId: options.layoutId,
-      rejectDrop: (itemId, sourceLayoutId) => {
-        optionsRef.current.onCrossGridDropRejected?.({ itemId, sourceLayoutId });
-      },
+      rejectDrop: (itemId, sourceLayoutId) => {},
     };
     return registerCrossGridZone(zone);
killedBy: GridLayout allowCrossGridDrag Should reject the drop and leave the source item exactly where it was when the target has disableExternalDrop
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] OptionalChaining
components/Grid/hooks/useCrossGridDrag.ts:99:9
       isExternalDropDisabled: () => optionsRef.current.disableExternalDrop,
       layoutId: options.layoutId,
       rejectDrop: (itemId, sourceLayoutId) => {
-        optionsRef.current.onCrossGridDropRejected?.({ itemId, sourceLayoutId });
+        optionsRef.current.onCrossGridDropRejected({
+  itemId,
+  sourceLayoutId
+});
       },
     };

[Killed] BlockStatement
components/Grid/hooks/useCrossGridDrag.ts:105:70
     return registerCrossGridZone(zone);
   }, [options.allowCrossGridDrag, options.layoutId]);
 
-  const handleDragStart = useCallback((id: string | number): void => {
-    if(optionsRef.current.allowCrossGridDrag) {
-      draggedIdRef.current = id;
-    }
-  }, []);
+  const handleDragStart = useCallback((id: string | number): void => {}, []);
 
   const handleDragEnd = useCallback((
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] BlockStatement
components/Grid/hooks/useCrossGridDrag.ts:106:47
   }, [options.allowCrossGridDrag, options.layoutId]);
 
   const handleDragStart = useCallback((id: string | number): void => {
-    if(optionsRef.current.allowCrossGridDrag) {
-      draggedIdRef.current = id;
-    }
+    if(optionsRef.current.allowCrossGridDrag) {}
   }, []);
 
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] ConditionalExpression
components/Grid/hooks/useCrossGridDrag.ts:106:8
   }, [options.allowCrossGridDrag, options.layoutId]);
 
   const handleDragStart = useCallback((id: string | number): void => {
-    if(optionsRef.current.allowCrossGridDrag) {
+    if(false) {
       draggedIdRef.current = id;
     }
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] BlockStatement
components/Grid/hooks/useCrossGridDrag.ts:117:81
     clientY: number | undefined,
     currentItem: ILayoutItem,
   ): boolean => {
-    if(!optionsRef.current.allowCrossGridDrag || draggedIdRef.current === null) {
-      return false;
-    }
+    if(!optionsRef.current.allowCrossGridDrag || draggedIdRef.current === null) {}
 
     const targetZone = findCrossGridZoneAt(clientX ?? Number.NaN, clientY ?? Number.NaN, optionsRef.current.layoutId);
killedBy: GridLayout allowCrossGridDrag Should not attempt any cross-grid lookup at all when allowCrossGridDrag is off (the default)
statusReason: GridItem: no layout entry found for i="0".

[Killed] ConditionalExpression
components/Grid/hooks/useCrossGridDrag.ts:117:8
     clientY: number | undefined,
     currentItem: ILayoutItem,
   ): boolean => {
-    if(!optionsRef.current.allowCrossGridDrag || draggedIdRef.current === null) {
+    if(true) {
       return false;
     }
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] BooleanLiteral
components/Grid/hooks/useCrossGridDrag.ts:118:14
     currentItem: ILayoutItem,
   ): boolean => {
     if(!optionsRef.current.allowCrossGridDrag || draggedIdRef.current === null) {
-      return false;
+      return true;
     }
 
killedBy: GridLayout multiSelect group move Should move every other selected item by the same delta as the dragged anchor
statusReason: GridItem: no layout entry found for i="0".

[Killed] LogicalOperator
components/Grid/hooks/useCrossGridDrag.ts:121:67
       return false;
     }
 
-    const targetZone = findCrossGridZoneAt(clientX ?? Number.NaN, clientY ?? Number.NaN, optionsRef.current.layoutId);
+    const targetZone = findCrossGridZoneAt(clientX ?? Number.NaN, clientY && Number.NaN, optionsRef.current.layoutId);
     draggedIdRef.current = null;
 
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] LogicalOperator
components/Grid/hooks/useCrossGridDrag.ts:121:44
       return false;
     }
 
-    const targetZone = findCrossGridZoneAt(clientX ?? Number.NaN, clientY ?? Number.NaN, optionsRef.current.layoutId);
+    const targetZone = findCrossGridZoneAt(clientX && Number.NaN, clientY ?? Number.NaN, optionsRef.current.layoutId);
     draggedIdRef.current = null;
 
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Killed] BlockStatement
components/Grid/hooks/useCrossGridDrag.ts:124:21
     const targetZone = findCrossGridZoneAt(clientX ?? Number.NaN, clientY ?? Number.NaN, optionsRef.current.layoutId);
     draggedIdRef.current = null;
 
-    if(!targetZone) {
-      return false;
-    }
+    if(!targetZone) {}
 
     if(targetZone.isExternalDropDisabled()) {
killedBy: GridLayout allowCrossGridDrag Should fall through to a normal in-grid move when dropped somewhere no other registered grid's rect covers
statusReason: Cannot read properties of undefined (reading 'isExternalDropDisabled')

[Killed] BlockStatement
components/Grid/hooks/useCrossGridDrag.ts:128:45
       return false;
     }
 
-    if(targetZone.isExternalDropDisabled()) {
-      // Rejected — emitted on the *target* grid (targetZone.rejectDrop
-      // does that), not this one. This grid's own item stays exactly
-      // where it was, as if the cross-grid attempt never happened: the
-      // caller falls through to its own normal end-of-drag handling.
-      targetZone.rejectDrop(id, optionsRef.current.layoutId);
-      return false;
-    }
+    if(targetZone.isExternalDropDisabled()) {}
 
     // Accepted — hand the current item data to the target grid. No
killedBy: GridLayout allowCrossGridDrag Should reject the drop and leave the source item exactly where it was when the target has disableExternalDrop
statusReason: GridItem: no layout entry found for i="shared-item".

[Killed] ConditionalExpression
components/Grid/hooks/useCrossGridDrag.ts:128:8
       return false;
     }
 
-    if(targetZone.isExternalDropDisabled()) {
+    if(false) {
       // Rejected — emitted on the *target* grid (targetZone.rejectDrop
       // does that), not this one. This grid's own item stays exactly
killedBy: GridLayout allowCrossGridDrag Should reject the drop and leave the source item exactly where it was when the target has disableExternalDrop
statusReason: GridItem: no layout entry found for i="shared-item".

[Killed] BooleanLiteral
components/Grid/hooks/useCrossGridDrag.ts:134:14
       // where it was, as if the cross-grid attempt never happened: the
       // caller falls through to its own normal end-of-drag handling.
       targetZone.rejectDrop(id, optionsRef.current.layoutId);
-      return false;
+      return true;
     }
 
killedBy: GridLayout allowCrossGridDrag Should reject the drop and leave the source item exactly where it was when the target has disableExternalDrop
statusReason: GridItem: no layout entry found for i="shared-item".

[Killed] ObjectLiteral
components/Grid/hooks/useCrossGridDrag.ts:142:27
     // the caller is responsible for removing the item from its own
     // layout and committing that, since this hook has no access to
     // `workingLayoutRef` itself.
-    targetZone.acceptDrop({ ...currentItem }, optionsRef.current.layoutId);
+    targetZone.acceptDrop({}, optionsRef.current.layoutId);
     return true;
   }, []);
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected undefined to be truthy

[Killed] BooleanLiteral
components/Grid/hooks/useCrossGridDrag.ts:143:12
     // layout and committing that, since this hook has no access to
     // `workingLayoutRef` itself.
     targetZone.acceptDrop({ ...currentItem }, optionsRef.current.layoutId);
-    return true;
+    return false;
   }, []);
 
killedBy: GridLayout allowCrossGridDrag Should move an item from the source grid to the target grid it's dropped onto
statusReason: expected { h: 2, i: 'shared-item', w: 2, …(3) } to be undefined

[Timeout] ArrayDeclaration
components/Grid/hooks/useCrossGridDrag.ts:144:6
     // `workingLayoutRef` itself.
     targetZone.acceptDrop({ ...currentItem }, optionsRef.current.layoutId);
     return true;
-  }, []);
+  }, ["Stryker was here"]);
 
   return { handleDragEnd, handleDragStart };
