[Killed] BooleanLiteral
src/hooks/useLayoutStorage.ts:122:31
  * @param options See {@link IUseLayoutStorageOptions}.
  */
 export function useLayoutStorage(key: string, options: IUseLayoutStorageOptions = {}): IUseLayoutStorageReturn {
-  const { storage, autoSave = false, layout, debounceMs = 500 } = options;
+  const { storage, autoSave = true, layout, debounceMs = 500 } = options;
 
   const resolveStorage = useCallback((): Storage | null => {
killedBy: useLayoutStorage autoSave Should not save at all when autoSave is off (the default), even with layout provided
statusReason: expected '[{"h":2,"i":"a","w":2,"x":0,"y":0}]' to be null

[Killed] BlockStatement
src/hooks/useLayoutStorage.ts:124:60
 export function useLayoutStorage(key: string, options: IUseLayoutStorageOptions = {}): IUseLayoutStorageReturn {
   const { storage, autoSave = false, layout, debounceMs = 500 } = options;
 
-  const resolveStorage = useCallback((): Storage | null => {
-    if(storage) {
-      return storage;
-    }
-    return hasWindow() ? window.localStorage : null;
-  }, [storage]);
+  const resolveStorage = useCallback((): Storage | null => {}, [storage]);
 
   const load = useCallback((): TLayout | null => {
killedBy: useLayoutStorage Should round-trip a layout through save() and load()
statusReason: expected null to strictly equal [ Array(1) ]

[Killed] ConditionalExpression
src/hooks/useLayoutStorage.ts:125:8
   const { storage, autoSave = false, layout, debounceMs = 500 } = options;
 
   const resolveStorage = useCallback((): Storage | null => {
-    if(storage) {
+    if(false) {
       return storage;
     }
killedBy: useLayoutStorage Should accept a custom storage backend via the storage option, independent of the default localStorage
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/hooks/useLayoutStorage.ts:125:8
   const { storage, autoSave = false, layout, debounceMs = 500 } = options;
 
   const resolveStorage = useCallback((): Storage | null => {
-    if(storage) {
+    if(true) {
       return storage;
     }
killedBy: useLayoutStorage Should round-trip a layout through save() and load()
statusReason: expected null to strictly equal [ Array(1) ]

[Survived] ArrayDeclaration
src/hooks/useLayoutStorage.ts:129:6
       return storage;
     }
     return hasWindow() ? window.localStorage : null;
-  }, [storage]);
+  }, []);
 
   const load = useCallback((): TLayout | null => {

[Killed] BlockStatement
src/hooks/useLayoutStorage.ts:131:50
     return hasWindow() ? window.localStorage : null;
   }, [storage]);
 
-  const load = useCallback((): TLayout | null => {
-    const target = resolveStorage();
-    if(!target) {
-      return null;
-    }
-    return deserializeLayout(target.getItem(key));
-  }, [resolveStorage, key]);
+  const load = useCallback((): TLayout | null => {}, [resolveStorage, key]);
 
   const save = useCallback((layoutToSave: TLayout): void => {
killedBy: useLayoutStorage Should return null from load() when nothing is stored yet
statusReason: expected undefined to be null

[Killed] BlockStatement
src/hooks/useLayoutStorage.ts:133:17
 
   const load = useCallback((): TLayout | null => {
     const target = resolveStorage();
-    if(!target) {
-      return null;
-    }
+    if(!target) {}
     return deserializeLayout(target.getItem(key));
   }, [resolveStorage, key]);
killedBy: useLayoutStorage Should return null from load() when localStorage doesn't exist at all (e.g. SSR)
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BlockStatement
src/hooks/useLayoutStorage.ts:139:61
     return deserializeLayout(target.getItem(key));
   }, [resolveStorage, key]);
 
-  const save = useCallback((layoutToSave: TLayout): void => {
-    const target = resolveStorage();
-    if(!target) {
-      return;
-    }
-    target.setItem(key, serializeLayout(layoutToSave));
-  }, [resolveStorage, key]);
+  const save = useCallback((layoutToSave: TLayout): void => {}, [resolveStorage, key]);
 
   const clear = useCallback((): void => {
killedBy: useLayoutStorage Should round-trip a layout through save() and load()
statusReason: expected null to strictly equal [ Array(1) ]

[Killed] BlockStatement
src/hooks/useLayoutStorage.ts:141:17
 
   const save = useCallback((layoutToSave: TLayout): void => {
     const target = resolveStorage();
-    if(!target) {
-      return;
-    }
+    if(!target) {}
     target.setItem(key, serializeLayout(layoutToSave));
   }, [resolveStorage, key]);
killedBy: useLayoutStorage Should no-op save() when localStorage doesn't exist at all (e.g. SSR)
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BlockStatement
src/hooks/useLayoutStorage.ts:147:41
     target.setItem(key, serializeLayout(layoutToSave));
   }, [resolveStorage, key]);
 
-  const clear = useCallback((): void => {
-    resolveStorage()?.removeItem(key);
-  }, [resolveStorage]);
+  const clear = useCallback((): void => {}, [resolveStorage]);
 
   const hasSaved = useCallback((): boolean => {
killedBy: useLayoutStorage Should remove the stored value via clear()
statusReason: expected [ Array(1) ] to be null

[Killed] OptionalChaining
src/hooks/useLayoutStorage.ts:148:5
   }, [resolveStorage, key]);
 
   const clear = useCallback((): void => {
-    resolveStorage()?.removeItem(key);
+    resolveStorage().removeItem(key);
   }, [resolveStorage]);
 
killedBy: useLayoutStorage Should no-op clear() when localStorage doesn't exist at all (e.g. SSR)
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BlockStatement
src/hooks/useLayoutStorage.ts:151:47
     resolveStorage()?.removeItem(key);
   }, [resolveStorage]);
 
-  const hasSaved = useCallback((): boolean => {
-    const target = resolveStorage();
-    // Deliberately `!target` (a general falsy check), not `target !==
-    // null` — confirmed gap via a fresh test run, not assumed:
-    // `resolveStorage()` can also return `undefined` specifically (not
-    // just `null`) when `localStorage` itself is stubbed/deleted while
-    // `window` still exists (e.g. `vi.stubGlobal('localStorage',
-    // undefined)` in a test, or a real environment that defines
-    // `window` but not `localStorage`) — a strict `!== null` check lets
-    // that case slip through and call `.getItem()` on `undefined`,
-    // throwing. Every other method here (`load`/`save`/`clear`) already
-    // uses this same general falsy check; this one just hadn't matched
-    // them.
-    if(!target) {
-      return false;
-    }
-    return target.getItem(key) !== null;
-  }, [resolveStorage, key]);
+  const hasSaved = useCallback((): boolean => {}, [resolveStorage, key]);
 
   // `autoSave` — debounced, matching the Vue package's own
killedBy: useLayoutStorage Should report hasSaved correctly
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLayoutStorage.ts:164:8
     // throwing. Every other method here (`load`/`save`/`clear`) already
     // uses this same general falsy check; this one just hadn't matched
     // them.
-    if(!target) {
+    if(true) {
       return false;
     }
killedBy: useLayoutStorage Should report hasSaved correctly
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useLayoutStorage.ts:164:17
     // throwing. Every other method here (`load`/`save`/`clear`) already
     // uses this same general falsy check; this one just hadn't matched
     // them.
-    if(!target) {
-      return false;
-    }
+    if(!target) {}
     return target.getItem(key) !== null;
   }, [resolveStorage, key]);
killedBy: useLayoutStorage Should report hasSaved as false when localStorage doesn't exist at all (e.g. SSR)
statusReason: Cannot read properties of undefined (reading 'getItem')

[Killed] ConditionalExpression
src/hooks/useLayoutStorage.ts:167:12
     if(!target) {
       return false;
     }
-    return target.getItem(key) !== null;
+    return false;
   }, [resolveStorage, key]);
 
killedBy: useLayoutStorage Should report hasSaved correctly
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/hooks/useLayoutStorage.ts:167:12
     if(!target) {
       return false;
     }
-    return target.getItem(key) !== null;
+    return target.getItem(key) === null;
   }, [resolveStorage, key]);
 
killedBy: useLayoutStorage Should report hasSaved correctly
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/hooks/useLayoutStorage.ts:185:19
   // dependencies ever change.
   const saveRef = useRef(save);
   saveRef.current = save;
-  useEffect(() => {
-    if(!autoSave || layout === undefined) {
-      return undefined;
-    }
-    const handle = setTimeout(() => {
-      saveRef.current(layout);
-    }, debounceMs);
-    return () => clearTimeout(handle);
-  }, [autoSave, layout, debounceMs]);
+  useEffect(() => {}, [autoSave, layout, debounceMs]);
 
   return useMemo(() => ({ clear, hasSaved, load, save }), [clear, hasSaved, load, save]);
killedBy: useLayoutStorage autoSave Should automatically save the given layout, debounced, when it changes
statusReason: expected null to strictly equal [ Array(1) ]

[Killed] BlockStatement
src/hooks/useLayoutStorage.ts:186:43
   const saveRef = useRef(save);
   saveRef.current = save;
   useEffect(() => {
-    if(!autoSave || layout === undefined) {
-      return undefined;
-    }
+    if(!autoSave || layout === undefined) {}
     const handle = setTimeout(() => {
       saveRef.current(layout);
killedBy: useLayoutStorage autoSave Should not save at all when autoSave is off (the default), even with layout provided
statusReason: expected '[{"h":2,"i":"a","w":2,"x":0,"y":0}]' to be null

[Killed] ConditionalExpression
src/hooks/useLayoutStorage.ts:186:8
   const saveRef = useRef(save);
   saveRef.current = save;
   useEffect(() => {
-    if(!autoSave || layout === undefined) {
+    if(false) {
       return undefined;
     }
killedBy: useLayoutStorage autoSave Should not save at all when autoSave is off (the default), even with layout provided
statusReason: expected '[{"h":2,"i":"a","w":2,"x":0,"y":0}]' to be null

[Killed] BlockStatement
src/hooks/useLayoutStorage.ts:189:37
     if(!autoSave || layout === undefined) {
       return undefined;
     }
-    const handle = setTimeout(() => {
-      saveRef.current(layout);
-    }, debounceMs);
+    const handle = setTimeout(() => {}, debounceMs);
     return () => clearTimeout(handle);
   }, [autoSave, layout, debounceMs]);
killedBy: useLayoutStorage autoSave Should automatically save the given layout, debounced, when it changes
statusReason: expected null to strictly equal [ Array(1) ]

[Survived] ArrowFunction
src/hooks/useLayoutStorage.ts:192:12
     const handle = setTimeout(() => {
       saveRef.current(layout);
     }, debounceMs);
-    return () => clearTimeout(handle);
+    return () => undefined;
   }, [autoSave, layout, debounceMs]);
 

[Killed] ArrowFunction
src/hooks/useLayoutStorage.ts:195:18
     return () => clearTimeout(handle);
   }, [autoSave, layout, debounceMs]);
 
-  return useMemo(() => ({ clear, hasSaved, load, save }), [clear, hasSaved, load, save]);
+  return useMemo(() => undefined, [clear, hasSaved, load, save]);
 }
 
killedBy: useLayoutStorage Should return null from load() when nothing is stored yet
statusReason: Cannot read properties of undefined (reading 'load')

[Killed] ObjectLiteral
src/hooks/useLayoutStorage.ts:195:25
     return () => clearTimeout(handle);
   }, [autoSave, layout, debounceMs]);
 
-  return useMemo(() => ({ clear, hasSaved, load, save }), [clear, hasSaved, load, save]);
+  return useMemo(() => ({}), [clear, hasSaved, load, save]);
 }
 
killedBy: useLayoutStorage Should return null from load() when nothing is stored yet
statusReason: result.current.load is not a function
