[Killed] BooleanLiteral
components/Grid/composables/useGridItemResize.ts:517:10
       // `resizeHandles` set (GridItem's own prop, or GridLayout's
       // default when it's null) — restricts which edges/corners the
       // native resize engine listens on, instead of always all 8.
-      if(!resizeHandles.value.includes(edgeKey)) {
+      if(resizeHandles.value.includes(edgeKey)) {
         continue;
       }
killedBy: GridItem ITEM_CLICKED (multiSelect support) Should suppress ITEM_CLICKED for the trailing click immediately after a resize ends too
statusReason: handler is not a function

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:517:10
       // `resizeHandles` set (GridItem's own prop, or GridLayout's
       // default when it's null) — restricts which edges/corners the
       // native resize engine listens on, instead of always all 8.
-      if(!resizeHandles.value.includes(edgeKey)) {
+      if(true) {
         continue;
       }
killedBy: GridItem ITEM_CLICKED (multiSelect support) Should suppress ITEM_CLICKED for the trailing click immediately after a resize ends too
statusReason: handler is not a function

[Survived] OptionalChaining
components/Grid/composables/useGridItemResize.ts:520:24
       if(!resizeHandles.value.includes(edgeKey)) {
         continue;
       }
-      const handleEl = resizeHandleRefs[edgeKey]?.value;
+      const handleEl = resizeHandleRefs[edgeKey].value;
       if(handleEl) {
         handleEls[edgeKey] = handleEl;

[Killed] BlockStatement
components/Grid/composables/useGridItemResize.ts:521:20
         continue;
       }
       const handleEl = resizeHandleRefs[edgeKey]?.value;
-      if(handleEl) {
-        handleEls[edgeKey] = handleEl;
-      }
+      if(handleEl) {}
     }
 
killedBy: useGridItemResize handleResize — resizestart Should set isResizing/resizing and emit RESIZE/eventBus resizeEvent on resizestart
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:521:10
         continue;
       }
       const handleEl = resizeHandleRefs[edgeKey]?.value;
-      if(handleEl) {
+      if(false) {
         handleEls[edgeKey] = handleEl;
       }
killedBy: useGridItemResize handleResize — resizestart Should set isResizing/resizing and emit RESIZE/eventBus resizeEvent on resizestart
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:540:8
     // one handle was actually found lets whichever later call (from the
     // same watchers that already call this reactively) picks the setup
     // back up once the DOM has caught up.
-    if(Object.keys(handleEls).length === 0) {
+    if(true) {
       return;
     }
killedBy: useGridItemResize handleResize — resizestart Should set isResizing/resizing and emit RESIZE/eventBus resizeEvent on resizestart
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
components/Grid/composables/useGridItemResize.ts:540:8
     // one handle was actually found lets whichever later call (from the
     // same watchers that already call this reactively) picks the setup
     // back up once the DOM has caught up.
-    if(Object.keys(handleEls).length === 0) {
+    if(Object.keys(handleEls).length !== 0) {
       return;
     }
killedBy: useGridItemResize handleResize — resizestart Should set isResizing/resizing and emit RESIZE/eventBus resizeEvent on resizestart
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:547:25
     nativeResizable = createNativeResizable(
       gridItem.value,
       handleEls,
-      () => ({ enabled: Boolean(resizable.value) && !props.isStatic, ignoreFrom: props.resizeIgnoreFrom }),
+      () => ({ enabled: false, ignoreFrom: props.resizeIgnoreFrom }),
       handleResize,
     );

[Survived] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:547:25
     nativeResizable = createNativeResizable(
       gridItem.value,
       handleEls,
-      () => ({ enabled: Boolean(resizable.value) && !props.isStatic, ignoreFrom: props.resizeIgnoreFrom }),
+      () => ({ enabled: true, ignoreFrom: props.resizeIgnoreFrom }),
       handleResize,
     );

[Survived] BlockStatement
components/Grid/composables/useGridItemResize.ts:553:41
   };
 
   /** Tears down the native resize engine's own listeners — called from `GridItem.vue`'s `onBeforeUnmount`. */
-  const teardownResizable = (): void => {
-    nativeResizable?.destroy();
-    nativeResizable = undefined;
-  };
+  const teardownResizable = (): void => {};
 
   /**

[Killed] OptionalChaining
components/Grid/composables/useGridItemResize.ts:554:5
 
   /** Tears down the native resize engine's own listeners — called from `GridItem.vue`'s `onBeforeUnmount`. */
   const teardownResizable = (): void => {
-    nativeResizable?.destroy();
+    nativeResizable.destroy();
     nativeResizable = undefined;
   };
killedBy: GridLayout cross-grid drag/drop (allowCrossGridDrag) Should move an item from the source grid into the target grid on a successful cross-grid drop
statusReason: Cannot read properties of undefined (reading 'destroy')

[Killed] LogicalOperator
components/Grid/composables/useGridItemResize.ts:583:25
     // autoHeight enabled at all, where no wrapper ref exists to prefer.
     // eslint-disable-next-line @typescript-eslint/ban-ts-comment
     // @ts-ignore
-    const slotElement = autoHeightWrapper.value ?? slots?.default?.()[0]?.elm;
+    const slotElement = autoHeightWrapper.value && slots?.default?.()[0]?.elm;
     if(!slotElement || typeof slotElement.getBoundingClientRect !== `function`) {
       return;
killedBy: GridItem autoSize Should call autoSize() when a ResizeObserver reports the slot content changed size (autoHeight prop)
statusReason: expected undefined to be truthy

[Killed] OptionalChaining
components/Grid/composables/useGridItemResize.ts:583:52
     // autoHeight enabled at all, where no wrapper ref exists to prefer.
     // eslint-disable-next-line @typescript-eslint/ban-ts-comment
     // @ts-ignore
-    const slotElement = autoHeightWrapper.value ?? slots?.default?.()[0]?.elm;
+    const slotElement = autoHeightWrapper.value ?? slots?.default()[0]?.elm;
     if(!slotElement || typeof slotElement.getBoundingClientRect !== `function`) {
       return;
killedBy: useGridItemResize autoSize Should be a no-op when no measurable slot element is available
statusReason: slots?.default is not a function

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:584:8
     // eslint-disable-next-line @typescript-eslint/ban-ts-comment
     // @ts-ignore
     const slotElement = autoHeightWrapper.value ?? slots?.default?.()[0]?.elm;
-    if(!slotElement || typeof slotElement.getBoundingClientRect !== `function`) {
+    if(true) {
       return;
     }
killedBy: GridItem autoSize Should call autoSize() when a ResizeObserver reports the slot content changed size (autoHeight prop)
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:584:8
     // eslint-disable-next-line @typescript-eslint/ban-ts-comment
     // @ts-ignore
     const slotElement = autoHeightWrapper.value ?? slots?.default?.()[0]?.elm;
-    if(!slotElement || typeof slotElement.getBoundingClientRect !== `function`) {
+    if(false) {
       return;
     }
killedBy: GridItem autoSize Should not throw and should not emit resize/resized when the slot content has no measurable element yet
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Survived] BooleanLiteral
components/Grid/composables/useGridItemResize.ts:589:55
     }
 
     const newSize = slotElement.getBoundingClientRect();
-    const pos = calcWH(newSize.height, newSize.width, true);
+    const pos = calcWH(newSize.height, newSize.width, false);
     if(props.minW) {
       if(pos.w < props.minW) {

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:590:8
 
     const newSize = slotElement.getBoundingClientRect();
     const pos = calcWH(newSize.height, newSize.width, true);
-    if(props.minW) {
+    if(false) {
       if(pos.w < props.minW) {
         pos.w = props.minW;
killedBy: GridItem autoSize Should clamp to minW/minH when measured content is smaller than the configured min
statusReason: expected 1 to be 3 // Object.is equality

[Killed] BlockStatement
components/Grid/composables/useGridItemResize.ts:590:20
 
     const newSize = slotElement.getBoundingClientRect();
     const pos = calcWH(newSize.height, newSize.width, true);
-    if(props.minW) {
-      if(pos.w < props.minW) {
-        pos.w = props.minW;
-      }
-    }
+    if(props.minW) {}
 
     if(props.maxW) {
killedBy: GridItem autoSize Should clamp to minW/minH when measured content is smaller than the configured min
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:591:10
     const newSize = slotElement.getBoundingClientRect();
     const pos = calcWH(newSize.height, newSize.width, true);
     if(props.minW) {
-      if(pos.w < props.minW) {
+      if(true) {
         pos.w = props.minW;
       }
killedBy: useGridItemResize autoSize Should NOT emit RESIZE/RESIZED when the measured size resolves to the same grid units as before
statusReason: expected "vi.fn()" to not be called with arguments: [ 'resize', Anything, Anything, …(3) ]

Received:

  1st vi.fn() call:

  [
    "resize",

[Killed] BlockStatement
components/Grid/composables/useGridItemResize.ts:591:30
     const newSize = slotElement.getBoundingClientRect();
     const pos = calcWH(newSize.height, newSize.width, true);
     if(props.minW) {
-      if(pos.w < props.minW) {
-        pos.w = props.minW;
-      }
+      if(pos.w < props.minW) {}
     }
 
killedBy: GridItem autoSize Should clamp to minW/minH when measured content is smaller than the configured min
statusReason: expected 1 to be 3 // Object.is equality

[Killed] BlockStatement
components/Grid/composables/useGridItemResize.ts:596:20
       }
     }
 
-    if(props.maxW) {
-      if(pos.w > props.maxW) {
-        pos.w = props.maxW;
-      }
-    }
+    if(props.maxW) {}
 
     if(props.minH) {
killedBy: GridItem autoSize Should clamp to maxW/maxH when measured content is larger than the configured max
statusReason: expected 12 to be 2 // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:596:8
       }
     }
 
-    if(props.maxW) {
+    if(true) {
       if(pos.w > props.maxW) {
         pos.w = props.maxW;
killedBy: GridItem autoSize Should skip the maxW/maxH clamp entirely when both are explicitly falsy (0) — confirmed gap via a fresh coverage report
statusReason: expected 1 to be greater than 2

[Killed] BlockStatement
components/Grid/composables/useGridItemResize.ts:597:30
     }
 
     if(props.maxW) {
-      if(pos.w > props.maxW) {
-        pos.w = props.maxW;
-      }
+      if(pos.w > props.maxW) {}
     }
 
killedBy: GridItem autoSize Should clamp to maxW/maxH when measured content is larger than the configured max
statusReason: expected 12 to be 2 // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:597:10
     }
 
     if(props.maxW) {
-      if(pos.w > props.maxW) {
+      if(false) {
         pos.w = props.maxW;
       }
killedBy: GridItem autoSize Should clamp to maxW/maxH when measured content is larger than the configured max
statusReason: expected 12 to be 2 // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:602:8
       }
     }
 
-    if(props.minH) {
+    if(false) {
       if(pos.h < props.minH) {
         pos.h = props.minH;
killedBy: GridItem autoSize Should clamp to minW/minH when measured content is smaller than the configured min
statusReason: expected 1 to be 3 // Object.is equality

[Killed] BlockStatement
components/Grid/composables/useGridItemResize.ts:602:20
       }
     }
 
-    if(props.minH) {
-      if(pos.h < props.minH) {
-        pos.h = props.minH;
-      }
-    }
+    if(props.minH) {}
 
     if(props.maxH) {
killedBy: GridItem autoSize Should clamp to minW/minH when measured content is smaller than the configured min
statusReason: expected 1 to be 3 // Object.is equality

[Killed] EqualityOperator
components/Grid/composables/useGridItemResize.ts:603:10
     }
 
     if(props.minH) {
-      if(pos.h < props.minH) {
+      if(pos.h >= props.minH) {
         pos.h = props.minH;
       }
killedBy: GridItem autoSize Should clamp to maxW/maxH when measured content is larger than the configured max
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:603:10
     }
 
     if(props.minH) {
-      if(pos.h < props.minH) {
+      if(true) {
         pos.h = props.minH;
       }
killedBy: GridItem autoSize Should clamp to maxW/maxH when measured content is larger than the configured max
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
components/Grid/composables/useGridItemResize.ts:608:20
       }
     }
 
-    if(props.maxH) {
-      if(pos.h > props.maxH) {
-        pos.h = props.maxH;
-      }
-    }
+    if(props.maxH) {}
 
     // Bug fix (docs/REFACTORING.md #70): calcWH's own autoSizeFlag height
killedBy: GridItem autoSize Should clamp to maxW/maxH when measured content is larger than the configured max
statusReason: expected 46 to be 2 // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:608:8
       }
     }
 
-    if(props.maxH) {
+    if(true) {
       if(pos.h > props.maxH) {
         pos.h = props.maxH;
killedBy: GridItem autoSize Should skip the maxW/maxH clamp entirely when both are explicitly falsy (0) — confirmed gap via a fresh coverage report
statusReason: expected 1 to be greater than 2

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:609:10
     }
 
     if(props.maxH) {
-      if(pos.h > props.maxH) {
+      if(false) {
         pos.h = props.maxH;
       }
killedBy: GridItem autoSize Should clamp to maxW/maxH when measured content is larger than the configured max
statusReason: expected 46 to be 2 // Object.is equality

[Killed] BlockStatement
components/Grid/composables/useGridItemResize.ts:609:30
     }
 
     if(props.maxH) {
-      if(pos.h > props.maxH) {
-        pos.h = props.maxH;
-      }
+      if(pos.h > props.maxH) {}
     }
 
killedBy: GridItem autoSize Should clamp to maxW/maxH when measured content is larger than the configured max
statusReason: expected 46 to be 2 // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:623:8
     // Left as a documented, understood gap rather than forced with a
     // manufactured negative-height double.
     /* v8 ignore next 3 -- see the comment above: Math.ceil already floors height to >=1 whenever it's non-negative, which a real getBoundingClientRect() always is. */
-    if(pos.h < 1) {
+    if(true) {
       pos.h = 1;
     }
killedBy: GridItem autoSize Should clamp to maxW/maxH when measured content is larger than the configured max
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
components/Grid/composables/useGridItemResize.ts:623:8
     // Left as a documented, understood gap rather than forced with a
     // manufactured negative-height double.
     /* v8 ignore next 3 -- see the comment above: Math.ceil already floors height to >=1 whenever it's non-negative, which a real getBoundingClientRect() always is. */
-    if(pos.h < 1) {
+    if(pos.h >= 1) {
       pos.h = 1;
     }
killedBy: GridItem autoSize Should clamp to maxW/maxH when measured content is larger than the configured max
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
components/Grid/composables/useGridItemResize.ts:630:8
       pos.w = 1;
     }
 
-    if(innerW.value !== pos.w || innerH.value !== pos.h) {
+    if(innerW.value === pos.w || innerH.value !== pos.h) {
       emit(EGridItemEvent.RESIZE, props.i, pos.h, pos.w, newSize.height, newSize.width);
     }
killedBy: useGridItemResize autoSize Should NOT emit RESIZE/RESIZED when the measured size resolves to the same grid units as before
statusReason: expected "vi.fn()" to not be called with arguments: [ 'resize', Anything, Anything, …(3) ]

Received:

  1st vi.fn() call:

  [
    "resize",

[Killed] EqualityOperator
components/Grid/composables/useGridItemResize.ts:630:34
       pos.w = 1;
     }
 
-    if(innerW.value !== pos.w || innerH.value !== pos.h) {
+    if(innerW.value !== pos.w || innerH.value === pos.h) {
       emit(EGridItemEvent.RESIZE, props.i, pos.h, pos.w, newSize.height, newSize.width);
     }
killedBy: useGridItemResize autoSize Should NOT emit RESIZE/RESIZED when the measured size resolves to the same grid units as before
statusReason: expected "vi.fn()" to not be called with arguments: [ 'resize', Anything, Anything, …(3) ]

Received:

  1st vi.fn() call:

  [
    "resize",

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:634:8
       emit(EGridItemEvent.RESIZE, props.i, pos.h, pos.w, newSize.height, newSize.width);
     }
 
-    if(previousW.value !== pos.w || previousH.value !== pos.h) {
+    if(true) {
       emit(EGridItemEvent.RESIZED, props.i, pos.h, pos.w, newSize.height, newSize.width);
 
killedBy: GridItem autoSize (happy path, via a mocked useSlots) Should not emit a second RESIZED for an unchanged size on a repeat call
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:634:8
       emit(EGridItemEvent.RESIZE, props.i, pos.h, pos.w, newSize.height, newSize.width);
     }
 
-    if(previousW.value !== pos.w || previousH.value !== pos.h) {
+    if(false) {
       emit(EGridItemEvent.RESIZED, props.i, pos.h, pos.w, newSize.height, newSize.width);
 
killedBy: GridItem autoSize (happy path, via a mocked useSlots) Should resize to the measured slot content and emit RESIZE/RESIZED
statusReason: expected undefined to be truthy

[Killed] ObjectLiteral
components/Grid/composables/useGridItemResize.ts:637:33
     if(previousW.value !== pos.w || previousH.value !== pos.h) {
       emit(EGridItemEvent.RESIZED, props.i, pos.h, pos.w, newSize.height, newSize.width);
 
-      const data: IEventsData = {
-        eventType: `resizeend`,
-        h: pos.h,
-        i: props.i,
-        w: pos.w,
-        x: innerX.value,
-        y: innerY.value,
-      };
+      const data: IEventsData = {};
       eventBus.emit(`resizeEvent`, data);
     }
killedBy: GridItem autoSize (happy path, via a mocked useSlots) Should not emit a second RESIZED for an unchanged size on a repeat call
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
components/Grid/composables/useGridItemResize.ts:666:39
    */
   let autoHeightObserver: ResizeObserver | undefined;
 
-  const setupAutoHeight = (): void => {
-    if(!props.autoHeight || typeof ResizeObserver === `undefined` || !autoHeightWrapper.value) {
-      return;
-    }
-    autoHeightObserver = new ResizeObserver(() => {
-      autoSize();
-    });
-    autoHeightObserver.observe(autoHeightWrapper.value);
-  };
+  const setupAutoHeight = (): void => {};
 
   const teardownAutoHeight = (): void => {
killedBy: GridItem autoSize Should call autoSize() when a ResizeObserver reports the slot content changed size (autoHeight prop)
statusReason: expected undefined to be defined

[Killed] EqualityOperator
components/Grid/composables/useGridItemResize.ts:667:29
   let autoHeightObserver: ResizeObserver | undefined;
 
   const setupAutoHeight = (): void => {
-    if(!props.autoHeight || typeof ResizeObserver === `undefined` || !autoHeightWrapper.value) {
+    if(!props.autoHeight || typeof ResizeObserver !== `undefined` || !autoHeightWrapper.value) {
       return;
     }
killedBy: GridItem autoSize Should call autoSize() when a ResizeObserver reports the slot content changed size (autoHeight prop)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
components/Grid/composables/useGridItemResize.ts:667:8
   let autoHeightObserver: ResizeObserver | undefined;
 
   const setupAutoHeight = (): void => {
-    if(!props.autoHeight || typeof ResizeObserver === `undefined` || !autoHeightWrapper.value) {
+    if(true) {
       return;
     }
killedBy: GridItem autoSize Should call autoSize() when a ResizeObserver reports the slot content changed size (autoHeight prop)
statusReason: expected undefined to be defined

[Killed] BlockStatement
components/Grid/composables/useGridItemResize.ts:670:51
     if(!props.autoHeight || typeof ResizeObserver === `undefined` || !autoHeightWrapper.value) {
       return;
     }
-    autoHeightObserver = new ResizeObserver(() => {
-      autoSize();
-    });
+    autoHeightObserver = new ResizeObserver(() => {});
     autoHeightObserver.observe(autoHeightWrapper.value);
   };
killedBy: GridItem autoSize Should call autoSize() when a ResizeObserver reports the slot content changed size (autoHeight prop)
statusReason: expected undefined to be truthy

[Survived] BlockStatement
components/Grid/composables/useGridItemResize.ts:676:42
     autoHeightObserver.observe(autoHeightWrapper.value);
   };
 
-  const teardownAutoHeight = (): void => {
-    autoHeightObserver?.disconnect();
-    autoHeightObserver = undefined;
-  };
+  const teardownAutoHeight = (): void => {};
 
   /**

[Killed] OptionalChaining
components/Grid/composables/useGridItemResize.ts:677:5
   };
 
   const teardownAutoHeight = (): void => {
-    autoHeightObserver?.disconnect();
+    autoHeightObserver.disconnect();
     autoHeightObserver = undefined;
   };
killedBy: GridItem lifecycle Should tear down the native drag/resize engines' own listeners when unmounted
statusReason: Cannot read properties of undefined (reading 'disconnect')

[Killed] ObjectLiteral
components/Grid/composables/useGridItemResize.ts:692:10
    * - `teardownResizable` — called from `GridItem.vue`'s `onBeforeUnmount`.
    * - `tryMakeResizable` — called from `GridItem.vue`'s watchers.
    */
-  return {
-    autoSize,
-    calcPosition,
-    calcWH,
-    isResizing,
-    resizable,
-    resizing,
-    setupAutoHeight,
-    teardownAutoHeight,
-    teardownResizable,
-    tryMakeResizable,
-  };
+  return {};
 }
 
killedBy: GridLayout cross-grid drag/drop (allowCrossGridDrag) Should move an item from the source grid into the target grid on a successful cross-grid drop
statusReason: Cannot read properties of undefined (reading 'value')
