[Killed] ArrowFunction
components/Grid/composables/useMultiSelect.ts:75:34
   const lastAnchorId = ref<string | number | null>(null);
 
-  const selectedItems = computed(() => Array.from(selectedItemIds.value));
+  const selectedItems = computed(() => undefined);
 
   const emitSelectionChanged = (): void => {
killedBy: GridLayout multiSelect Should do nothing on click when multiSelect is off (the default)
statusReason: expected undefined to strictly equal []

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:77:44
   const selectedItems = computed(() => Array.from(selectedItemIds.value));
 
-  const emitSelectionChanged = (): void => {
-    emit(EGridLayoutEvent.SELECTION_CHANGED, Array.from(selectedItemIds.value));
-  };
+  const emitSelectionChanged = (): void => {};
 
   /**
killedBy: GridLayout multiSelect Should emit SELECTION_CHANGED with the full current selection
statusReason: expected undefined to strictly equal [ [ [ '0' ] ] ]

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:87:71
    * true` (Shift/Ctrl/Cmd+click) adds it to whatever's already
    * selected without clearing the rest.
    */
-  const selectItem = (id: string | number, additive = false): void => {
-    selectedItemIds.value = additive ? new Set([...selectedItemIds.value, id]) : new Set([id]);
-    emitSelectionChanged();
-  };
+  const selectItem = (id: string | number, additive = false): void => {};
 
   /** Removes `id` from the selection, if present. A no-op (no event fired) if it wasn't selected. */
killedBy: GridLayout multiSelect Should select only the clicked item on a plain click, replacing any prior selection
statusReason: expected [] to strictly equal [ '0' ]

[Killed] BooleanLiteral
components/Grid/composables/useMultiSelect.ts:87:55
    * true` (Shift/Ctrl/Cmd+click) adds it to whatever's already
    * selected without clearing the rest.
    */
-  const selectItem = (id: string | number, additive = false): void => {
+  const selectItem = (id: string | number, additive = true): void => {
     selectedItemIds.value = additive ? new Set([...selectedItemIds.value, id]) : new Set([id]);
     emitSelectionChanged();
killedBy: useMultiSelect selectItem Should replace the entire selection by default (non-additive)
statusReason: expected [ 'a', 'b' ] to strictly equal [ 'b' ]

[Killed] ArrayDeclaration
components/Grid/composables/useMultiSelect.ts:88:90
    * selected without clearing the rest.
    */
   const selectItem = (id: string | number, additive = false): void => {
-    selectedItemIds.value = additive ? new Set([...selectedItemIds.value, id]) : new Set([id]);
+    selectedItemIds.value = additive ? new Set([...selectedItemIds.value, id]) : new Set([]);
     emitSelectionChanged();
   };
killedBy: GridLayout multiSelect Should select only the clicked item on a plain click, replacing any prior selection
statusReason: expected [] to strictly equal [ '0' ]

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:93:55
   };
 
   /** Removes `id` from the selection, if present. A no-op (no event fired) if it wasn't selected. */
-  const deselectItem = (id: string | number): void => {
-    if(!selectedItemIds.value.has(id)) {
-      return;
-    }
-    const next = new Set(selectedItemIds.value);
-    next.delete(id);
-    selectedItemIds.value = next;
-    emitSelectionChanged();
-  };
+  const deselectItem = (id: string | number): void => {};
 
   /** Adds `id` to the selection if not already present, removes it otherwise — the Shift/Ctrl/Cmd+click gesture. */
killedBy: GridLayout multiSelect Should toggle an already-selected item off on Ctrl/Cmd+click
statusReason: expected [ '0', '1' ] to strictly equal [ '0' ]

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:94:8
 
   /** Removes `id` from the selection, if present. A no-op (no event fired) if it wasn't selected. */
   const deselectItem = (id: string | number): void => {
-    if(!selectedItemIds.value.has(id)) {
+    if(false) {
       return;
     }
killedBy: GridLayout multiSelect Should be a no-op with no emitted event when deselectItem is called on an item that isn't selected
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:94:8
 
   /** Removes `id` from the selection, if present. A no-op (no event fired) if it wasn't selected. */
   const deselectItem = (id: string | number): void => {
-    if(!selectedItemIds.value.has(id)) {
+    if(true) {
       return;
     }
killedBy: GridLayout multiSelect Should toggle an already-selected item off on Ctrl/Cmd+click
statusReason: expected [ '0', '1' ] to strictly equal [ '0' ]

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:104:62
   };
 
   /** Adds `id` to the selection if not already present, removes it otherwise — the Shift/Ctrl/Cmd+click gesture. */
-  const toggleItemSelection = (id: string | number): void => {
-    if(selectedItemIds.value.has(id)) {
-      deselectItem(id);
-    } else {
-      selectItem(id, true);
-    }
-  };
+  const toggleItemSelection = (id: string | number): void => {};
 
killedBy: GridLayout multiSelect Should toggle an already-selected item off on Ctrl/Cmd+click
statusReason: expected [ '0' ] to strictly equal [ '0', '1' ]

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:105:8
 
   /** Adds `id` to the selection if not already present, removes it otherwise — the Shift/Ctrl/Cmd+click gesture. */
   const toggleItemSelection = (id: string | number): void => {
-    if(selectedItemIds.value.has(id)) {
+    if(true) {
       deselectItem(id);
     } else {
killedBy: GridLayout multiSelect Should toggle an already-selected item off on Ctrl/Cmd+click
statusReason: expected [ '0' ] to strictly equal [ '0', '1' ]

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:105:8
 
   /** Adds `id` to the selection if not already present, removes it otherwise — the Shift/Ctrl/Cmd+click gesture. */
   const toggleItemSelection = (id: string | number): void => {
-    if(selectedItemIds.value.has(id)) {
+    if(false) {
       deselectItem(id);
     } else {
killedBy: GridLayout multiSelect Should toggle an already-selected item off on Ctrl/Cmd+click
statusReason: expected [ '0', '1' ] to strictly equal [ '0' ]

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:107:12
   const toggleItemSelection = (id: string | number): void => {
     if(selectedItemIds.value.has(id)) {
       deselectItem(id);
-    } else {
-      selectItem(id, true);
-    }
+    } else {}
   };
 
killedBy: GridLayout multiSelect Should toggle an already-selected item off on Ctrl/Cmd+click
statusReason: expected [ '0' ] to strictly equal [ '0', '1' ]

[Killed] BooleanLiteral
components/Grid/composables/useMultiSelect.ts:108:22
     if(selectedItemIds.value.has(id)) {
       deselectItem(id);
     } else {
-      selectItem(id, true);
+      selectItem(id, false);
     }
   };
killedBy: GridLayout multiSelect Should toggle an already-selected item off on Ctrl/Cmd+click
statusReason: expected [ '1' ] to strictly equal [ '0', '1' ]

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:113:38
   };
 
-  const clearSelection = (): void => {
-    lastAnchorId.value = null;
-    if(selectedItemIds.value.size === 0) {
-      return;
-    }
-    selectedItemIds.value = new Set();
-    emitSelectionChanged();
-  };
+  const clearSelection = (): void => {};
 
   /**
killedBy: GridLayout multiSelect Should clear the selection when clicking empty grid background
statusReason: expected [ '0' ] to strictly equal []

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:115:8
   const clearSelection = (): void => {
     lastAnchorId.value = null;
-    if(selectedItemIds.value.size === 0) {
+    if(false) {
       return;
     }
killedBy: GridLayout multiSelect Should be a no-op with no emitted event when clearSelection is called on an already-empty selection
statusReason: expected [ [ [] ] ] to be falsy

[Killed] EqualityOperator
components/Grid/composables/useMultiSelect.ts:115:8
   const clearSelection = (): void => {
     lastAnchorId.value = null;
-    if(selectedItemIds.value.size === 0) {
+    if(selectedItemIds.value.size !== 0) {
       return;
     }
killedBy: useMultiSelect clearSelection Should empty the selection and emit SELECTION_CHANGED when something was selected
statusReason: expected [ 'a' ] to strictly equal []

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:139:38
    * select, the same well-defined "no anchor yet" behavior a fresh
    * grid starts with.
    */
-  const pruneSelection = (): void => {
-    if(lastAnchorId.value !== null && !props.layout.some(item => item.i === lastAnchorId.value)) {
-      lastAnchorId.value = null;
-    }
-    if(selectedItemIds.value.size === 0) {
-      return;
-    }
-    const currentIds = new Set(props.layout.map(item => item.i));
-    const next = new Set(Array.from(selectedItemIds.value).filter(id => currentIds.has(id)));
-    if(next.size !== selectedItemIds.value.size) {
-      selectedItemIds.value = next;
-      emitSelectionChanged();
-    }
-  };
+  const pruneSelection = (): void => {};
 
   /**
killedBy: GridLayout multiSelect Bug fix: removing a selected item from the layout prunes it from selectedItemIds/selectedItems
statusReason: expected [ '0', '1' ] to strictly equal [ '1' ]

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:140:66
    * grid starts with.
    */
   const pruneSelection = (): void => {
-    if(lastAnchorId.value !== null && !props.layout.some(item => item.i === lastAnchorId.value)) {
+    if(lastAnchorId.value !== null && !props.layout.some(item => false)) {
       lastAnchorId.value = null;
     }
killedBy: useMultiSelect pruneSelection Should leave lastAnchorId untouched when it still matches a real layout item
statusReason: expected [ 'a', 'c' ] to strictly equal [ 'a', 'b', 'c' ]

[Killed] ArrowFunction
components/Grid/composables/useMultiSelect.ts:140:58
    * grid starts with.
    */
   const pruneSelection = (): void => {
-    if(lastAnchorId.value !== null && !props.layout.some(item => item.i === lastAnchorId.value)) {
+    if(lastAnchorId.value !== null && !props.layout.some(() => undefined)) {
       lastAnchorId.value = null;
     }
killedBy: useMultiSelect pruneSelection Should leave lastAnchorId untouched when it still matches a real layout item
statusReason: expected [ 'a', 'c' ] to strictly equal [ 'a', 'b', 'c' ]

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:143:8
     if(lastAnchorId.value !== null && !props.layout.some(item => item.i === lastAnchorId.value)) {
       lastAnchorId.value = null;
     }
-    if(selectedItemIds.value.size === 0) {
+    if(true) {
       return;
     }
killedBy: GridLayout multiSelect Bug fix: removing a selected item from the layout prunes it from selectedItemIds/selectedItems
statusReason: expected [ '0', '1' ] to strictly equal [ '1' ]

[Killed] EqualityOperator
components/Grid/composables/useMultiSelect.ts:143:8
     if(lastAnchorId.value !== null && !props.layout.some(item => item.i === lastAnchorId.value)) {
       lastAnchorId.value = null;
     }
-    if(selectedItemIds.value.size === 0) {
+    if(selectedItemIds.value.size !== 0) {
       return;
     }
killedBy: useMultiSelect pruneSelection Should remove selected ids no longer present in props.layout
statusReason: expected [ 'a', 'b' ] to strictly equal [ 'a' ]

[Killed] ArrowFunction
components/Grid/composables/useMultiSelect.ts:146:49
     if(selectedItemIds.value.size === 0) {
       return;
     }
-    const currentIds = new Set(props.layout.map(item => item.i));
+    const currentIds = new Set(props.layout.map(() => undefined));
     const next = new Set(Array.from(selectedItemIds.value).filter(id => currentIds.has(id)));
     if(next.size !== selectedItemIds.value.size) {
killedBy: GridLayout multiSelect Bug fix: removing a selected item from the layout prunes it from selectedItemIds/selectedItems
statusReason: expected [] to strictly equal [ '1' ]

[Killed] MethodExpression
components/Grid/composables/useMultiSelect.ts:147:26
       return;
     }
     const currentIds = new Set(props.layout.map(item => item.i));
-    const next = new Set(Array.from(selectedItemIds.value).filter(id => currentIds.has(id)));
+    const next = new Set(Array.from(selectedItemIds.value));
     if(next.size !== selectedItemIds.value.size) {
       selectedItemIds.value = next;
killedBy: useMultiSelect pruneSelection Should remove selected ids no longer present in props.layout
statusReason: expected [ 'a', 'b' ] to strictly equal [ 'a' ]

[Killed] ArrowFunction
components/Grid/composables/useMultiSelect.ts:147:67
       return;
     }
     const currentIds = new Set(props.layout.map(item => item.i));
-    const next = new Set(Array.from(selectedItemIds.value).filter(id => currentIds.has(id)));
+    const next = new Set(Array.from(selectedItemIds.value).filter(() => undefined));
     if(next.size !== selectedItemIds.value.size) {
       selectedItemIds.value = next;
killedBy: GridLayout multiSelect Bug fix: removing a selected item from the layout prunes it from selectedItemIds/selectedItems
statusReason: expected [] to strictly equal [ '1' ]

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:148:8
     }
     const currentIds = new Set(props.layout.map(item => item.i));
     const next = new Set(Array.from(selectedItemIds.value).filter(id => currentIds.has(id)));
-    if(next.size !== selectedItemIds.value.size) {
+    if(true) {
       selectedItemIds.value = next;
       emitSelectionChanged();
killedBy: GridLayout multiSelect Should not prune or emit SELECTION_CHANGED when the layout changes but nothing selected was removed
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:148:8
     }
     const currentIds = new Set(props.layout.map(item => item.i));
     const next = new Set(Array.from(selectedItemIds.value).filter(id => currentIds.has(id)));
-    if(next.size !== selectedItemIds.value.size) {
+    if(false) {
       selectedItemIds.value = next;
       emitSelectionChanged();
killedBy: GridLayout multiSelect Bug fix: removing a selected item from the layout prunes it from selectedItemIds/selectedItems
statusReason: expected [ '0', '1' ] to strictly equal [ '1' ]

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:174:64
    * itself: see that ref's own doc comment for why the anchor should
    * stay fixed across repeated Shift-clicks.
    */
-  const itemClickedHandler = (data: IItemClickedData): void => {
-    if(!props.multiSelect) {
-      return;
-    }
-    if(data.shiftKey && lastAnchorId.value !== null) {
-      const range = computeRangeSelection(props.layout, lastAnchorId.value, data.i);
-      selectedItemIds.value = new Set(range);
-      emitSelectionChanged();
-      return;
-    }
-    if(data.shiftKey || data.ctrlKey || data.metaKey) {
-      toggleItemSelection(data.i);
-    } else {
-      selectItem(data.i, false);
-    }
-    lastAnchorId.value = data.i;
-  };
+  const itemClickedHandler = (data: IItemClickedData): void => {};
 
   /**
killedBy: useMultiSelect clearSelection Should reset lastAnchorId, so a later Shift-click has no anchor to range from
statusReason: expected [] to strictly equal [ 'c' ]

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:175:8
    * stay fixed across repeated Shift-clicks.
    */
   const itemClickedHandler = (data: IItemClickedData): void => {
-    if(!props.multiSelect) {
+    if(false) {
       return;
     }
killedBy: GridLayout multiSelect Should do nothing on click when multiSelect is off (the default)
statusReason: expected [ '0' ] to strictly equal []

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:175:28
    * stay fixed across repeated Shift-clicks.
    */
   const itemClickedHandler = (data: IItemClickedData): void => {
-    if(!props.multiSelect) {
-      return;
-    }
+    if(!props.multiSelect) {}
     if(data.shiftKey && lastAnchorId.value !== null) {
       const range = computeRangeSelection(props.layout, lastAnchorId.value, data.i);
killedBy: GridLayout multiSelect Should do nothing on click when multiSelect is off (the default)
statusReason: expected [ '0' ] to strictly equal []

[Killed] LogicalOperator
components/Grid/composables/useMultiSelect.ts:178:8
     if(!props.multiSelect) {
       return;
     }
-    if(data.shiftKey && lastAnchorId.value !== null) {
+    if(data.shiftKey || lastAnchorId.value !== null) {
       const range = computeRangeSelection(props.layout, lastAnchorId.value, data.i);
       selectedItemIds.value = new Set(range);
killedBy: GridLayout multiSelect Should select only the clicked item on a plain click, replacing any prior selection
statusReason: expected [ '0', '1' ] to strictly equal [ '1' ]

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:178:8
     if(!props.multiSelect) {
       return;
     }
-    if(data.shiftKey && lastAnchorId.value !== null) {
+    if(false) {
       const range = computeRangeSelection(props.layout, lastAnchorId.value, data.i);
       selectedItemIds.value = new Set(range);
killedBy: GridLayout multiSelect Shift-click range-selection Should select every item between the anchor and the Shift-clicked target, inclusive
statusReason: expected [ 'a', 'd' ] to strictly equal [ 'a', 'b', 'c', 'd' ]

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:184:8
       emitSelectionChanged();
       return;
     }
-    if(data.shiftKey || data.ctrlKey || data.metaKey) {
+    if(false) {
       toggleItemSelection(data.i);
     } else {
killedBy: GridLayout multiSelect Should toggle an already-selected item off on Ctrl/Cmd+click
statusReason: expected [ '1' ] to strictly equal [ '0', '1' ]

[Killed] ConditionalExpression
components/Grid/composables/useMultiSelect.ts:184:8
       emitSelectionChanged();
       return;
     }
-    if(data.shiftKey || data.ctrlKey || data.metaKey) {
+    if(false || data.metaKey) {
       toggleItemSelection(data.i);
     } else {
killedBy: GridLayout multiSelect Should toggle an already-selected item off on Ctrl/Cmd+click
statusReason: expected [ '1' ] to strictly equal [ '0', '1' ]

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:186:12
     }
     if(data.shiftKey || data.ctrlKey || data.metaKey) {
       toggleItemSelection(data.i);
-    } else {
-      selectItem(data.i, false);
-    }
+    } else {}
     lastAnchorId.value = data.i;
   };
killedBy: useMultiSelect itemClickedHandler Should select just the clicked item on a plain click, replacing any prior selection
statusReason: expected [ 'a' ] to strictly equal [ 'b' ]

[Killed] BooleanLiteral
components/Grid/composables/useMultiSelect.ts:187:26
     if(data.shiftKey || data.ctrlKey || data.metaKey) {
       toggleItemSelection(data.i);
     } else {
-      selectItem(data.i, false);
+      selectItem(data.i, true);
     }
     lastAnchorId.value = data.i;
killedBy: useMultiSelect itemClickedHandler Should select just the clicked item on a plain click, replacing any prior selection
statusReason: expected [ 'a', 'b' ] to strictly equal [ 'b' ]

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:200:63
    * a different `target` than `currentTarget` by the time it reaches
    * this listener.
    */
-  const backgroundClickHandler = (event: MouseEvent): void => {
-    if(props.multiSelect && event.target === event.currentTarget) {
-      clearSelection();
-    }
-  };
+  const backgroundClickHandler = (event: MouseEvent): void => {};
 
   return {
killedBy: GridLayout multiSelect Should clear the selection when clicking empty grid background
statusReason: expected [ '0' ] to strictly equal []

[Killed] LogicalOperator
components/Grid/composables/useMultiSelect.ts:201:8
    * this listener.
    */
   const backgroundClickHandler = (event: MouseEvent): void => {
-    if(props.multiSelect && event.target === event.currentTarget) {
+    if(props.multiSelect || event.target === event.currentTarget) {
       clearSelection();
     }
killedBy: GridLayout multiSelect Should select only the clicked item on a plain click, replacing any prior selection
statusReason: expected [] to strictly equal [ '0' ]

[Killed] BlockStatement
components/Grid/composables/useMultiSelect.ts:201:67
    * this listener.
    */
   const backgroundClickHandler = (event: MouseEvent): void => {
-    if(props.multiSelect && event.target === event.currentTarget) {
-      clearSelection();
-    }
+    if(props.multiSelect && event.target === event.currentTarget) {}
   };
 
killedBy: GridLayout multiSelect Should clear the selection when clicking empty grid background
statusReason: expected [ '0' ] to strictly equal []

[Killed] ObjectLiteral
components/Grid/composables/useMultiSelect.ts:206:10
     }
   };
 
-  return {
-    backgroundClickHandler,
-    clearSelection,
-    deselectItem,
-    itemClickedHandler,
-    pruneSelection,
-    selectedItemIds,
-    selectedItems,
-    selectItem,
-    toggleItemSelection,
-  };
+  return {};
 }
 
killedBy: useMultiSelect selectItem Should replace the entire selection by default (non-additive)
statusReason: helper.selectItem is not a function
