[Killed] ConditionalExpression
vue/src/composables/useLayoutStorage.ts:56:34
   hasSaved: () => boolean;
 }
 
-const hasWindow = (): boolean => typeof window !== `undefined`;
+const hasWindow = (): boolean => true;
 
 /**
killedBy: useLayoutStorage Should not throw when window/storage isn't available (SSR)
statusReason: expected [Function] to not throw an error but 'ReferenceError: window is not defined' was thrown

[Killed] BooleanLiteral
vue/src/composables/useLayoutStorage.ts:88:31
   layout: Ref<TLayout>,
   options: IUseLayoutStorageOptions = {},
 ): IUseLayoutStorage {
-  const { storage, autoLoad = true, autoSave = false, debounceMs = 500 } = options;
+  const { storage, autoLoad = false, autoSave = false, debounceMs = 500 } = options;
 
   const resolveStorage = (): Storage | null => {
killedBy: useLayoutStorage Should auto-load from storage by default
statusReason: expected [ Array(1) ] to strictly equal [ { h: 3, i: 'saved', w: 3, …(2) } ]

[Survived] BooleanLiteral
vue/src/composables/useLayoutStorage.ts:88:48
   layout: Ref<TLayout>,
   options: IUseLayoutStorageOptions = {},
 ): IUseLayoutStorage {
-  const { storage, autoLoad = true, autoSave = false, debounceMs = 500 } = options;
+  const { storage, autoLoad = true, autoSave = true, debounceMs = 500 } = options;
 
   const resolveStorage = (): Storage | null => {

[Killed] BlockStatement
vue/src/composables/useLayoutStorage.ts:97:28
     return hasWindow() ? window.localStorage : null;
   };
 
-  const save = (): void => {
-    const target = resolveStorage();
-    if(!target) {
-      return;
-    }
-    target.setItem(key, serializeLayout(layout.value));
-  };
+  const save = (): void => {};
 
   const load = (): boolean => {
killedBy: useLayoutStorage Should save the current layout to the given storage
statusReason: expected null to be '[{"h":2,"i":"0","w":2,"x":0,"y":0}]' // Object.is equality

[Killed] ConditionalExpression
vue/src/composables/useLayoutStorage.ts:99:8
 
   const save = (): void => {
     const target = resolveStorage();
-    if(!target) {
+    if(false) {
       return;
     }
killedBy: useLayoutStorage Should not throw when window/storage isn't available (SSR)
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
vue/src/composables/useLayoutStorage.ts:99:8
 
   const save = (): void => {
     const target = resolveStorage();
-    if(!target) {
+    if(true) {
       return;
     }
killedBy: useLayoutStorage Should save the current layout to the given storage
statusReason: expected null to be '[{"h":2,"i":"0","w":2,"x":0,"y":0}]' // Object.is equality

[Killed] BlockStatement
vue/src/composables/useLayoutStorage.ts:105:31
     target.setItem(key, serializeLayout(layout.value));
   };
 
-  const load = (): boolean => {
-    const target = resolveStorage();
-    if(!target) {
-      return false;
-    }
-    const parsed = deserializeLayout(target.getItem(key));
-    if(parsed === null) {
-      return false;
-    }
-    layout.value = parsed;
-    return true;
-  };
+  const load = (): boolean => {};
 
   const clear = (): void => {
killedBy: useLayoutStorage Should load a previously saved layout and replace layout.value
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
vue/src/composables/useLayoutStorage.ts:107:17
 
   const load = (): boolean => {
     const target = resolveStorage();
-    if(!target) {
-      return false;
-    }
+    if(!target) {}
     const parsed = deserializeLayout(target.getItem(key));
     if(parsed === null) {
killedBy: useLayoutStorage Should not throw when window/storage isn't available (SSR)
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BooleanLiteral
vue/src/composables/useLayoutStorage.ts:108:14
   const load = (): boolean => {
     const target = resolveStorage();
     if(!target) {
-      return false;
+      return true;
     }
     const parsed = deserializeLayout(target.getItem(key));
killedBy: useLayoutStorage Should not throw when window/storage isn't available (SSR)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
vue/src/composables/useLayoutStorage.ts:111:25
       return false;
     }
     const parsed = deserializeLayout(target.getItem(key));
-    if(parsed === null) {
-      return false;
-    }
+    if(parsed === null) {}
     layout.value = parsed;
     return true;
killedBy: useLayoutStorage Should return false and leave layout.value untouched when nothing is stored
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
vue/src/composables/useLayoutStorage.ts:111:8
       return false;
     }
     const parsed = deserializeLayout(target.getItem(key));
-    if(parsed === null) {
+    if(false) {
       return false;
     }
killedBy: useLayoutStorage Should return false and leave layout.value untouched when nothing is stored
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
vue/src/composables/useLayoutStorage.ts:118:29
     return true;
   };
 
-  const clear = (): void => {
-    resolveStorage()?.removeItem(key);
-  };
+  const clear = (): void => {};
 
   const hasSaved = (): boolean => {
killedBy: useLayoutStorage Should clear the stored value
statusReason: expected '[{"h":2,"i":"0","w":2,"x":0,"y":0}]' to be null

[Killed] OptionalChaining
vue/src/composables/useLayoutStorage.ts:119:5
   };
 
   const clear = (): void => {
-    resolveStorage()?.removeItem(key);
+    resolveStorage().removeItem(key);
   };
 
killedBy: useLayoutStorage Should not throw when window/storage isn't available (SSR)
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BlockStatement
vue/src/composables/useLayoutStorage.ts:122:35
     resolveStorage()?.removeItem(key);
   };
 
-  const hasSaved = (): boolean => {
-    const target = resolveStorage();
-    return target !== null && target.getItem(key) !== null;
-  };
+  const hasSaved = (): boolean => {};
 
   if(autoLoad) {
killedBy: useLayoutStorage Should report hasSaved correctly before and after a save
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
vue/src/composables/useLayoutStorage.ts:124:12
 
   const hasSaved = (): boolean => {
     const target = resolveStorage();
-    return target !== null && target.getItem(key) !== null;
+    return false;
   };
 
killedBy: useLayoutStorage Should report hasSaved correctly before and after a save
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
vue/src/composables/useLayoutStorage.ts:124:12
 
   const hasSaved = (): boolean => {
     const target = resolveStorage();
-    return target !== null && target.getItem(key) !== null;
+    return true;
   };
 
killedBy: useLayoutStorage Should report hasSaved correctly before and after a save
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
vue/src/composables/useLayoutStorage.ts:127:6
     return target !== null && target.getItem(key) !== null;
   };
 
-  if(autoLoad) {
+  if(true) {
     load();
   }
killedBy: useLayoutStorage Should not auto-load when autoLoad is false
statusReason: expected [ { h: 3, i: 'saved', w: 3, …(2) } ] to strictly equal [ Array(1) ]

[Killed] ConditionalExpression
vue/src/composables/useLayoutStorage.ts:127:6
     return target !== null && target.getItem(key) !== null;
   };
 
-  if(autoLoad) {
+  if(false) {
     load();
   }
killedBy: useLayoutStorage Should auto-load from storage by default
statusReason: expected [ Array(1) ] to strictly equal [ { h: 3, i: 'saved', w: 3, …(2) } ]

[Killed] ConditionalExpression
vue/src/composables/useLayoutStorage.ts:131:6
     load();
   }
 
-  if(autoSave) {
+  if(false) {
     let debounceHandle: ReturnType<typeof setTimeout> | undefined;
     watch(
killedBy: useLayoutStorage Should auto-save (debounced) when autoSave is true
statusReason: expected null to be '[{"h":2,"i":"0","w":4,"x":0,"y":0}]' // Object.is equality

[Killed] BlockStatement
vue/src/composables/useLayoutStorage.ts:131:16
     load();
   }
 
-  if(autoSave) {
-    let debounceHandle: ReturnType<typeof setTimeout> | undefined;
-    watch(
-      layout,
-      () => {
-        if(debounceHandle !== undefined) {
-          clearTimeout(debounceHandle);
-        }
-        debounceHandle = setTimeout(save, debounceMs);
-      },
-      { deep: true },
-    );
-  }
+  if(autoSave) {}
 
   return { save, load, clear, hasSaved };
killedBy: useLayoutStorage Should auto-save (debounced) when autoSave is true
statusReason: expected null to be '[{"h":2,"i":"0","w":4,"x":0,"y":0}]' // Object.is equality

[Killed] BlockStatement
vue/src/composables/useLayoutStorage.ts:135:13
     let debounceHandle: ReturnType<typeof setTimeout> | undefined;
     watch(
       layout,
-      () => {
-        if(debounceHandle !== undefined) {
-          clearTimeout(debounceHandle);
-        }
-        debounceHandle = setTimeout(save, debounceMs);
-      },
+      () => {},
       { deep: true },
     );
killedBy: useLayoutStorage Should auto-save (debounced) when autoSave is true
statusReason: expected null to be '[{"h":2,"i":"0","w":4,"x":0,"y":0}]' // Object.is equality

[Killed] ConditionalExpression
vue/src/composables/useLayoutStorage.ts:136:12
     watch(
       layout,
       () => {
-        if(debounceHandle !== undefined) {
+        if(false) {
           clearTimeout(debounceHandle);
         }
killedBy: useLayoutStorage Should debounce rapid successive changes into a single save, not one per change
statusReason: expected "setItem" to be called 1 times, but got 3 times

[Killed] EqualityOperator
vue/src/composables/useLayoutStorage.ts:136:12
     watch(
       layout,
       () => {
-        if(debounceHandle !== undefined) {
+        if(debounceHandle === undefined) {
           clearTimeout(debounceHandle);
         }
killedBy: useLayoutStorage Should debounce rapid successive changes into a single save, not one per change
statusReason: expected "setItem" to be called 1 times, but got 3 times

[Survived] BooleanLiteral
vue/src/composables/useLayoutStorage.ts:141:15
         }
         debounceHandle = setTimeout(save, debounceMs);
       },
-      { deep: true },
+      { deep: false },
     );
   }

[Killed] ObjectLiteral
vue/src/composables/useLayoutStorage.ts:145:10
     );
   }
 
-  return { save, load, clear, hasSaved };
+  return {};
 }
 
killedBy: useLayoutStorage Should save the current layout to the given storage
statusReason: save is not a function
